[
    {
        "title": "SC stops Comelec from disqualifying 5 bets in 2025 midterm polls",
        "link": "https://www.manilatimes.net/2025/01/14/news/sc-stops-comelec-from-disqualifying-5-bets-in-2025-midterm-polls/2038476",
        "description": "<p>MANILA, Philippines — The Supreme Court on Tuesday issued temporary restraining orders (TROs) stopping the Commission on Elections (Comelec) from enforcing its rulings to disqualify or reject the filing of certificates of candidacy (COCs) of five individuals seeking to run for different positions in the upcoming national and local elections.</p>\n\n<p>During its first en banc session for the year, the high tribunal granted TROs prohibiting the Comelec from declaring Subair Guinthum Mustapha and Charles Savellano as nuisance candidates in their bid to run for the Senate and as Ilocos Sur 1st District representative, respectively.</p>\n\n<p>The high court ordered the Comelec to comment on the petitions of Mustapha and Savellano within a non-extendible period of five days from receipt of notice and required the personal service and filing of the resolution and comment.</p>\n\n<p>The Court also granted a TRO in favor of Chito Bulatao Balintay, a member of the indigenous peoples of Zambales, who filed a petition challenging the Comelec's resolution rejecting his application, which prevented him from filing his COC for Zambales governor.</p>\n\n<p>This in effect directs the poll body to accept and give due course to Balinay's COC, the tribunal said.</p>\n\n<p>In other rulings, the court granted TROs in favor of Edgar Erice who was disqualified by the Comelec in his bid as representative of Caloocan City's 2nd District, and Florendo de Ramos Ritualo Jr. who is challenging the Comelec resolution canceling his COC for Sangguniang Panlungsod (City Council) member for San Juan City's 1st District.</p>\n\n<p>The High Court directed the Comelec to file its comment on the cases of Balintay, Erice, and Ritualo within a non-extendible period of 10 days from receipt of notice.</p>",
        "published": "Tue, 14 Jan 2025 20:25:45 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/sc-stops-comelec-from-disqualifying-5-bets-in-2025-midterm-polls/2038476"
    },
    {
        "title": "Pasig elderly decry lack of healthcare benefits",
        "link": "https://www.manilatimes.net/2025/01/14/news/pasig-elderly-decry-lack-of-healthcare-benefits/2038377",
        "description": "<p>The Federation of Pasig Senior Citizens Association (FPSCA) on Tuesday decried the lack of healthcare programs and benefits for them by the Pasig City government.</p>\n\n<p>In a statement, the group said that medical services are one of the most critical needs of elderly Pasiguenyos.</p>\n\n<p>\"Availing of medical services is our primary problem,\" FPSCS president Alexander Arreola said.</p>\n\n<p>\"Our major concerns as senior citizens are healthcare benefits, programs, and facilities. But what the city government provides is inadequate,\" he added.</p>\n\n<p>Arreola lamented the lack of accessible healthcare programs for the elderly such as mobile medical missions that provide regular medical consultations.</p>\n\n<p>The group said that City Hall provides some medical services such as vaccines for animal bites but these are insufficient to meet the needs of senior citizens.</p>\n\n<p>The FPSCA president said that the distribution of maintenance medicines for elderly Pasiguenyos is often delayed.</p>\n\n<p>\"The waiting time and distribution of medicines and maintenance supplies take too long. Sometimes, there's a shortage. Care and attention for senior citizens are lacking,\" said FPSCS Vice President Reynaldo Malilay.</p>\n\n<p>He said that the lack of healthcare services is the reason why the poor flock to medical missions such as those conducted by the St. Gerrard Charity Foundation, led by the family of Sarah Discaya or \"Ate Sarah.\"</p>\n\n<p>Discaya said that the turnout in their medical missions was overwhelming.</p>\n\n<p>\"This is why I want to provide better hospital services because that is what's lacking now — hospital services. Our health centers don't have enough medicines,\" she said.</p>\n\n<p>The Manila Times tried but failed to get a statement from Mayor Vico Sotto on the group's claims.</p>\n\n<p>Meanwhile, some residents have observed that the city government has been very frugal with the city's basic needs and services, such as school supplies and healthcare services.</p>\n\n<p>Last year, the city dropped in the 2024 Rankings of Highly Urbanized Cities under the Cities and Municipalities Competitive Index of the Department of Trade and Industry from 6th place in 2019 to 9th.</p>\n\n<p>Its government efficiency category ranking fell from 4th place in 2019 to 10th last year.</p>",
        "published": "Tue, 14 Jan 2025 19:05:23 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/pasig-elderly-decry-lack-of-healthcare-benefits/2038377"
    },
    {
        "title": "Navotas honors 10 most outstanding fishermen",
        "link": "https://www.manilatimes.net/2025/01/14/news/navotas-honors-10-most-outstanding-fishermen/2038370",
        "description": "<p style=\"text-align: start;\">Reaffirming its pride as the \"Fishing Capital of the Philippines,\" the Navotas City government honored the Top 10 Most Outstanding Fisherfolk in celebration of the 119th Navotas City Day.</p>\n\n<p style=\"text-align: start;\">Mayor John Rey Tiangco on Monday led other key officials, including his brother Rep. Tobias Tiangco, in recognizing the fishermen \"whose dedication and resilience have sustained generations and propelled the city's progress.\"</p>\n\n<p style=\"text-align: start;\">Also, the Tiangco brothers praised the vital contributions of the city's fishing community.</p>\n\n<p style=\"text-align: start;\">\"You are the reason why our city was known to be the 'Fishing Capital of the Philippines.' This day, we celebrate and honor you all for your sacrifices to your family and your community,\" the mayor said.</p>\n\n<p style=\"text-align: start;\">Renato C. Abad of Barangay Tangos North led this year's Top 10 Most Outstanding Fisherfolk.</p>\n\n<p style=\"text-align: start;\">A fisherman since he was 15, Abad turned his humble beginnings into a story of triumph, supporting his family of six, helping three of his children graduate from college, and founding the Small Commercial Fishing Consumers Cooperative of Navotas.</p>\n\n<p style=\"text-align: start;\">His success goes beyond personal achievement, serving as a testament to the boundless opportunities borne out of hard work and innovation in the fishing industry, the local government said.</p>\n\n<p style=\"text-align: start;\">To qualify for the Top 10 Fisherfolk, nominees must be registered Navotenyo fishermen endorsed by their respective barangay and barangay fisheries and aquatic resources management council chairperson.</p>\n\n<p style=\"text-align: start;\">Furthermore, they must be upstanding citizens with no pending or ongoing cases or prior convictions, and they must have created milestones worthy of emulation and inspiration for their fellow fisher folk.</p>\n\n<p style=\"text-align: start;\">The awardees received cash prizes ranging from ₱4,000 to ₱10,000, plaques of recognition, and additional incentives such as groceries and rice.</p>\n\n<p style=\"text-align: start;\">All Top 10 awardees are eligible to nominate a family member for the 'NavotaAs Ulirang Pamilyang Mangingisda' Scholarship, which includes a yearly allowance of ₱16,500 for transportation and food, as well as a ₱1,500 book stipend per academic year.</p>\n\n<p style=\"text-align: start;\">Also, the 'Araw ng Mangingisda' showcased the fisher folk's strength and skill through competitions.</p>\n\n<p style=\"text-align: start;\">Boat race winners received prizes up to ₱20,000 while participants in the net mending contest won up to ₱5,000. All competitors also took home 10 kilos of rice, the city government said.</p>\n\n<p style=\"text-align: start;\">\"The Araw ng Mangingisda stands as a powerful reminder of the city's rich heritage and the enduring role of its fishing community in shaping Navotas' identity,\" the city chief executive said.</p>\n\n<p style=\"text-align: start;\">Meanwhile, Rep. Tiangco said that it is a celebration not just of the past \"but of the brighter future that lies ahead for Navotenyos.\" </p>",
        "published": "Tue, 14 Jan 2025 18:39:47 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/navotas-honors-10-most-outstanding-fishermen/2038370"
    },
    {
        "title": "Sara's trust, performance ratings drop below 50% – OCTA",
        "link": "https://www.manilatimes.net/2025/01/14/news/saras-trust-performance-ratings-drop-below-50-octa/2038358",
        "description": "<p>MANILA, Philippines -- Vice President Sara Duterte's trust and performance ratings dropped below 50 percent for the first time since her term began in 2022, according to the latest survey conducted by OCTA Research.</p>\n\n<p>In the fourth quarter Tugon ng Masa survey conducted from Nov. 10-16, 2024, Duterte's trust rating fell from 59 percent in the second quarter survey to 49 percent.</p>\n\n<p>OCTA said that Duterte's rating was the lowest since December 2023 and reflected a continuing downward trend.</p>\n\n<p>Her performance rating also decreased further, with only 48 percent expressing satisfaction, down four percentage points from 52 percent in the previous quarter, her lowest since December 2023 and also reflected a downward trend.</p>\n\n<p>Meanwhile, President Ferdinand Marcos Jr. 's trust and performance ratings dipped slightly from the previous quarter, with his trust rating down by four percent from 69 percent to 65 percent, and his performance rating from 66 percent to 64 percent.</p>\n\n<p>Senate President Francis Escudero and Speaker Martin Romualdez's trust and performance ratings also dipped with Escudero posting 63 percent trust and 65 percent performance satisfaction ratings, and Romualdez 58 percent trust and 59 percent performance satisfaction ratings.</p>\n\n<p>The survey had 1,200 respondents and has a margin of error of plus or minus three percent nationwide. </p>",
        "published": "Tue, 14 Jan 2025 18:02:46 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/saras-trust-performance-ratings-drop-below-50-octa/2038358"
    },
    {
        "title": "Marcos to DOH: Ensure PhilHealth services unhampered",
        "link": "https://www.manilatimes.net/2025/01/14/news/marcos-to-doh-ensure-philhealth-services-unhampered/2038347",
        "description": "<p>MANILA, Philippines — President Ferdinand Marcos Jr. ordered the Department of Health (DOH) to ensure that services provided by the Philippine Health Insurance Corporation (PhilHealth) would remain unhampered despite not receiving any government subsidy for this fiscal year.</p>\n\n<p>Marcos gave the directive during his meeting with Health Secretary Teodoro Herbosa and other select Cabinet officials in Malacañang on Tuesday.</p>\n\n<p>\"Make sure that services of PhilHealth remain unhampered ... it (zero budget) should not affect the delivery of healthcare services,\" he was quoted as saying.</p>\n\n<p>To recall, the chief executive backed the decision of Congress to not give the health state insurer even a centavo of government subsidy, insisting that \"they have sufficient funds to carry on.\"</p>\n\n<p>Marcos also pointed out that the money for the government subsidy was only lying idle in the bank under PhilHealth's account and not being utilized – a big waste since the government could have used the funds for its other programs.</p>\n\n<p>Despite this, both the President and the DOH have assured the public that PhilHealth would remain stable and that the government would exhaust all efforts for Filipinos to receive maximum benefits from the insurer.</p>\n\n<p>Meanwhile, Marcos reminded Herbosa to realign DOH's focus from cure to prevention, stressing that \"an ounce of prevention is better than a pound in cure\" and that the agency should ramp up efforts to provide ample and quality health and medical care to citizens.</p>\n\n<p>This, as he reiterated his administration's commitment to prioritizing social services in the 2025 national budget, focusing on key sectors such as education, health, economic services, infrastructure and agriculture.</p>",
        "published": "Tue, 14 Jan 2025 17:25:40 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/marcos-to-doh-ensure-philhealth-services-unhampered/2038347"
    },
    {
        "title": "PH ramps up surveillance in WPS amid China's presence in economic zone",
        "link": "https://www.manilatimes.net/2025/01/14/news/ph-ramps-up-surveillance-in-wps-amid-chinas-presence-in-economic-zone/2038346",
        "description": "<p>MANILA, Philippines — The Philippines ramped up its surveillance efforts in the West Philippine Sea following the continued presence of the China Coast Guard's (CCG) so-called \"Monster\" ship within the country's exclusive economic zone (EEZ).</p>\n\n<p>National Security Council Assistant Director General Jonathan Malaya confirmed the deployment of two Philippine Coast Guard (PCG) vessels to monitor the movements of the CCG ship. Additionally, aerial assets from the Armed Forces of the Philippines (AFP) and PCG have been mobilized to maintain vigilance over the area.</p>\n\n<p>\"Our maritime domain awareness is now laser-focused on addressing the illegal presence of the Chinese Coast Guard vessel,\" Malaya said during a press briefing on Tuesday.</p>\n\n<p>Malaya emphasized that the National Maritime Council demanded the withdrawal of the CCG vessel from Philippine waters, labeling its presence as a clear violation of international law.</p>\n\n<p>\"In terms of their objective—to intimidate our fishermen and our nation—it is evident that these intimidation tactics are failing,\" he said.</p>\n\n<p>Malaya also reaffirmed the government's commitment to supporting Filipino fishermen and standing firm against the unlawful presence of Chinese vessels in Philippine waters.</p>\n\n<p>\"We are not tolerating their presence. We are challenging them every single day,\" Malaya said.</p>\n\n<p>The PCG reported on Monday that the CCG 5901 had come alarmingly close to Philippine shores, approximately 67 nautical miles off the coast of Zambales—well within the country's EEZ.</p>\n\n<p>The incident coincided with the temporary return of the BRP Teresa Magbanua, a key PCG patrol vessel, to Bataan for minor repairs.</p>\n\n<p>As of Tuesday, the PCG marked its eleventh consecutive day of monitoring and pursuing the CCG vessel.</p>",
        "published": "Tue, 14 Jan 2025 17:22:40 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/ph-ramps-up-surveillance-in-wps-amid-chinas-presence-in-economic-zone/2038346"
    },
    {
        "title": "Sara 'seriously considering' 2028 run",
        "link": "https://www.manilatimes.net/2025/01/14/news/sara-seriously-considering-2028-run/2038339",
        "description": "<p style=\"text-align: start;\">MANILA, Philippines — Vice President Sara Duterte said that she was \"seriously considering\" a possible run in the 2028 Elections, her first public acknowledgment of her political plans in the next three years.</p>\n\n<p>In a video posted on SMNI News owned by Duterte ally and deposed televangelist Apollo Quiboloy on Monday, a supporter asked a question whether she would run in the 2028 elections.</p>\n\n<p>\"We are seriously considering... I really believe that our country will be great. Mahirap siyang ipaintindi sa ating mga kababayan (It will be hard to explain to our countrymen) because you really had to stand firm especially with government policies,\" Duterte told the audience during a meet and greet in Tokyo, Japan.</p>\n\n<p>Duterte added that there would be progress if there would be \"genuine unity\" in the government.</p>\n\n<p>Supporters of Duterte were heard chanting with excitement when they heard that she was considering a run in the 2028 elections.</p>\n\n<p style=\"text-align: start;\">Duterte had told a media conference last year that she would reveal her political plans by the fourth quarter of 2026. </p>",
        "published": "Tue, 14 Jan 2025 17:09:10 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/sara-seriously-considering-2028-run/2038339"
    },
    {
        "title": "Filipinos in Southern California advised to heed 'red flags' amid threats of wildfire spread",
        "link": "https://www.manilatimes.net/2025/01/14/news/filipinos-in-southern-california-advised-to-heed-red-flags-amid-threats-of-wildfire-spread/2038254",
        "description": "<p>MANILA, Philippines — Filipinos in Southern California were advised to be on alert against wildfires as \"red flag\" warnings were in effect over parts of Los Angeles and Ventura Counties until Jan. 15.</p>\n\n<p>A red flag warning indicates dry and windy conditions that could lead to the \"rapid spread of wildfires,\" the Philippine Consulate General (PCG) in Los Angeles said in its advisory.</p>\n\n<p>It also said that particularly dangerous situation (PDS) red flag warnings would take effect Tuesday up Wednesday in Western San Gabriel Mountains, I5 Corridor, South Ventura Mountains, Santa Susana Mountains, Ventura Valleys, Western Santa Monicas, Northern San Fernando Valley, and Ventura County Coastal Plain.</p>\n\n<p>The PCG said a PDS red flag warning \"signifies elevated fire weather conditions.\"</p>\n\n<p>\"Filipinos in affected areas are strongly encouraged to monitor weather developments,\" the consulate said.</p>\n\n<p>The PCG said its consular operations remained unhampered despite the wildfires.</p>\n\n<p>It issued the advisory as it visited evacuation centers to check on the condition of Filipino Americans affected by the wildfires in Southern California and nearby areas.</p>\n\n<p>\"Clients with confirmed appointments can come to our office as scheduled,\" the PCG said in its advisory posted on Facebook.</p>\n\n<p>Meanwhile, those who are unable to come for their appointments on account of the wildfires can come at a later date when able,\" it added.</p>",
        "published": "Tue, 14 Jan 2025 12:51:46 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/filipinos-in-southern-california-advised-to-heed-red-flags-amid-threats-of-wildfire-spread/2038254"
    },
    {
        "title": "Marcos opposition to Sara impeach raps unchanged -- Palace",
        "link": "https://www.manilatimes.net/2025/01/14/news/marcos-opposition-to-sara-impeach-raps-unchanged-palace/2038253",
        "description": "<p>MANILA, Philippines — The \"National Rally for Peace\" by the Iglesia ni Cristo (INC) has no effect on President Ferdinand Marcos Jr.'s position on the impeachment cases against Vice President Sara Duterte, Malacañang said Tuesday.</p>\n\n<p>Executive Secretary Lucas Bersamin said in a statement that the President's \"position on the impeachment proceedings in the House of Representatives has not changed.\" Marcos said that he did not support the impeachment of Duterte as it would not benefit the Filipino people.</p>\n\n<p>\"This is not important. This does not make any difference to even one single Filipino life. So, why waste time on this?\" the President said.</p>\n\n<p>\"What will happen if somebody files an impeachment? It will tie down the House, it will tie down the Senate. It will just take up all our time and for what? For nothing, for nothing. None of this will help improve a single Filipino life,\" he added.</p>\n\n<p>On Monday, more than a million members of the INC gathered in a rally at the Quirino Grandstand in Manila to call for peace and unity amid steps to unseat Duterte through impeachment.</p>\n\n<p>The rally came amid political tensions, as at least three impeachment complaints have been filed against the vice president at the House, following legislative inquiries into her alleged misuse of confidential funds.</p>\n\n<p>In a statement on Monday, Bersamin expressed hope that the INC peace rally would help clarify issues and contribute to real unity.</p>\n\n<p>He said peaceful assembly was a \"bedrock right guaranteed by our Constitution\" that the current administration consistently upholds.</p>\n\n<p>\"We do not doubt that today's gatherings will be peaceful, orderly, and meaningful,\" Bersamin said in a statement.</p>\n\n<p>\"Above all, we hope the opinions expressed will help clarify issues facing our country and lead us to the true unity we long for,\" he added.</p>\n\n<p>INC, estimated to have more than two million members, carries significant weight in the country because its members tend to vote as a block and it is often courted by politicians.</p>\n\n<p>The sect could decide the outcome of closely contested congressional and local government posts in the midterm elections on May 12.</p>\n\n<p>INC supported the candidacy of Marcos and Duterte during the 2022 national elections.</p>",
        "published": "Tue, 14 Jan 2025 12:42:57 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/marcos-opposition-to-sara-impeach-raps-unchanged-palace/2038253"
    },
    {
        "title": "P73M illegal drugs seized at NAIA",
        "link": "https://www.manilatimes.net/2025/01/14/news/p73m-illegal-drugs-seized-at-naia/2038244",
        "description": "<p>MANILA, Philippines — More than 10 kilograms of illegal drugs worth some P73 million has been intercepted by operatives of the Bureau of Customs (BoC) at the Terminal 3 of the Ninoy Aquino International Airport (NAIA).</p>\n\n<p>Customs Commissioner Bienvenido Rubio disclosed on Tuesday that the illegal shipment was discovered by customs airport operatives, in coordination with the NAIA Inter-Agency Drug Interdiction Task Group (IADITG), in an abandoned inbound luggage.</p>\n\n<p>Rubio said that based on the report submitted by NAIA Customs District Collector Yasmin O. Mapa, the abandoned luggage was traced back to a passenger who had traveled from South Africa, with a stopover in Doha, Qatar, before reaching Manila.</p>\n\n<p>Found inside the luggage was 10,706 grams or 10.7 kilos of methamphetamine hydrochloride, commonly known as shabu, with an estimated value of P72.8 million.</p>\n\n<p>Hidden within the luggage were improvised pouches made of packaging tape wrapped in black carbon paper, strategically concealed in five handbags, four file organizer bags, and one portfolio bag.</p>\n\n<p>Rubio said the identity of the passenger has been withheld pending results of ongoing investigation.</p>\n\n<p>The interdiction operation involved other agencies, including the BOC-Customs Anti-Illegal Drugs Task Force, the Philippine Drug Enforcement Agency (PDEA), the Philippine National Police Aviation Security Group (PNP-AVSEG), the Airport Police Department, the PNP Drug Enforcement Group, and the National Bureau of Investigation (NBI).</p>\n\n<p>The seized illicit drugs were immediately turned over to PDEA for proper handling, and further investigation was underway for violations of Republic Act (RA) 9165 (Comprehensive Dangerous Drugs Act of 2002) and RA 10863 (Customs Modernization and Tariff Act).</p>\n\n<p>Rubio said the operation served as a stern warning to drug traffickers, signaling the BOC-NAIA's firm stance against drug smuggling and other forms of illegal trade.</p>\n\n<p>\"Our efforts reflect the BOC's determination to take decisive action against illegal drug smuggling and ensure the safety of our communities,\" added Rubio.</p>",
        "published": "Tue, 14 Jan 2025 12:00:21 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/p73m-illegal-drugs-seized-at-naia/2038244"
    },
    {
        "title": "DOH asked to probe drug stores that refuse seniors' discounts",
        "link": "https://www.manilatimes.net/2025/01/14/news/doh-asked-to-probe-drug-stores-that-refuse-seniors-discounts/2038241",
        "description": "<p style=\"text-align: start;\">MANILA, Philippines — Camarines Sur 2nd District Rep. Luis Raymund Villafuerte urged the Department of Health (DOH) to investigate reports that certain drug stores or pharmacies have refused to grant discounts to senior citizens amid a new order requiring elderly customers to present their senior ID cards and prescription to avail of the discount.</p>\n\n<p>\"The DoH and other appropriate government Offices need to check on the compliance of drugstores with DOH AO (Administrative Ordr.) 2024-0017 and to crack down on erring establishments, as the reported refusal of certain pharmacies to sell prescription meds to elderly Filipinos is a blatant breach of RA (Republic Act No.) 9994,\" Villafuerte said in a statement on Tuesday.</p>\n\n<p>Villafuerte also urged the DoH and other relevant agencies to expand this privilege to allow persons with disabilities to present only their IDs and prescriptions when availing of medical discounts over the counter, as well as removing the seniors' booklet when they purchase their basic commodities in groceries.</p>\n\n<p>Health Secretary Teodoro Herbosa issued the said administrative order last Dec. 23, saying that requiring senior citizens to present purchase booklets during every transaction to avail of the 20 percent senior discount results in \"undue burden and difficulties.\"</p>\n\n<p>\"I am also a senior citizen. I know it is hard to always bring a purchase booklet with you. Seniors need the discount on their medicines, and we must make it easy for them to get that,\" Herbosa said.</p>",
        "published": "Tue, 14 Jan 2025 11:55:45 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/doh-asked-to-probe-drug-stores-that-refuse-seniors-discounts/2038241"
    },
    {
        "title": "Lee Min Ho to hold 'MINHOVERSE' fan meet in Manila",
        "link": "https://www.manilatimes.net/2025/01/14/news/lee-min-ho-to-hold-minhoverse-fan-meet-in-manila/2038236",
        "description": "<p>MANILA, Philippines — Popular South Korean actor Lee Min Ho is set to return to Manila for his much-anticipated fanmeet, \"MINHOVERSE,\" this 2025.</p>\n\n<p>In his official X account, the actor announced he would hold a fanmeet in Seoul, Bangkok, Macau, Taipei, Jakarta, Manila and Tokyo, respectively.</p>\n\n\n\n\n\n<p>\"Countless Minoz have come together to create the world of Minho, MINHOVERSE. Now, let's continue this journey together, even closer,\" the actor said.</p>\n\n<p>The details of the schedule and venues have yet to be announced, and are subject to changes.</p>\n\n<p>Lee Min Ho is best known for his roles in popular k-dramas such as \"Boys Over Flowers,\" \"Legend of the Blue Sea,\" \"The Heirs,\" and many more.</p>\n\n<p>The actor's last visit in the Philippines was for his brand promotions in October of 2023.</p>",
        "published": "Tue, 14 Jan 2025 11:20:57 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/lee-min-ho-to-hold-minhoverse-fan-meet-in-manila/2038236"
    },
    {
        "title": "3 weather systems to bring rains in parts of PH but no storm in sight — Pagasa",
        "link": "https://www.manilatimes.net/2025/01/14/news/3-weather-systems-to-bring-rains-in-parts-of-ph-but-no-storm-in-sight-pagasa/2038205",
        "description": "<p>MANILA, Philippines — Amid the three weather systems that bring scattered and isolated rains, a storm over the next five days is unlikely, the Philippine Atmospheric Geophysical and Astronomical Services Administration (Pagasa) said Tuesday.</p>\n\n<p>Weather specialist Cheney Dominguez said in a 5a.m. briefing fthe shear line or the convergence of hot and cold air has been continuously affecting Eastern Visayas, Bicol Region, Mimaropa (Mindoro, Marinduque, Romblon and Palawan) and Quezon where overcast skies would prevail.</p>\n\n<p>\"Flash floods or landslides due to moderate to heavy rains would be possible in these areas,\" the Pagasa forecaster said.</p>\n\n<p>The easterlies - winds coming from the east and passing through the Pacific Ocean that carry humid and warm weather - would be experienced over Caraga and Davao Region.</p>\n\n<p>Another weather system, the northeast monsoon or \"amihan,\" will be bringing cloudy skies with rains over Metro Manila, Cagayan Valley, Cordillera Administrative Region, Aurora, Bulacan, Cavite, Laguna, Batangas, and Rizal in 24 hours, the national weather agency said.</p>\n\n<p>Over the rest of Luzon, amihan will also bring partly cloudy to cloudy skies with isolated light rains.</p>\n\n<p>The rest of the country, the state-run weather bureau said, would be experiencing isolated rain showers or thunderstorms also due to the easterlies.</p>",
        "published": "Tue, 14 Jan 2025 08:22:38 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/3-weather-systems-to-bring-rains-in-parts-of-ph-but-no-storm-in-sight-pagasa/2038205"
    },
    {
        "title": "Over 1M members show up for INC rally",
        "link": "https://www.manilatimes.net/2025/01/14/news/over-1m-members-show-up-for-inc-rally/2037445",
        "description": "<p>(UPDATE) MORE than a million members of the Iglesia Ni Cristo (INC) converged at the Quirino Grandstand on Monday for a National Peace Rally, calling for national unity and calm as political tensions escalate.</p>\n\n<p>According to a report by the Philippine National Police (PNP), the crowd swelled to 1.5 million by noon.</p>\n\n<p>The PNP said the situation remained peaceful as the tally of attendees continued to increase.</p>\n\n<p>Simultaneous rallies were also held in cities across the country, including Legazpi, Ilagan, and Puerto Princesa in Luzon; Cebu, Iloilo, and Bacolod in the Visayas; and Davao, Pagadian, Butuan, and Cagayan de Oro in Mindanao.</p>\n\n<p>The massive turnout reflected the INC's ability to draw vast numbers in support of its call for peace. The crowd, composed of families, students, and elderly participants, carried banners and placards with messages like \"Kapayapaan para sa Bayan\" (Peace for the Nation) and \"Pagkakaisa sa Gitna ng Pagsubok\" (Unity Amid Challenges).</p>\n\n<p>The peaceful atmosphere at the Quirino Grandstand mirrored the rally's overarching theme. The absence of disturbances, as noted in the PNP's report, stood in stark contrast to the political turbulence gripping the country.</p>\n\n<p>However, while INC leaders maintained that the rally was apolitical and solely focused on fostering peace, many attendees expressed sentiments that blurred the lines between advocating for unity and supporting embattled Vice President Sara Duterte. Analysts saw the rally as an effort to shield the vice president from impeachment in connection with her alleged misuse of confidential funds, charges she has denied.</p>\n\n<p>The INC opposes moves to impeach Duterte in the House of Representatives.</p>\n\n<p>\"There are many more things which our citizens need that must be attended to. These will not be achieved if all we see taking place is conflict,\" church spokesman Edwil Zabala said ahead of the rally.</p>\n\n<p>Duterte said the INC rally on Monday was a powerful show of unity.</p>\n\n<p>Speaking in Filipino, Duterte thanked INC members for their \"continued effort to bring understanding and unity to our countrymen.\"</p>\n\n<p>She said that amid poverty and other challenges, \"a peaceful and united Philippines will never waver and will always rise amid the challenge of the times.\"</p>\n\n<p>Several participants interviewed by The Manila Times on Monday revealed their concerns about the impeachment complaints against Duterte. Many openly opposed the efforts to unseat her, citing the need to preserve government stability amid deepening divisions.</p>\n\n<p>Early in the morning, 75-year-old Edgardo arrived with his wife and neighbors from Laguna. Holding a handwritten sign that read \"Itigil ang Impeachment, Bigyan ng Kapayapaan ang Bayan\" (Stop the Impeachment, Give Peace to the Nation), Ramos called on politicians to \"not make the situation worse.</p>\n\n<p>\"The government needs to unite for the nation,\" he said.</p>\n\n\n\n<p>Kat and Christine, cousins from San Fernando in Pampanga, said they joined the rally to express their hopes for a unified and stable nation.</p>\n\n<p>\"Ang gulo-gulo na ng nangyayari. Parang wala nang nagkakasundo sa mga lider natin (Things are so chaotic now. It seems like none of our leaders can agree on anything),\" Kat said, lamenting the chaotic political climate.</p>\n\n<p>Christine echoed her cousin's sentiments, saying that they joined the event to show they want unity.</p>\n\n<p>\"Kaya kami nandito ay para ipakita na gusto namin ng pagkakaisa. Suportado namin ang panawagan para sa kapayapaan (We're here to show that we want unity. We support the call for peace),\" she said.</p>\n\n<p>Young attendees, such as 18-year-old students Carlo and Adrian from Taguig City, voiced their fears about the nation's future.</p>\n\n<p>\"Kapag nagpatuloy ang hindi pagkakaunawaan, baka lalo pang magkagulo (If misunderstandings continue, the situation might worsen),\" Carlo said.</p>\n\n<p>\"Sana po magkaisa ang mga lider natin para hindi maapektuhan ang mga Pilipino (I hope our leaders unite so Filipinos won't be affected),\" Adrian added.</p>\n\n<p>Others traveled great distances to participate.</p>\n\n<p>Nora, 63, from Antipolo City, arrived early with her friends, holding a sign that read \"Kapayapaan para sa Bayan\" (Peace for the Nation).</p>\n\n<p>\"Nandito kami para ipakita na mahalaga ang pagkakaisa. Ayaw naming magulo ang Pilipinas (We're here to show that unity is important. We don't want the Philippines to be in chaos),\" she said.</p>\n\n<p>Alfredo, a 72-year-old retired teacher from Laoag, Ilocos Norte, journeyed overnight with his family to join the rally.</p>\n\n<p>\"Hindi namin gusto ang impeachment. Kailangan magkaisa ang lahat para hindi lumala ang problema (We don't want impeachment. Everyone needs to unite to prevent the problem from worsening),,\" he said.</p>\n\n<p>The rally unfolded against the backdrop of three impeachment complaints filed in the House of Representatives against Vice President Duterte.</p>\n\n<p>During the rally, Manila Mayor Honey Lacuna said the local government of Manila is supporting President Ferdinand Marcos Jr.'s opposition to the impeachment of Vice President Duterte.</p>\n\n<p>\"The local government of Manila supports our President's call regarding the impeachment,\" Lacuna said in an interview at the Quirino Grandstand.</p>\n\n<p>Lacuna said she attended the rally to join the church's call for unity within the government.</p>\n\n<p>\"The City of Manila is here to join calls for unity and peace,\" she said.</p>\n\n<p>Malacañang expressed hope that the \"National Rally for Peace\" initiated by the INC would help clarify many issues being faced by the nation.</p>\n\n<p>Executive Secretary Lucas Bersamin made the remark as he reiterated that moving to peaceably assemble is a \"bedrock right\" of the people, recognized and guaranteed by the Constitution and respected by the present leadership.</p>\n\n<p>The state disaster agency said extensive emergency response measures have been implemented to ensure the safety and well-being of all attendees.</p>\n\n<p>Edwin Nasol, vice president for disaster preparedness and emergency response of the Society Communicators and Networks (SCAN), said 17,000 emergency first responders from the INC were deployed to attend to all kinds of medical issues confronting the participants.</p>\n\n<p>He said the comprehensive response team was supported by 120 personnel from the Manila Disaster Risk Reduction and Management Office, who worked alongside two light urban search and rescue teams from the Philippine Army's 525th Engineer Combat Battalion.</p>\n\n<p>Additionally, 5,000 personnel from the Philippine National Police and 1,200 members of the Metropolitan Manila Development Authority (MMDA) were also on hand to maintain order and assist with crowd management.</p>\n\n<p>The MMDA said they observed heavier traffic than usual from Monday morning until the afternoon, particularly along the Quiapo area in Manila, while the INC held a peace rally at the Quirino Grandstand.</p>\n\n<p>MMDA Chairman Don Artes said several streets saw increased traffic, particularly in Manila and Pasay.</p>\n\n<p>The PNP said that as of 10 a.m., some 1.5 million people attended the gathering at the Quirino Grandstand in Manila for the INC rally.</p>\n\n<p>Several roads were closed, too, to give way to the rally.</p>\n\n<p>Also, Commission on Elections Chairman George Erwin Garcia expressed support for the INC's nationwide \"peace rally,\" even as he said he despised any attempt by political aspirants to use the gathering for their personal interest in relation to the upcoming midterm polls.</p>\n\n<p>Garcia said the INC has all the good intentions in organizing the rally and should not be taken advantage of by grandstanding politicians to jumpstart their campaign for the coming May 12, 2025 national and local elections.</p>\n\n<p>Sen. Imee Marcos, a staunch ally of the vice president, said the INC rally for peace was \"not against\" the separation between the Church and the State.</p>\n\n<p>She made the remark as fellow senators Francis Tolentino and Ronald Dela Rosa attended the event held at the Quirino Grandstand in Manila.</p>\n\n<p>\"The peace rally is sanctioned, and in fact, encouraged, by the free speech clause of our Constitution,\" Marcos said.</p>\n\n<p>Senate President Francis Escudero said, \"A prayer rally for peace and unity in the country, I believe, is non-debatable. Who wouldn't want that? I surely want that.\"</p>\n\n<p>WITH BERNADETTE E. TAMAYO, FRANCIS EARL CUETO, WILLIAM B. DEPASUPIL, FRANCISCO TUYAY AND AGENCE FRANCE-PRESSE</p>",
        "published": "Tue, 14 Jan 2025 00:20:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/over-1m-members-show-up-for-inc-rally/2037445"
    },
    {
        "title": "Govt to probe alleged PNP 'conspiracy'",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/govt-to-probe-alleged-pnp-conspiracy/2038017",
        "description": "<p>THE government is poised to investigate an alleged \"grand conspiracy\" in the Philippine National Police (PNP) to sweep controversial drug cases under the rug.</p>\n\n<p>Local Government Secretary Jonvic Remulla made the remark following the filing of administrative charges against 30 policemen, including several high-ranking officers, involved in a 2022 \"simulated\" buy-bust in Manila that resulted in the largest drug haul in the country.</p>\n\n<p>\"Our theory is this all goes all the way to 2016 until they are caught in 2022. It seems that it became a standard procedure of some elements of the PNP to seize a haul, give a partial report, and then stash away the rest,\" Remulla said in a briefing in Malacañang.</p>\n\n<p> \"There seems to be a grand conspiracy to conceal a criminal enterprise. Look at the case, from sergeant to chief PNP; all are included in the story,\" he added.</p>\n\n<p>The official was referring to a \"drug raid\" on a company called Wealth and Personal Development Lending Inc. (WPD Lending) on Oct. 8, 2022, which led to the seizure of 990 kilograms of methamphetamine hydrochloride, also known as \"shabu\" worth P6.7 billion.</p>\n\n<p>Arrested during the operation were Master Sgt. Rodolfo Mayo, a member of the PNP Drug Enforcement Group and one of the respondents and a certain Ney Atadero.</p>\n\n<p>Also implicated were Lt. Gen Benjamin Santos, BGen. Narciso Domingo, Col. Julian Olonan, Col. Arnulfo Ibañez, Lt. Col. Dhefry Punzalan, Lt. Col. Glenn Gonzalez, Maj. Michael Angelo Salmingo, Chief MSgt. Emmanuele Docena, SMSgt. Jerrywin Rebosora, SMSgt. Marian Mananghaya, MSgt. Carlos Bayeta, MSgt. Alejandro Flores, MSgt. Lorenzo Catarata, Lt. Jonathan Sosongco, Lt. Silverio Bulleser II, Lt. Randolph Piñon, Lt. Ashrap Amerol, Cpl. Joshua Ivan Baltazar, Cpl. Jhan Roland Gelacio, SSgt. Arnold Tibay, Pat. Hustin Peter Gular, Pat. Rommer Bugarin, Pat. Hassan Kalaw, Pat. Dennis Carolino, Pat. Nathaniel Gomez, Pat. Mario Atchuela, Pat. Windel De Ramos, Pat. James Osalvo, and Pat. Darius Camacho.</p>\n\n<p>Mayo was an intelligence officer for the PNP Drug Enforcement Group. He was dismissed from service on March 21, 2023, over three counts of grave misconduct and conduct unbecoming of a police officer.</p>\n\n<p>Remulla asserted that the alleged cover-up may have stemmed from the \"reward system\" instituted by the PNP in 2016.</p>\n\n<p>\"So, what happened was, they would make an arrest, give a reward, and then grant a promotion. That became their system,\" he said.</p>\n\n<p>Remulla said the investigation would be conducted by his department, the Department of Justice and their attached agencies.</p>\n\n<p>He said no one would be spared should their investigation show that more police personnel had conspired to cover up their or their colleagues' involvement in bogus anti-narcotics operations from the past administration to the present leadership.</p>",
        "published": "Tue, 14 Jan 2025 00:17:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/govt-to-probe-alleged-pnp-conspiracy/2038017"
    },
    {
        "title": "Chinese ships in PH waters spark protest",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/chinese-ships-in-ph-waters-spark-protest/2038002",
        "description": "<p>THE National Maritime Council (NMC) on Monday condemned the continued illegal presence of Chinese ships within the Philippines' exclusive economic zone (EEZ).</p>\n\n<p>In a statement, the NMC said the two vessels of the China Coast Guard (CCG) — identified as CCG 5901 and CCG 3304 — have been operating unlawfully in the waters around Bajo de Masinloc (Scarborough Shoal) 70 to 90 nautical miles off the coastline of Zambales on Jan. 5 and 10, respectively.</p>\n\n<p>It also called out Beijing's deployment of a People's Liberation Army-Navy (PLA-N) helicopter, \"which hovered above a PCG (Philippine Coast Guard) vessel that was lawfully conducting its mandate in a peaceful, non-provocative, and professional manner.\"</p>\n\n<p>\"These actions are clear violations of the Philippine Maritime Zones Act (Republic Act 12064) and international law, particularly the 1982 United Nations Convention on the Law of the Sea (Unclos) and the 2016 Arbitral Ruling that affirmed the Philippines' sovereign rights in its maritime zones, especially in the West Philippine Sea (WPS),\" the NMC said.</p>\n\n<p>These \"escalatory actions,\" it further stated, are inconsistent with the exercise of freedom of navigation and innocent passage as well as the exercise of rights and observance of duties by other States in the Philippines' EEZ under the Philippine Maritime Zones Act and the 1982 Unclos and the 2016 Arbitral Ruling.</p>\n\n<p>These incidents prompted the Philippine government to file another diplomatic protest against China, asserting that the Philippines has long-standing sovereignty over Bajo de Masinloc and its territorial sea as well as \"over waters within the Philippines' EEZ measured from its lawful archipelagic baselines.\"</p>\n\n<p>\"These maritime zones, as declared in the Philippine Maritime Zones Act, are in accordance with the 1982 Unclos and the 2016 Arbitral Ruling. China does not have any basis to conduct law enforcement activities or maritime patrols over these waters,\" the NMC said.</p>\n\n<p>\"The Philippines remains resolute in asserting and protecting its sovereignty, sovereign rights and jurisdiction in the WPS, and urges China to observe Philippine laws and comply with its obligations under international law, particularly Unclos. China should direct its vessels to desist from conducting illegal actions that violate the Philippines' sovereign rights in its EEZ,\" it added.</p>\n\n<p>This was not the first time the government denounced the encroachment of Chinese vessels in Bajo de Masinloc.</p>\n\n<p>A few days after ringing in the new year, the National Security Council (NSC) tagged as an act of \"intimidation, coercion, and aggression\" the CCG's \"Monster Ship\" patrol operations in the Philippines' EEZ.</p>\n\n<p>Sen. Risa Hontiveros, meanwhile, reiterated her appeal to Malacañang to file new cases against China before an international court amid reports that China's \"Monster\" navy ship is back in Zambales.</p>\n\n<p>The senator said China is not starting the year right. \"Instead of keeping the peace in the region, she has chosen to create more disturbance,\" she said.</p>\n\n<p>\"Beijing's ships will only keep coming back if we do not take appropriate measures,\" Hontiveros said in a statement on Monday.</p>\n\n<p>\"In the meantime, we must work on strengthening alliances with like-minded nations whose coast guards can patrol with ours,\" she said.</p>\n\n<p>Hontiveros added, \"Together, let us show China that no 'Monster' ship can scare us.\"</p>\n\n<p>Senate President Pro Tempore Jinggoy Estrada said the repeated incursions of China Coast Guard vessels into Philippine waters, particularly within the country's exclusive economic zone (EEZ), \"require a comprehensive and proactive response from our government.\"</p>\n\n<p>\"I think it's crucial to take action now. We need a proactive, united, and sustained approach to protect our rights and ensure the safety and security of our people,\" he said.</p>\n\n<p>\"The Philippines will not yield to coercion or intimidation when faced with challenges to our sovereignty,\" Estrada said in a statement.</p>\n\n<p>He said the 2016 Arbitral Award by the Permanent Court of Arbitration (PCA) in The Hague, Netherlands, \"affirmed our claim to sovereign rights in the maritime areas of the West Philippine Sea.\"</p>",
        "published": "Tue, 14 Jan 2025 00:16:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/chinese-ships-in-ph-waters-spark-protest/2038002"
    },
    {
        "title": "Lack of funds not a reason to disqualify a candidate – SC",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/lack-of-funds-not-a-reason-to-disqualify-a-candidate-sc/2037424",
        "description": "<p>(UPDATE) THE Supreme Court has reaffirmed the democratic rights of citizens to run for public office, irrespective of their financial means.</p>\n\n<p>In a landmark decision, the Supreme Court said a candidate's lack of financial resources to fund a nationwide campaign does not automatically make him or her a nuisance candidate.</p>\n\n<p>The en banc ruling, written by Senior Associate Justice Marvic M.V.F. Leonen, overturned previous resolutions by the Commission on Elections (Comelec) that invalidated the candidacy of Juan Olila Ollesca in the 2022 presidential elections.</p>\n\n<p>The case began in October 2021, when Ollesca, a business owner, filed his certificate of candidacy (COC) to run as an independent candidate for the presidency. Shortly thereafter, the Comelec Law Department petitioned to declare Ollesca a nuisance candidate, arguing that he was neither well-known nor possessed the resources to mount a nationwide campaign capable of achieving national recognition.</p>\n\n<p>The Comelec's Second Division granted the petition, declaring Ollesca a nuisance candidate. The Comelec en banc upheld this decision, denying Ollesca's motion for reconsideration.</p>\n\n<p>The high court emphasized that in a democracy, every citizen has the right to seek public office, a principle that must be balanced with the practical need to maintain free, fair, and orderly elections. The law, it stated, allows Comelec to regulate candidacies to avoid confusion, excessive resource allocation, and voter deception.</p>\n\n<p>The Court stressed that the criteria for declaring a nuisance candidate must adhere to legal standards. It is the responsibility of the Comelec to present substantial evidence that a candidate lacks genuine intent to run for office. Factors such as the absence of a political party nomination, limited public recognition, or insufficient campaign funds cannot, on their own, serve as definitive proof of a lack of intent.</p>\n\n<p>The Court further noted that disqualifying candidates based on their financial capacity would effectively impose a property requirement for public office — a practice explicitly prohibited by the Constitution.</p>\n\n<p>It stressed that the central consideration should be whether a candidate enjoys significant public support, not their likelihood of success or campaign resources.</p>\n\n<p>The Court's decision said the ability to fund a campaign does not equate to sincerity or competence in running for public office. Wealth, it argued, should not be a prerequisite for leadership.</p>",
        "published": "Tue, 14 Jan 2025 00:15:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/lack-of-funds-not-a-reason-to-disqualify-a-candidate-sc/2037424"
    },
    {
        "title": "Marcos, Biden, Ishiba vow to boost ties",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/marcos-biden-ishiba-vow-to-boost-ties/2037426",
        "description": "<p>(UPDATE) PRESIDENT Ferdinand Marcos Jr. on Monday held a virtual meeting with US President Joe Biden and Japan Prime Minister Ishiba Shigeru where they all vowed to deepen ties.</p>\n\n<p>During their Trilateral Leaders Phonecall, the three committed for the Philippines, the US and Japan to continue working together to enhance and deepen trilateral ties, particularly in the areas of economic, maritime, and technology cooperation.</p>\n\n<p>\"I am confident that our three countries will continue to work together closely to sustain the gains that we have made in enhancing and deepening our ties,\" Marcos said.</p>\n\n<p>This was echoed by Biden, who noted that the three nations \"have made historic progress\" since the Trilateral Summit in April 2024, \"especially in maritime security, economic security, and technology cooperation.\"</p>\n\n<p>It was during that time that Marcos, Biden, and then-Japanese leader Fumio Kishida discussed several issues, including enhancing extensive coordination to promote maritime domain awareness and deepen cooperation on humanitarian assistance and disaster relief.</p>\n\n<p>In a statement following the meeting, the White House reiterated Biden's stance regarding \"the People's Republic of China's dangerous and unlawful behavior in the South China Sea.\"</p>\n\n<p>The longstanding tension in the South China Sea was among the major issues discussed by the three parties in Washington, D.C., last year, with Biden reaffirming that any attack on Philippine vessels and other entities in the waterway would be a reason for the decades-old Mutual Defense Treaty (MDT) between the US and the Philippines to be activated.</p>\n\n<p>\"Simply put, our countries have an interest in continuing this partnership and institutionalizing our cooperation across our governments so that it is built to last. I'm optimistic that my successor will also see the value of continuing this partnership and that it is framed the right way,\" the American leader was quoted as saying during the 25-minute virtual gathering.</p>\n\n<p>Ishiba said it was important \"to deepen trilateral cooperation in a variety of fields.\"</p>\n\n<p>These interests include inclusive economic growth and resilience, crucial and emerging technologies, climate cooperation and clean energy, and promoting peace and security among the three nations.</p>",
        "published": "Tue, 14 Jan 2025 00:14:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/marcos-biden-ishiba-vow-to-boost-ties/2037426"
    },
    {
        "title": "Singson withdraws from senatorial race",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/singson-withdraws-from-senatorial-race/2037998",
        "description": "<p>FORMER Ilocos Sur governor Luis \"Chavit\" Singson, who has announced his withdrawal from the senatorial race in the May elections, will still be listed as a candidate, according to the Commission on Elections (Comelec).</p>\n\n<p>That's because his name has already been included in the ballots that have been printed, Comelec Chairman George Erwin Garcia explained on Monday.</p>\n\n<p>Singson told his followers Sunday he is dropping out following a bout with pneumonia.</p>\n\n<p>Garcia said Singson should personally file his withdrawal at the Comelec office in Intramuros, Manila.</p>\n\n<p>He said the votes cast for the former governor would be declared as stray.</p>\n\n<p>The Comelec started printing last week the 73 million ballots for the May 12 elections for the midterm elections and the first parliamentary polls in the Bangsamoro Autonomous Region in Muslim Mindanao (BARMM).</p>\n\n<p>The printing should be completed by April 14, Garcia said.</p>\n\n<p>Singson is among the 66 out of 183 senatorial aspirants who were declared by the Comelec as legitimate candidates.</p>\n\n<p>The 83-year-old filed his certificate of candidacy for senator as an independent on Oct. 7, 2024, after a two-year hiatus from politics.</p>\n\n<p>He last served as mayor of Narvacan town from 2019 to 2022.</p>\n\n<p>Singson was Ilocos Sur's governor from 1972 to 1986, 1992 to 2001, 2004 to 2007 and 2010 to 2013.</p>",
        "published": "Tue, 14 Jan 2025 00:13:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/singson-withdraws-from-senatorial-race/2037998"
    },
    {
        "title": "Go highlights nurses' role in health care system",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/go-highlights-nurses-role-in-health-care-system/2037941",
        "description": "<p>SEN. Bong Go said nurses play a vital role in the country's health care system as he vowed to support measures to improve their welfare and professional growth.</p>\n\n<p>During the recent Philippine Nurses Association (PNA) Caraga Region conference in Surigao City, Go described the nurses as \"the backbone of our health care system.\"</p>\n\n<p>The chairman of the Senate Committee on Health and Demography said the conference resonated with his vision for the nursing profession.</p>\n\n<p>\"This captures your collective aspiration to empower Filipino nurses to not only overcome challenges but to thrive and succeed in both local and international stages,\" Go said in his speech.</p>\n\n<p>He said nurses are the first to provide care, compassion and strength to patients during some of the most critical moments of their lives.</p>\n\n<p>Go also urged Filipino nurses to remain competitive in the global health care workforce.</p>\n\n<p>\"We must continuously invest in training, education and skills development to ensure that our nurses remain competitive and highly valued worldwide,\" he said.</p>\n\n<p>Go said among the measures he has backed in supporting healthcare professionals is Republic Act 11712, which mandates the provision of health emergency allowance to health care workers who served during the pandemic.</p>\n\n<p>\"We continue to push for the release of the budget for the payment of the Health Emergency Allowance. Rest assured, I will continue to fight for your rights and well-being,\" he said.</p>",
        "published": "Tue, 14 Jan 2025 00:12:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/go-highlights-nurses-role-in-health-care-system/2037941"
    },
    {
        "title": "Fuel prices increase for 2nd straight week",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/fuel-prices-increase-for-2nd-straight-week/2037939",
        "description": "<p>THE price of fuel has gone up for the second straight week.</p>\n\n<p>On Tuesday, Jan. 14, the prices of gasoline rose by 80 centavos per liter, diesel by 90 centavos, and kerosene by 80 centavos.</p>\n\n<p>This week's price uptick was attributed by the Department of Energy's Oil Industry Management Bureau to declines in OPEC and Russian oil production in December, strong employment data in the US, the anticipated rise in Asian demand due to the economic stimulus package of China, and cold weather blasts in the US and Europe.</p>\n\n<p>Last week, the cost of gasoline and kerosene went up by P1 per liter and diesel by P1.40 per liter.</p>\n\n<p>Since the start of the year, the per-liter price of gasoline has gone up by P1.80, diesel by P2.30 and kerosene by P1.80.</p>",
        "published": "Tue, 14 Jan 2025 00:11:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/fuel-prices-increase-for-2nd-straight-week/2037939"
    },
    {
        "title": "Electricity rates lower this month",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/electricity-rates-lower-this-month/2037937",
        "description": "<p>MANILA Electric Co. (Meralco) said on Monday it will be charging its customers P0.2189 less per kilowatt-hour (kWh) in January.</p>\n\n<p>The January billing for a typical household will be P11.7428, down from December's P11.9617, Meralco said.</p>\n\n<p>Residential customers consuming 200 kWh will be charged around P44 less.</p>\n\n<p>Meralco attributed the lower rate to the P0.1313 per kWh drop in the generation charge after the Wholesale Electricity Spot Market (WESM) charge went down by P0.8840 and the Independent Power Producers (IPPs) charge by P0.1593.</p>\n\n<p>Meralco said WESM reduced its charges after average peak demand and average capacity in the Luzon Grid both went down.</p>\n\n<p>IPP charges were also down because of the appreciation of the peso, affecting 97 percent of IPP costs that were dollar-denominated, together with the lower cost of fuel and higher dispatch of the First Gas-Sta. Rita plant.</p>\n\n<p>The reductions in turn tempered the P0.5638 per kWh increase in charges from Power Supply Agreements (PSAs) due to lower plant dispatch.</p>\n\n<p>WESM, IPPs, and PSAs accounted for 34 percent, 30 percent, and 36 percent, respectively, of Meralco's total energy requirement for the period.</p>\n\n<p>As for the other parts of the bill transmission and other charges also registered a net reduction of P0.0876 per kWh, while pass-through charges for generation and transmission are paid to the power suppliers and the grid operator, respectively, while taxes, universal charges, and Feed-in Tariff Allowance (FIT-All) are all remitted to the government.</p>\n\n<p>Meralco's distribution charge, on the other hand, has not moved since the P0.0360 per kWh reduction for a typical residential customer in August 2022.</p>\n\n<p>Meralco reminded customers to practice energy efficiency despite lower rates for January to better manage their electricity consumption as the dry season approaches.</p>",
        "published": "Tue, 14 Jan 2025 00:10:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/electricity-rates-lower-this-month/2037937"
    },
    {
        "title": "Bills to protect small fishers' welfare weighed",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/bills-to-protect-small-fishers-welfare-weighed/2037935",
        "description": "<p>KEY officials of the Bureau of Fisheries and Aquatic Resources (BFAR) met Monday with Bicol Saro Rep. Brian Raymund Yamsuan to discuss possible bills that would ensure that the welfare of small fisherfolk is protected.</p>\n\n<p>Yamsuan called for the meeting as the chairman of the House Committee on Aquaculture and Fisheries Resources, after fishers' groups, local government units (LGUs), and civil society groups asked the Supreme Court to reconsider a ruling which, according to a statement from his office, \"could clear the way for commercial fishing companies to have unobstructed access to municipal waters.\"</p>\n\n<p>The Fisheries Code imposes a 15-kilometer municipal water zone for the use of small fishers.</p>\n\n<p>\"Our primary concerns here are the livelihood and welfare of our 2.5 million small-scale fisherfolk, and our food security. We need to make sure that the impact of every decision made would not imperil efforts to boost our food security and endanger the sustainability of our marine resources,\" Yamsuan said.</p>\n\n<p>BFAR officials led by OIC-Director Isidro Velayo Jr. told Yamsuan the Supreme Court decision was not yet final, and that they have been coordinating with the Office of the Solicitor General (OSG) to seek its reversal.</p>",
        "published": "Tue, 14 Jan 2025 00:09:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/bills-to-protect-small-fishers-welfare-weighed/2037935"
    },
    {
        "title": "Marcos tells DA: Expedite support to farmers",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/marcos-tells-da-expedite-support-to-farmers/2037933",
        "description": "<p>PRESIDENT Ferdinand Marcos Jr. on Monday directed the Department of Agriculture (DA) to ensure the swift delivery of all forms of support to farmers to fill up any gaps during this planting season.</p>\n\n<p>\"There should be no significant delays to the implementation of agricultural support to farmers,\" Marcos said during his meeting with the DA and his administration's economic managers in Malacañang.</p>\n\n<p>He also reminded the Department of Budget and Management (DBM) \"to be mindful of the planting season\" and see to it that the agriculture sector is well-supported and prioritized for the farmers to have steady yields.</p>\n\n<p>\"Be mindful of the planting season. Make sure no one gets left behind during the planting season. That's why you need to come up with timely budgetary support,\" the chief executive said.</p>\n\n<p>During the meeting, DA Secretary Francisco Tiu Laurel Jr. emphasized that with sufficient assistance in fertilizers, quality seeds, and technologies, farmers can achieve higher yields and maximize productivity across various ecosystems.</p>\n\n<p>Likewise, Laurel said that adequate support prevents delays in seed and fertilizer distribution, allowing farmers to plant on time and optimize harvest potential.</p>\n\n<p>\"Increased rice production supports job creation across the value chain, farm laborers, transporters, millers, and traders, stimulating rural economies,\" the agriculture chief said.</p>",
        "published": "Tue, 14 Jan 2025 00:08:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/marcos-tells-da-expedite-support-to-farmers/2037933"
    },
    {
        "title": "NHA distributes P361M to disaster-hit Filipinos",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/nha-distributes-p361m-to-disaster-hit-filipinos/2037931",
        "description": "<p>A TOTAL of P361 million in cash has been distributed by the National Housing Authority (NHA) to Filipino families affected by calamities in 2024, its general manager (GM) said on Monday.</p>\n\n<p>NHA GM Joeben Tai, in a statement emailed to The Manila Times, said that the amount was released through the agency's Emergency Housing Assistance Program (EHAP).</p>\n\n<p>\"The NHA is one with President Ferdinand Marcos Jr.'s commitment to aiding the housing needs of Filipino families through our various programs and services,\" the Housing official said.</p>\n\n<p>Under EHAP, the NHA provides financial assistance to identified families affected by calamities such as typhoons, fires, earthquakes, and floods.</p>\n\n<p>The program aims to help the beneficiaries start anew by rebuilding their houses, it added.</p>\n\n<p>Meanwhile, the agency, through its regional office in Davao Region, distributed EHAP as a year-end gift to 35 fire-victim families from Tarragona and two families from the town of Lupon in Davao Oriental.</p>\n\n<p>Acting NHA District 2 head Gerold Namoc personally distributed the cash assistance of P10,000 per family.</p>\n\n<p>Tai also said that his agency has just turned over housing units to 23 Sibugaynon families in a ceremony held in Imelda, Zamboanga Sibugay, over the weekend.</p>\n\n<p>Built under the collaboration between the NHA and the local government of Imelda, the shelters were part of the 55-unit San Jose Village Resettlement Housing Project, he said.</p>\n\n<p>The NHA officials have assured the community that funding for the remaining units is a top priority as part of the agency's commitment to addressing the housing needs of underserved Filipino families.</p>",
        "published": "Tue, 14 Jan 2025 00:07:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/nha-distributes-p361m-to-disaster-hit-filipinos/2037931"
    },
    {
        "title": "'DOH, FDA knew Dengvaxia's adverse effects'",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/doh-fda-knew-dengvaxias-adverse-effects/2037929",
        "description": "<p>FORMER officials of the Department of Health (DOH) and Food and Drug Administration (FDA) were aware of the adverse effects of Dengvaxia vaccine because its manufacturer, Sanofi Pasteur Inc., disclosed these to them prior to the mass vaccination in 2016, documents show.</p>\n\n<p>An FDA document, a certified true copy of which was obtained by The Manila Times, indicates that as early as December 2015, the vaccine maker submitted its disclosure (Responses to Question) to DOH and FDA, citing the vaccine's potential risks in particular.</p>\n\n<p>During the initial hearings of the first batch of eight Dengvaxia cases that were later dismissed by Quezon City-Regional Trial Court Branch 228 Judge Cleto Villacorta III, one of the medical experts, Dr. Clarito Cairo, attested to Sanofi's disclosures.</p>\n\n<p>Unfortunately, the presiding judge at the time, Lily Ann Marcos-Padaen of Branch 13, disallowed Cairo, who used to be DOH's Disease Control and Prevention Bureau project manager, to fully present his affidavit in open court.</p>\n\n<p>In his affidavit, Cairo said that the concerned DOH officials during the time of ex-DOH secretary and now Iloilo Rep. Janette Garin withheld from them Dengvaxia's four fatal serious adverse effects — neurotropism, viscerotropism, severe dengue and anaphylaxis.</p>\n\n<p>To address the risk and ensure appropriate post-marketing surveillance in the Philippines, Sanofi said \"Pharmacovigilance Plan deployed in the Philippines will consist of passive or routine surveillance and active surveillance\" that involves post-authorization safety studies, post-authorization effectiveness studies and clinical studies.</p>\n\n<p>Sanofi, in an official statement issued in November 2017, said: \"the analysis confirmed that Dengvaxia provides persistent protective benefit against dengue fever in those who had prior infection. For those not previously infected by dengue virus, however, the analysis found that in the longer term, more cases of severe disease could occur following vaccination upon a subsequent dengue infection.\"</p>\n\n<p>The parents of the eight school children whose deaths were linked to the controversial anti-dengue shot had filed administrative complaints before the Supreme Court's Office of the Court Administrator for \"being biased and partial\" against Marcos-Padaen, who eventually inhibited herself from handling the case.</p>\n\n<p>Interviewed by this newspaper on Monday, Cairo confirmed what he said in his affidavits when he testified as one of the prosecution witnesses.</p>\n\n<p>\"When I handled the dengue program of the DOH and helped in the orientation and training of personnel from various local government units about Dengvaxia, they (Garin and other DOH officials) never disclosed to us these four potential risks,\" Cairo said.</p>\n\n<p>\"As a result, all of us including the trainers and vaccinators were unaware about these fatal risks from Dengvaxia,\" he added.</p>\n\n<p>Had the potential risks of the vaccine been disclosed to them prior to the personnel orientation and training for the planned mass vaccination that began in 2016 with the P3.5-billion Dengvaxia purchase, Cairo said \"more lives would have been spared and saved.\"</p>\n\n<p>Meanwhile, independent health reform advocate and prosecution witness Dr. Tony Leachon, a former DOH official and Covid-19 task force consultant, said that he would not stop from exposing the truth amid smear campaigns against him.</p>\n\n<p>\"This is the fight I have taken up not because it is easy but because it is necessary,\" Leachon told this writer.</p>\n\n<p>\"The question we need to ask right now is: Why are they so intent on silencing those who speak the truth, why are they so afraid of accountability,\" he added.</p>\n\n<p>Leachon maintained that he would not be moved and affected.</p>\n\n<p>\"You can attack me, deploy your trolls and flood social media with lies but you cannot drown out the truth. I will not stop fighting for the millions of Filipinos who deserve better,\" he said.</p>\n\n<p>More than 1 million Filipinos, mostly children, were reportedly the recipients of Dengvaxia vaccines.</p>\n\n<p>Garin and co-respondents — seven of them doctors — and executives from Sanofi and vaccine distributor Zuellig Pharma, are facing reckless imprudence resulting in homicide, among others.</p>",
        "published": "Tue, 14 Jan 2025 00:06:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/doh-fda-knew-dengvaxias-adverse-effects/2037929"
    },
    {
        "title": "Film director asks court to consolidate cases",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/film-director-asks-court-to-consolidate-cases/2037923",
        "description": "<p>FILM director Darryl Yap has asked the regional trial court (RTC) of Muntinlupa to consolidate the cases that were filed against him by actor, TV host and producer Vic Sotto, over his teaser for the movie \"The Rapists of Pepsi Paloma.\"</p>\n\n<p>The case is now being handled by the Muntinlupa RTC Branch 205.</p>\n\n<p>Sotto has filed 19 counts of cyber libel against Yap before the Office of the Prosecutor (OCP) in Muntinlupa.</p>\n\n<p>\"By filing a complaint-affidavit ... before OCP Muntinlupa pertaining to the same parties, screenshots, and subject matter in the instant case, this Honorable Court has no other recourse but to forward this case to the OCP Muntinlupa for purposes of consolidation with the criminal actions for cyber libel filed by petitioner,\" Yap said in his motion for immediate consolidation.</p>",
        "published": "Tue, 14 Jan 2025 00:05:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/film-director-asks-court-to-consolidate-cases/2037923"
    },
    {
        "title": "NBI findings on 'kill threat' reviewed",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/nbi-findings-on-kill-threat-reviewed/2037921",
        "description": "<p>THE Department of Justice (DOJ) is assessing the findings of the National Bureau of Investigation (NBI) on Vice President Sara Duterte's supposed \"kill threat\" against President Ferdinand Marcos Jr.</p>\n\n<p>In a Palace press briefing Monday, Prosecutor General Richard Fadullon said prosecutors were reviewing the NBI report and assessing whether the pieces of evidence gathered were enough to trigger a deeper investigation.</p>\n\n<p>\"Depending on the outcome, we will be able to make a recommendation whether to have it considered filed already before the department and/or to return it to the NBI if there's a need to build up the case further and add to the evidence that they have,\" Fadullon said.</p>\n\n<p>\"The NBI and DOJ are working closely together with our prosecutors to assess the evidence on hand,\" he added.</p>\n\n<p>Justice Undersecretary Raul Vasquez said that a preliminary investigation would follow if the evaluation confirmed sufficient grounds.</p>\n\n<p>In an expletive-laden online briefing in November last year, Duterte said she asked someone to kill President Marcos, first lady Liza Araneta-Marcos and House Speaker Martin Romualdez if something bad were to happen to her.</p>",
        "published": "Tue, 14 Jan 2025 00:04:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/nbi-findings-on-kill-threat-reviewed/2037921"
    },
    {
        "title": "Smart glasses enter new era with sleeker designs",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/smart-glasses-enter-new-era-with-sleeker-designs/2037920",
        "description": "<p>LAS VEGAS, Nevada — Producers of hi-tech connected eyewear are multiplying their innovations with increasingly discreet models in an attempt to make a difference in a highly competitive — and fast-emerging — market.</p>\n\n<p>Live translation, GPS, cameras and glasses are quickly adopting new functionalities.</p>\n\n<p>\"There are so many of these smart wearables, and more of them are going on your face,\" said Techsponential analyst Avi Greengart at the Consumer Electronics Show (CES) in Las Vegas, where numerous smart glasses manufacturers showcased their latest innovations.</p>\n\n<p>The industry has come a long way from its early days. Gone are the conspicuous protrusions of Google Glass and the bulky frames and cables of Epson's Moverio from the early 2010s.</p>\n\n<p>Today's smart glasses, all paired with smartphone apps, increasingly resemble traditional eyewear. The Ray-Ban Meta, developed by Mark Zuckerberg's social media giant, currently leads the market with this new approach.</p>\n\n<p>According to a recent MarketsandMarkets study, the sector's growth is \"driven by advancements in augmented reality, artificial intelligence, and miniaturization technologies, which are pushing the boundaries of what these wearable devices can achieve.\"</p>\n\n<p>However, integrating technology into fashionable frames requires careful compromise.</p>\n\n<p>The Ray-Ban Meta, for instance, can capture photos and videos, play music, and provide information about objects in view, but it doesn't offer augmented reality with superimposed images.</p>\n\n<p>Meta representative Robin Dyer explained that while AR capabilities may come later, they would likely double the current price.</p>\n\n<p>200 dollars</p>\n\n<p>Price is a major battleground in this market, particularly with the entry of Chinese manufacturers.</p>\n\n<p>While Google Glass initially retailed for around $1,500 in 2013, today's smart glasses are approaching the price of premium conventional frames.</p>\n\n<p>Meta's James Nickerson noted that their Ray-Ban collaboration starts at $300, just $50 more than standard Ray-Bans, offering \"a cool camera\" as a bonus.</p>\n\n<p>California startup Vue has pushed prices even lower, offering basic models with voice assistant and music capabilities for $200.</p>\n\n<p>Some manufacturers, like XReal, focus on augmented reality, projecting smartphone, computer, or gaming console displays — though this is a market for which Apple's Vision Pro failed to create excitement last year.</p>\n\n<p>For AR, recent advances help move away from the bulk of a virtual reality headset toward that of classic sunglasses, even if they require a cable to be connected to the device.</p>\n\n<p>Meta's ambition is to launch its own pared-down version, the Orion, currently in the test phase but not expected to be marketed until 2027 at the earliest.</p>\n\n<p>Chasing cool</p>\n\n<p>Companies like Even Realities and Halliday are pioneering ultra-thin frames that look identical to standard glasses while offering basic AR capabilities.</p>\n\n<p>\"If we want to make a good pair of smart glasses, we must first make a pair of cool glasses,\" emphasized Carter Hou, Halliday's second-in-command.</p>",
        "published": "Tue, 14 Jan 2025 00:03:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/smart-glasses-enter-new-era-with-sleeker-designs/2037920"
    },
    {
        "title": "Consulate operations unaffected by wildfires",
        "link": "https://www.manilatimes.net/2025/01/14/news/national/consulate-operations-unaffected-by-wildfires/2037890",
        "description": "<p>THE Philippine Consulate General (PCG) in Los Angeles said its consular operations remain unhampered despite the wildfires.</p>\n\n<p>The PCG issued the advisory Sunday (Monday in Manila) as it visited evacuation centers to check on the condition of Filipino Americans affected by the wildfires in Southern California and nearby areas.</p>\n\n<p>\"Clients with confirmed appointments can come to our office as scheduled,\" the PCG said in its advisory posted on Facebook.</p>\n\n<p>\"Meanwhile, those who are unable to come for their appointments on account of the wildfires can come at a later date when able,\" it added.</p>\n\n<p>President Ferdinand Marcos Jr. on Sunday extended his \"deepest sympathies to all who have been affected by the devastating wildfires in Southern California,\" including Filipino Americans.</p>\n\n<p>\"May the community's road to recovery begin with strength, compassion and solidarity. Please stay safe and vigilant,\" Marcos posted on social media.</p>\n\n<p>US Ambassador to Manila MaryKay Carlson thanked Marcos for his \"heartfelt message of sympathy and support.\"</p>\n\n<p>\"We pray for everyone affected, especially for the responders who are valiantly battling the blazes,\" Carlson wrote on X (formerly Twitter).</p>",
        "published": "Tue, 14 Jan 2025 00:02:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/14/news/national/consulate-operations-unaffected-by-wildfires/2037890"
    },
    {
        "title": "China's monster ship moves closer to PH shores – PCG",
        "link": "https://www.manilatimes.net/2025/01/13/news/chinas-monster-ship-moves-closer-to-ph-shores-pcg/2037888",
        "description": "<p>MANILA, Philippines — Chinese Coast Guard's largest vessel, CCG 5901, dubbed \"The Monster,\" has moved alarmingly close to Philippine shores, the Philippine Coast Guard (PCG) said.</p>\n\n<p>On Monday, the vessel was spotted 67 nautical miles off the coast of Zambales, well within the country's Exclusive Economic Zone (EEZ).</p>\n\n<p>The development came as the BRP Teresa Magbanua, a key PCG patrol vessel, returned to Bataan for minor repairs. To fill the gap, the PCG deployed its Islander aircraft to conduct aerial maritime patrols and monitor the movements of the Chinese vessel.</p>\n\n<p>During its mission on Monday afternoon, the PCG Islander issued a stern radio challenge to the Chinese vessel. The PCG said that CCG 5901's presence in Philippine waters constitutes a violation of international law and reiterated that Beijing has no legitimate authority to claim maritime jurisdiction in the area.</p>\n\n<p>\"This is Philippine territory,\" the PCG declared over radio communications. \"Your presence here is unauthorized and illegal under international law, particularly the United Nations Convention on the Law of the Sea (UNCLOS).\"</p>",
        "published": "Mon, 13 Jan 2025 21:43:14 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/chinas-monster-ship-moves-closer-to-ph-shores-pcg/2037888"
    },
    {
        "title": "House appropriations panel chief quits post",
        "link": "https://www.manilatimes.net/2025/01/13/news/house-appropriations-panel-chief-quits-post/2037885",
        "description": "<p>MANILA, Philippines — Ako Bicol Rep. Zaldy Co stepped down as chairman of the Committee on Appropriations of the House of Representatives.</p>\n\n<p>\"I extend my heartfelt gratitude to the majority in Congress for graciously accepting my decision to step down as chairman of the House Committee on Appropriations,\" Co said in a statement issued after the position was declared vacant.</p>\n\n<p>\"This decision, made with a heavy heart, is driven by pressing health concerns. The highly demanding nature of my role has taken its toll, and I now need to prioritize seeking the medical attention necessary for my well-being,\" he said.</p>\n\n<p>The appropriations committee drafts the national budget bill.</p>\n\n<p>Co said he was honored \"to have been entrusted with the immense responsibility of steering the nation's budget in service of the House of the people and the constituents we represent.\"</p>\n\n<p>\"In the past three years, I take pride in our collective accomplishments, particularly the Ayuda sa Kapos ang Kita Program, which provide critical support to those with income insufficient for their family needs. As the proud sponsor and shepherd of the budgets for 2023, 2024, and 2025, I ensured alignment with the President's eight-point economic agenda,\" he said. \"Notably, securing funding for legacy initiatives in health, housing, and food security—particularly legacy hospitals and contract farming—will remain highlights of my service.\"</p>\n\n<p>During Monday's plenary session, House Senior Deputy Majority Leader and Ilocos Norte 1st District Rep. Sandro Marcos made the motion to declare the post vacant.</p>\n\n<p>The motion was carried without objections.</p>\n\n\n(From left) Speaker Martin Romualdez, Representative Zaldy Co, Sen. Grace Poe and Senate President Francis Escudero lead the second bicameral conference committee meeting on the disagreeing votes on House Bill 10800, entitled 'An Act Appropriating Funds for the Operation of the Government of the Republic of the Philippines' at the Manila Hotel on Dec. 11, 2024. PHOTO BY RENE H. DILAN",
        "published": "Mon, 13 Jan 2025 21:39:17 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/house-appropriations-panel-chief-quits-post/2037885"
    },
    {
        "title": "Comelec backs INC peace rally; warns grandstanding poll bets",
        "link": "https://www.manilatimes.net/2025/01/13/news/comelec-backs-inc-peace-rally-warns-grandstanding-poll-bets/2037461",
        "description": "<p>MANILA, Philippines — Commission on Elections (Comelec) Chairman George Erwin Garcia on Monday expressed support to the Iglesia Ni Cristo's (INC) nationwide peace rally but he cautioned political candidates not to use the gathering for their personal interest.</p>\n\n<p>Garcia said the INC had all the good intentions in organizing the rally but this should not be taken advantage of by grandstanding politicians or \"epalitiko\" to jumpstart their campaign for the May 12, 2025 national and local elections.</p>\n\n<p>\"Isang pagsasama-sama para sa pananampalataya at pagkakaisa po ito. Kasapi po tayo sa kapatiran ng Iglesia sa kanilang napakabuting hangarin. Hindi dapat sinasamantala ng ilan para sa pansariling kapakanan. Iwasang maging epalitiko (This is a rally for faith and unity. We are one with the Iglesia Ni Cristo on this noble intention. This should not be used for personal interest),\" Garcia said in a viber message to reporters.</p>\n\n<p>In an earlier statement, the INC said they organized the rally for peace and unity in support of President Ferdinand Marcos Jr.'s call against the impeachment complaints filed against Vice President Sara Duterte at the House of Representatives.</p>\n\n<p>Despite their differences, the Chief Executive has expressed his strong opposition to the impeachment bid against Duterte.</p>\n\n<p>The INC said the country has many pressing problems and relevant issues that need to be prioritized and addressed.</p>\n\n<p> On Monday, Malacañang, through Executive Secretary Lucas Bersamin, said that the INC national rally for peace would bring clarity to the issues the country faces.</p>\n\n<p>\"We view today's assemblies as part of the national conversation we should be having as a people to bring clarity and consensus on issues that face us all and affect our future,\" Bersamin said.</p>",
        "published": "Mon, 13 Jan 2025 12:44:24 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/comelec-backs-inc-peace-rally-warns-grandstanding-poll-bets/2037461"
    },
    {
        "title": "Extensive emergency measures rolled out for INC peace rally",
        "link": "https://www.manilatimes.net/2025/01/13/news/extensive-emergency-measures-rolled-out-for-inc-peace-rally/2037457",
        "description": "<p>MANILA, Philippines — In light of the significant turnout for the Iglesia Ni Cristo (INC) National Peace Rally at the Quirino Grandstand on Monday, the Manila Disaster Risk Reduction and Management Office (DRRMO) said extensive emergency response measures have been implemented to ensure the safety and well-being of the attendees.</p>\n\n<p>As of 9 a.m. the INC rally has drawn an estimated 800,000 participants.</p>\n\n<p>The Manila DRRMO confirmed the implementation of extensive measures to manage the event effectively. Supporting these efforts are 17,000 INC Emergency First Responders deployed for medical aid and logistical support.</p>\n\n<p>To bolster the response, the Manila DRRMO mobilized 120 personnel, who will work alongside specialized teams such as the Philippine Army's 525th Engineer Combat Battalion. These urban search and rescue units have been stationed to address potential emergencies swiftly.</p>\n\n<p>The rally's security has been reinforced with 5,000 officers from the Philippine National Police and 1,200 personnel from the Metropolitan Manila Development Authority. Together, they are tasked with maintaining order and assisting with crowd management to ensure the peaceful conduct of the event.</p>\n\n<p>Despite the scale of the gathering, no injuries or missing persons have so far been reported. The Task Force Tigil Pasada has also been activated to address potential transportation concerns</p>",
        "published": "Mon, 13 Jan 2025 12:25:29 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/extensive-emergency-measures-rolled-out-for-inc-peace-rally/2037457"
    },
    {
        "title": "Palace hopeful INC rally 'will bring clarity on issues'",
        "link": "https://www.manilatimes.net/2025/01/13/news/palace-hopeful-inc-rally-will-bring-clarity-on-issues/2037425",
        "description": "<p>MANILA, Philippines — Malacañang on Monday expressed hope that the National Rally for Peace initiated by the Iglesia Ni Cristo (INC) would help clarify issues faced by the nation.</p>\n\n<p>Executive Secretary Lucas Bersamin made the remark as he reiterated that holding a peaceful assembly is a \"bedrock right\" of the people, recognized and guaranteed by the Constitution and respected by the government.</p>\n\n<p>\"Agencies concerned with the maintenance of peace and order, as well as with traffic and transportation management, including emergency health services, should be ready to provide assistance whenever such is needed by their fellow citizens,\" Bersamin said in a statement.</p>\n\n<p>He said that the Palace has no doubt that the massive gathering will be peaceful, calm, and significant.</p>\n\n<p>\"We view today's assemblies as part of the national conversation we should be having as a people to bring clarity and consensus on issues that face us all and affect our future,\" he added.</p>\n\n<p>The INC organized the rally to show support for Vice President Sara Duterte who has been slapped with three impeachment cases in connection with her alleged misuse of confidential funds.</p>\n\n<p>Malacañang earlier suspended work in government offices and classes at all levels in the cities of Manila and Pasay in anticipation of the gathering.</p>",
        "published": "Mon, 13 Jan 2025 10:03:38 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/palace-hopeful-inc-rally-will-bring-clarity-on-issues/2037425"
    },
    {
        "title": "Chavit Singson's name to remain on ballot despite withdrawal from Senate race",
        "link": "https://www.manilatimes.net/2025/01/13/news/chavit-singsons-name-to-remain-on-ballot-despite-withdrawal-from-senate-race/2037421",
        "description": "<p style=\"text-align: start;\">MANILA, Philippines— Former Ilocos Sur governor Luis \"Chavit\" Singson's name will remain on the official ballot even if he has announced his withdrawal from the Senate race, the Commission on Elections (Comelec) said Monday.</p>\n\n<p>\"Kung sakali po matuloy ang withdrawal, di na po namin matatanggal name niya sa balota (we can no longer remove his name from the ballot),\" Comelec Chairman George Erwin Garcia said on Monday in reaction to reports that Singson has decided to withdraw his Senate bid for health reasons.</p>\n\n<p>Garcia said all votes cast for Singson would be declared as stray.</p>\n\n<p>He urged Singson to personally file his withdrawal at the Comelec office in Intramuros, Manila.</p>\n\n<p>The Comelec started last Jan. 6 the printing of 73 million ballots for the May 12, 2025 midterm elections and the first parliamentary polls in the Bangsamoro Autonomous Region of Muslim Mindanao.</p>\n\n<p>Garcia said the printing of ballots would take 77 days or until April 14.</p>\n\n<p>Singson is among the 66 senatorial aspirants who were declared by the Comelec as legitimate candidates.</p>\n\n<p>The former Ilocos Sur governor announced his withdrawal Sunday following a bout with pneumonia.</p>",
        "published": "Mon, 13 Jan 2025 09:36:21 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/chavit-singsons-name-to-remain-on-ballot-despite-withdrawal-from-senate-race/2037421"
    },
    {
        "title": "Fuel prices up again this week",
        "link": "https://www.manilatimes.net/2025/01/13/news/fuel-prices-up-again-this-week/2037417",
        "description": "<p style=\"text-align: start;\">Oil companies will again raise the cost of fuel this week as global developments continue to influence price movements.</p>\n\n<p style=\"text-align: start;\">Shell, Cleanfuel and Seaoil on Monday said gasoline and kerosene prices will go up by P0.80 per liter, and diesel by P0.90 per liter.</p>\n\n<p style=\"text-align: start;\">Last week, oil firms increased the prices of gasoline and kerosene by P1 per liter and diesel by P1.40 per liter.</p>",
        "published": "Mon, 13 Jan 2025 09:25:57 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/fuel-prices-up-again-this-week/2037417"
    },
    {
        "title": "Pagasa warns shear line could trigger flash floods",
        "link": "https://www.manilatimes.net/2025/01/13/news/pagasa-warns-shear-line-could-trigger-flash-floods/2037413",
        "description": "<p style=\"text-align: start;\">MANILA, Philippines — The convergence of hot and cold air called shear line could bring moderate to heavy rains that may cause flash floods or landslides in some areas in Luzon and Visayas, the Philippine Atmospheric, Geophysical and Astronomical Services Administration (Pagasa) said Monday.</p>\n\n<p>Particularly affected by the shear line are areas in Eastern Visayas, Bicol Region, Mimaropa (Mindoro, Marinduque, Romblon and Palawan) and Quezon province, weather specialist Robert Badrina said.</p>\n\n<p>Meanwhile, the easterlies - winds coming from the east passing through the Pacific Ocean that carry warm and humid weather - will bring cloudy skies with scattered rains and isolated thunderstorms in Caraga and Davao Region.</p>\n\n<p style=\"text-align: start;\">Metro Manila, Cagayan Valley, Cordillera Administrative Region, Aurora, Bulacan, Cavite, Laguna, Batangas, and Rizal will have overcast skies with isolated light rains due to the northeast monsoon or amihan.</p>\n\n<p style=\"text-align: start;\">The rest of the country will likely have partly cloudy to cloudy skies with isolated rain showers or thunderstorms.</p>",
        "published": "Mon, 13 Jan 2025 09:00:22 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/pagasa-warns-shear-line-could-trigger-flash-floods/2037413"
    },
    {
        "title": "Election period begins",
        "link": "https://www.manilatimes.net/2025/01/13/news/election-period-begins/2037373",
        "description": "<p>THE 150-day election period for the May 12 vote officially began on Sunday, with the Commission on Elections (Comelec) assuming control over all election-related matters.</p>\n\n<p>A gun ban is also in effect during the election period, requiring written Comelec authorization for carrying or transporting firearms or other deadly weapons.</p>\n\n<p>The Philippine National Police (PNP) began setting checkpoints in coordination with the Comelec.</p>\n\n<p>Comelec Chairman George Erwin Garcia said all firearms licenses and permits to carry firearms are suspended during the election period.</p>\n\n<p>Government officials requesting a security detail from the PNP and other enforcement agencies will only be allowed a maximum of two bodyguards, whose firearms must also be covered by a Comelec permit, Garcia said.</p>\n\n\n\n\n\n<p>Comelec Commissioner Aimee Ferolino, head of the Comelec Steering Committee for this year's polls, said that as of Jan. 12, 1,131 permits or gun ban exemptions have been issued to individuals and entities.</p>\n\n<p>Election period prohibitions also include the relocation of a poll precinct or the establishment of a new one, the transfer of officers and employees in the civil service, except upon Comelec approval, and the suspension of elective provincial, city, municipal, or barangay officers without Comelec approval.</p>\n\n<p>Feb. 11 kicks off the campaign period for senators and March 28 for members of the House of Representatives and local officials. Both campaign periods will end on May 10.</p>\n\n<p>Campaigning is prohibited during Maundy Thursday and Good Friday, which fall on April 17 and 18.</p>\n\n<p>From April 30 to May 12, Filipinos overseas can vote through the first-ever internet voting or in the usual venues like Philippine embassies, consulates, and other posts in countries without internet voting.</p>\n\n\n\n\n\n<p>Local absentee voters may cast their ballots from April 30 to May 12.</p>\n\n<p>The liquor ban will be enforced from May 11 to May 12.</p>\n\n<p>Campaigning is banned on the eve of election day and election day itself.</p>\n\n\n\n<p>At stake in the May polls are 18,271 positions. To be contested are slots for 12 senators, 63 party-list representatives, 254 members of the House, 82 governors, 82 vice governors, 792 provincial board members, 149 city mayors, city vice mayors, 1,582 city councilors, 1,493 town mayors, 1,493 town vice mayors, 11,948 town councilors, 32 members of parliament of the Bangsamoro Autonomous Region in Muslim Mindanao (BARMM), and 40 BARMM party-list representatives.</p>\n\n\n\n<p>PNP Chief Gen. Rommel Francisco Marbil on Sunday reported that four people have been arrested in the BARMM, Central Mindanao, Western Visayas, and Central Luzon for violating the gun ban.</p>\n\n<p>Garcia highlighted the critical role of the gun ban in preserving the integrity of the elections.</p>\n\n<p>\"The gun ban is a vital component of our efforts to maintain peace and order during the election period. We urge everyone to comply and to report any violations,\" he said.</p>\n\n<p>Marbil also assured that the checkpoints will follow established protocols to ensure that the rights and privacy of individuals are respected.</p>\n\n<p>Only visual inspections of vehicles are allowed, and the police are not authorized to open a vehicle's trunk or glove compartment.</p>\n\n<p>Officers manning checkpoints cannot order passengers to get out of their vehicles or conduct a body search.</p>\n\n<p>WITH FRANCIS EARL CUETO AND FRANCISCO TUYAY</p>",
        "published": "Mon, 13 Jan 2025 00:13:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/election-period-begins/2037373"
    },
    {
        "title": "Inflation, health top concerns of Filipinos – survey",
        "link": "https://www.manilatimes.net/2025/01/13/news/national/inflation-health-top-concerns-of-filipinos-survey/2037372",
        "description": "<p>TEMPERING the effects of inflation, followed by staying healthy are the biggest concern of Filipinos, the survey of OCTA Research for the last quarter of 2024 showed.</p>\n\n<p>The poll results, released Sunday, found that 56 percent of the 1,200 respondents listed inflation as their most pressing concern. Although still relatively high, OCTA said the figure is a significant drop from the 66 percent in the July to September survey.</p>\n\n<p>The high cost of commodities, with food remaining the major pain point, particularly in the Visayas and Mindanao, emerged as the biggest challenge at 44 percent.</p>\n\n<p>\"Concern over access to affordable food increased by five percentage points, rising from 39 percent in August to 44 percent in the 4th quarter of 2024. Conversely, concern about improving or raising wages or salaries declined slightly, from 39 percent to 36 percent, while concern about creating more jobs declined by four percentage points, dropping from 33 percent to 29 percent,\" the research firm noted.</p>\n\n<p>The last-quarter survey conducted from Nov. 10-16, 2024, found staying healthy and avoiding illness to be among the biggest concerns among 70 percent of the respondents.</p>\n\n<p>Securing a well-paying job was next at 52 percent, and providing their children with quality education followed at 51 percent.</p>\n\n<p>Food security was a priority for half of the respondents.</p>\n\n<p>Meanwhile, the middle and upper-class groups (Class ABC) were more concerned about saving for the future.</p>\n\n<p>They likewise see fighting graft and corruption (30 percent) as an urgent national concern, along with defending the country's rights to the West Philippine Sea (32 percent).</p>\n\n<p>The survey has a ±3 percent margin of error.</p>",
        "published": "Mon, 13 Jan 2025 00:11:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/national/inflation-health-top-concerns-of-filipinos-survey/2037372"
    },
    {
        "title": "Trial for Dengvaxia cases ordered",
        "link": "https://www.manilatimes.net/2025/01/13/news/national/trial-for-dengvaxia-cases-ordered/2037367",
        "description": "<p>THE Supreme Court has ordered a Quezon City family court to begin the trial of the second batch of 35 Dengvaxia cases, which have been delayed by the inhibition of judges.</p>\n\n<p>In a letter to Regional Trial Court Executive Judge Rosanna Fe Romero-Maglaya, a copy of which was obtained by The Manila Times, Office of the Court Administrator (OCA) Assistant Court Administrator Lilian Barribal-Co directed the transfer of the records of the cases to Branch 102 under Judge Cecilyn Burgos-Villavert.</p>\n\n<p>The first batch of eight cases, which involved the same number of complainants of parents and relatives of children whose deaths were linked to the controversial anti-dengue vaccine, have been dismissed by another judge, Cleto Villacorta III, of Branch 228 late last year.</p>\n\n<p>Villacorta's ruling has been questioned by Solicitor General Menardo Guevarra before the Court of Appeals.</p>\n\n<p>On a motion by the panel of prosecution led by City Chief Prosecutor Vimar Barcellano and Deputy Chief Prosecutor Irene Resurreccion-Medrano, Villacorta inhibited himself from further handling the 35 cases.</p>\n\n<p>The case was raffled off to the sala of Branch 86 Judge Roslyn Rabara-Tria, who also recused herself because her husband was a counsel for two of the respondents.</p>\n\n<p>Another family court judge, Mary Ayn Punzalan-Toribio, of Branch 99, took over the case, but she, too, inhibited, citing Section 1, Rule 137 of the Rules of Court which provides that \"a judge may, in the exercise of his sound discretion, disqualify himself from sitting in a case.\"</p>\n\n<p>The case was re-raffled, this time to the sala of Burgos-Villavert, who moved to return the case records to Punzalan-Toribio, saying the latter's voluntary inhibition was premature.</p>\n\n<p>Burgos-Villavert said the parties were not given the opportunity to decide \"whether the ground for such is immaterial or unsubstantial.\"</p>\n\n<p>Citing an OCA circular, Barribal-Co said that judges designated to hear an inhibited case or to whom the case was re-raffled \"cannot raise the issue of the propriety of the exercise of the discretion of judges to disqualify themselves.\"</p>\n\n<p>Being the judge to whom the criminal cases were re-raffled, \"it is incumbent upon Judge Burgos-Villavert to immediately take cognizance of the cases and try the same,\" Barribal-Co said.</p>\n\n<p>Barribal-Co went on to say that the rules on voluntary inhibition did not give judges \"the unfettered discretion to desist from hearing a case.\"</p>\n\n<p>She reiterated that Burgos-Villavert \"should try and hear the Dengvaxia cases.\"</p>\n\n<p>Accused with former Department of Health secretary and now Iloilo Rep. Janette Garin were the top executives of vaccine manufacturer Sanofi Pasteur Inc. and vaccine distributor Zuellig Pharma and officials of the Research Institute for Tropical Medicine, Philippine Children's Medical Center, and Food and Drug Administration.</p>",
        "published": "Mon, 13 Jan 2025 00:10:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/national/trial-for-dengvaxia-cases-ordered/2037367"
    },
    {
        "title": "Marcos sympathizes with victims of US wildfires",
        "link": "https://www.manilatimes.net/2025/01/13/news/national/marcos-sympathizes-with-victims-of-us-wildfires/2037365",
        "description": "<p>PRESIDENT Ferdinand Marcos Jr. on Sunday expressed his sympathies to the victims of the raging wildfires in California.</p>\n\n<p>In a post on his official social media accounts, the President said California is a state where many Filipinos reside.</p>\n\n<p>\"On behalf of the Filipino people, I extend my deepest sympathies to all who have been affected by the devastating wildfires in Southern California, USA — a place that many of our kababayans call home,\" he said.</p>\n\n<p>\"May the community's road to recovery begin with strength, compassion and solidarity. Please stay safe and vigilant,\" he said.</p>\n\n<p>The swarm of wildfires in the greater Los Angeles area has left thousands homeless and at least 16 dead since Jan. 7.</p>\n\n<p>Two of the biggest wildfires ravaged the Los Angeles area last Thursday, burning down at least 10,000 homes, buildings, and other structures, local officials reported. Reports said at least 16 people died.</p>",
        "published": "Mon, 13 Jan 2025 00:09:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/national/marcos-sympathizes-with-victims-of-us-wildfires/2037365"
    },
    {
        "title": "LGU heads urged to help in POGO crackdown",
        "link": "https://www.manilatimes.net/2025/01/13/news/national/lgu-heads-urged-to-help-in-pogo-crackdown/2037362",
        "description": "<p>THE recent raid of a company in Parañaque City suspected to be a Philippine offshore gaming operator (POGO) prompted the Department of the Interior and Local Government (DILG) to call on local chief executives to help shut down remaining POGO sites that have gone underground.</p>\n\n<p>\"This is a message to all local chief executives (LCE): Do your job well and make sure to inspect all buildings. You will be held accountable if we catch you approving buildings without reporting to us,\" DILG Secretary Jonvic Remulla said over the weekend.</p>\n\n<p>In a memorandum issued on Jan. 2, the DILG directed all local government units (LGUs) to regularly inspect business establishments to ensure there are no clandestine POGOs.</p>\n\n<p>The memo urged LGUs to collaborate with the Philippine National Police to identify and shut down any POGO in their areas.</p>\n\n<p>The DILG requires LGUs to submit a \"no POGO certificate\" by the end of January. The certification will serve as proof that their areas are POGO-free.</p>\n\n<p>On Jan. 8, a raid conducted by the Bureau of Immigration in Barangay Tambo, Parañaque, led to the detention of 400 individuals allegedly involved in online fraud.</p>\n\n<p>Remulla stressed the need for accountability, stating that the DILG will require the Parañaque LGU to formally explain the presence of the clandestine establishment.</p>\n\n<p>In his 2024 State of the Nation Address, President Ferdinand Marcos Jr. declared an immediate ban on all POGO activities in the country.</p>\n\n<p>The administration's firm stance against POGOs is rooted in concerns over their alleged ties to criminal activities, including human trafficking and online fraud.</p>",
        "published": "Mon, 13 Jan 2025 00:08:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/national/lgu-heads-urged-to-help-in-pogo-crackdown/2037362"
    },
    {
        "title": "PH deploys coast guard ship to counter China patrols",
        "link": "https://www.manilatimes.net/2025/01/13/news/national/ph-deploys-coast-guard-ship-to-counter-china-patrols/2037354",
        "description": "<p>(UPDATE) THE Philippines said Sunday it had deployed a coast guard ship to challenge Chinese patrol boats attempting to \"alter the existing status quo\" of the disputed South China Sea.</p>\n\n<p>Beijing claims most of the strategic waterway despite a 2016 international tribunal ruling that went against it, and there have been frequent clashes or tense standoffs between Philippine and Chinese vessels.</p>\n\n<p>Brunei, Malaysia, Taiwan and Vietnam also have claims to the waters.</p>\n\n<p>Commo. Jay Tarriela, Philippine Coast Guard spokesman, said Chinese patrol ships had this year come as close as 60 nautical miles (111 kilometers) west of the main Philippine island of Luzon.</p>\n\n<p>\"Their goal is to normalize such deployments, and if these actions go unnoticed and unchallenged, it will enable them to alter the existing status quo,\" he said in a statement.</p>\n\n<p>He later told reporters Manila had deployed a coast guard ship to the area to challenge the \"unlawful\" Chinese patrols.</p>\n\n<p>He said the deployment aimed to ensure Chinese patrols \"are not normalized and that this bullying behavior does not succeed.\"</p>\n\n<p>Tarriela said the Chinese coast guard deployed three vessels from its Guangdong and Hainan bases to Philippine waters between December 30 and January 11.</p>\n\n<p>The South China Sea confrontations have sparked concern they could draw the United States, Manila's long-time security ally, into armed conflict with China.</p>",
        "published": "Mon, 13 Jan 2025 00:07:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/national/ph-deploys-coast-guard-ship-to-counter-china-patrols/2037354"
    },
    {
        "title": "Marcos' virtual meeting with Biden, Ishida reset",
        "link": "https://www.manilatimes.net/2025/01/13/news/national/marcos-virtual-meeting-with-biden-ishida-reset/2037359",
        "description": "<p>PRESIDENT Ferdinand Marcos Jr.'s virtual meeting with US President Joe Biden and Japan Prime Minister Shigeru Ishida has been reset for today, Jan. 13.</p>\n\n<p>In a text message to reporters, acting Presidential Communications Office (PCO) Secretary Cesar Chavez said the rescheduling of the Trilateral Leaders Phone Call, originally set for Sunday, was requested by Biden \"due to the ongoing wildfires in Los Angeles.\"</p>\n\n<p>Chavez did not disclose the exact time the meeting will take place or what matters will be taken up.</p>\n\n<p>The meeting comes after the US-Philippines-Japan summit in Washington in April last year, where Biden, Marcos and then-Japanese prime minister Fumio Kishida discussed several issues including enhancing coordination to promote maritime domain awareness and deepening cooperation on humanitarian assistance and disaster relief.</p>\n\n<p>Biden and Kishida assured their governments' support for the Philippines' quest to achieve upper middle-income country status.</p>",
        "published": "Mon, 13 Jan 2025 00:06:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/national/marcos-virtual-meeting-with-biden-ishida-reset/2037359"
    },
    {
        "title": "Labor group revives call for P150 daily wage hike",
        "link": "https://www.manilatimes.net/2025/01/13/news/national/labor-group-revives-call-for-p150-daily-wage-hike/2037303",
        "description": "<p>(UPDATE) The Trade Union Congress of the Philippines (TUCP), the biggest confederation of labor federations in the country, on Sunday revived its call for the immediate passage of the legislated P150 across-the-board daily wage hike.</p>\n\n\n\n\n\n<p>It added that the P150 legislated wage hike is needed on top of the pay increases in the private sector granted by the various regional wage boards in 15 out of 16 regions nationwide.</p>\n\n<p>\"[The price of] everything is going up — food prices, utility bills, SSS contributions and now even the train fare — everything except workers' wages,\" said TUCP Vice President Luis Corral.</p>\n\n\n\n<p>Earlier, LRT-1 operator Light Rail Manila Corp. (LRMC) petitioned for a fare hike of up to P15 for a one-way end-to-end journey. The daily minimum wage in the National Capital Region (NCR) increased only by P35 last year.</p>",
        "published": "Mon, 13 Jan 2025 00:05:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/national/labor-group-revives-call-for-p150-daily-wage-hike/2037303"
    },
    {
        "title": "Use PhilHealth funds for public health needs – Go",
        "link": "https://www.manilatimes.net/2025/01/13/news/national/use-philhealth-funds-for-public-health-needs-go/2037353",
        "description": "<p>SEN. Bong Go said the funds of the Philippine Health Insurance Corp. (PhilHealth) should serve the public's health needs rather than be unutilized, mishandled or diverted.</p>\n\n<p>The chairman of the Senate Committee on Health reiterated his appeal to PhilHealth to \"accelerate overdue reforms, maximize available funds and meet healthcare needs of the poor.\"</p>\n\n<p>Go emphasized the importance of ensuring that \"every peso contributed by citizens to PhilHealth is used effectively.\"</p>\n\n<p>In a radio interview on Jan. 9, Go addressed concerns about PhilHealth's alleged mismanagement and inefficiencies.</p>\n\n<p>He said health care funds \"should be used solely for improving health services.\"</p>\n\n<p>Go cited past instances of questionable plans, including the transfer of PhilHealth's excess funds to the National Treasury, which he slammed as \"counterproductive and morally wrong.\"</p>\n\n<p>\"Don't wait for you (PhilHealth) to generate excess funds. Use that for our poor fellowmen,\" he said in Filipino.</p>\n\n<p>The senator highlighted real-life cases where PhilHealth's policies \"fell short in serving Filipinos.\"</p>\n\n<p>Go recounted the plight of a provincial health officer from Camarines Norte who \"faced staggering hospital bills amounting to millions but received minimal coverage from PhilHealth.\"</p>\n\n<p>He also pressured the agency to scrap the 24-hour confinement policy, which required patients to be admitted for at least a day before they could qualify for insurance coverage. PhilHealth officials have since committed to its removal.</p>\n\n<p>Go expressed disappointment over the zero government subsidy allocated to PhilHealth for 2025, questioning how the agency could expand its services without adequate funding.</p>",
        "published": "Mon, 13 Jan 2025 00:04:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/national/use-philhealth-funds-for-public-health-needs-go/2037353"
    },
    {
        "title": "Police boost drive vs illegal SIM cards sale",
        "link": "https://www.manilatimes.net/2025/01/13/news/national/police-boost-drive-vs-illegal-sim-cards-sale/2037352",
        "description": "<p>THE Philippine National Police Anti-Cybercrime Group (PNP-ACG) has ramped up its efforts against the illegal online sale of registered Subscriber Identity Module (SIM) cards, conducting 55 operations in 2024 that resulted in the arrest of 65 people, six of them convicted, so far.</p>\n\n<p>Those arrested face charges under multiple laws, including Republic Act (RA) 12010, known as the Anti-Financial Account Scamming Act (Afasa); Section 7 of RA 11934, or the SIM Registration Act; and Section 6 of RA 10175, or the Cybercrime Prevention Act of 2012.</p>\n\n<p>During these operations, law enforcers seized more than 6,200 SIM cards, which included over 3,000 registered SIMs, and 29 connected to e-wallet accounts.</p>\n\n<p>Gen. Bernard Yang, officer-in-charge of the PNP-ACG, urged the public to assist in combating this illegal activity by reporting any information related to the unauthorized sale of registered SIM cards.</p>\n\n<p>\"Timely reporting enables swift and decisive action against these activities,\" he said.</p>\n\n<p>The most recent operation was carried out last Jan. 8 at 3:05 p.m. in Gapan City, Nueva Ecija. The Regional Anti-Cybercrime Unit 3 (RACU-3) of the PNP-ACG conducted an entrapment operation that led to the arrest of three individuals involved in the illegal online sale of registered SIM cards.</p>\n\n<p>The investigation began with cyber patrol efforts by RACU-3 personnel, who identified a Facebook user advertising registered SIM cards for sale. The seller offered the SIM cards at P19 each for bulk purchases. This intelligence culminated in a successful sting operation resulting in the confiscation of 7,000 registered SIM cards.</p>\n\n<p>Yang commended the efforts of RACU-3 personnel, emphasizing the importance of their work in protecting the public from cyber-related crimes.</p>\n\n<p>\"The sale of registered SIM cards facilitates illegal activities, such as identity theft, fraud, and other cybercrimes,\" he said.</p>\n\n<p>Yang urged the public to remain vigilant and report any instances of illegal SIM card sales to the PNP-ACG.</p>\n\n<p>\"Your cooperation is vital in ensuring a safer digital environment for everyone,\" he said.</p>",
        "published": "Mon, 13 Jan 2025 00:03:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/national/police-boost-drive-vs-illegal-sim-cards-sale/2037352"
    },
    {
        "title": "137k college students to receive P15k cash aid",
        "link": "https://www.manilatimes.net/2025/01/13/news/national/137k-college-students-to-receive-p15k-cash-aid/2037351",
        "description": "<p>SOME 137,000 college students will each receive P15,000 cash aid this year under the Tulong Dunong Program (TDP) of the government, Quezon City 4th District Rep. Marvin Rillo said on Sunday.</p>\n\n<p>Rillo is a member of the House Committee on Appropriations and vice chairman of the House Committee on Higher and Technical Education.</p>\n\n<p>\"In the 2025 General Appropriations Law, Congress has earmarked P2.06 billion for the TDP, which provides grantees with cash aid of P7,500 per semester, or P15,000 per academic year,\" he said in a statement.</p>\n\n<p>\"We are absolutely determined to keep up the annual funding for the TDP, which has helped to lessen the financial difficulties of students pursuing their college education,\" he said.</p>\n\n<p>The TDP is among the tertiary education subsidy programs of the government. It \"aims to support at least the partial cost of college schooling, inclusive of education-related expenses of the grantee.\"</p>\n\n<p>New and continuing grantees must, under the guidelines, be enrolled in any undergraduate program of a college or university, whether public or private, recognized by the Commission on Higher Education.</p>",
        "published": "Mon, 13 Jan 2025 00:02:00 +0800",
        "guid": "https://www.manilatimes.net/2025/01/13/news/national/137k-college-students-to-receive-p15k-cash-aid/2037351"
    },
    {
        "title": "Govt employees should uphold high moral standards – lawmaker",
        "link": "https://www.manilatimes.net/2025/01/12/news/govt-employees-should-uphold-high-moral-standards-lawmaker/2037302",
        "description": "<p>MANILA, Philippines — Manila 2nd District Representative Rolando Valeriano has called on government employees, especially those in uniformed services, to uphold high moral standards and respect family values.</p>\n\n<p>His statement comes in the wake of the case of resigned Senior Fire Officer 2 Reyca Janisa Palpallatoc, whose license as a registered nurse is under review following allegations of immorality.</p>\n\n<p>\"Love affairs may occur between individuals, but when such relationships result in the destruction of a family and cause emotional distress to a spouse and their loved ones, the aggrieved party has the right to seek proper recourse,\" Valeriano said over the weekend.</p>\n\n<p>The controversy surrounding Palpallatoc grew after a Pasay City court issued a warrant for her arrest on charges of illegal recruitment within the Bureau of Fire Protection (BFP). </p>\n\n<p>The immorality complaint against Palpallatoc was filed with the Professional Regulation Commission Board of Nursing in December by Faizah Utuali.</p>\n\n<p>Utuali claimed that Palpallatoc was having an affair with her husband, a discharged Marine officer.</p>\n\n<p>In her affidavit, Utuali highlighted the broader implications of Palpallatoc's actions emphasizing that such misconduct \"tarnishes the dignity of the nursing profession and erodes public confidence in government institutions.\"</p>\n\n<p>\"As professionals, we are obligated to respect others' rights, including the right to a peaceful family life. Engaging in extramarital affairs not only violates moral standards but also contravenes laws designed to protect families and the rights of legal spouses,\" said Valeriano who serves as the chairman of the House Committee on Metro Manila Development.</p>\n\n<p>The lawmaker said that uniformed personnel, such as those in the BFP, police, and military, must act as moral exemplars as their personal conduct reflects on the institutions they represent and inappropriate behavior undermines public trust.</p>",
        "published": "Sun, 12 Jan 2025 18:43:01 +0800",
        "guid": "https://www.manilatimes.net/2025/01/12/news/govt-employees-should-uphold-high-moral-standards-lawmaker/2037302"
    }
]