[
    {
        "title": "Pope Francis entered 2nd day of health improvements — Vatican",
        "link": "https://www.manilatimes.net/2025/02/28/world/americas-emea/pope-francis-entered-2nd-day-of-health-improvements-vatican/2064489",
        "description": "<p>Vatican City — Pope Francis's condition was continuing to improve, the Vatican said Thursday, as the 88-year-old pontiff marked two weeks in hospital with pneumonia in both lungs.</p>\n\n<p>\"The clinical conditions of the Holy Father are confirmed to be improving today also,\" said the Vatican in an evening bulletin on the pope's health.</p>\n\n<p>It was the second consecutive day the Vatican cited an improvement in the critical condition of the Argentine pope, who was admitted to Rome's Gemelli hospital on February 14.</p>\n\n<p>As pilgrims and other well-wishers continue to gather to pray and leave offerings outside the hospital, medical experts -- together with the Vatican -- have warned that Francis is not out of danger.</p>\n\n<p>\"Given the complexity of the clinical picture, further days of clinical stability are necessary to resolve the prognosis,\" the Vatican statement said.</p>\n\n<p>After first being admitted to hospital with breathing difficulties, the Vatican revealed that the pope -- who had part of a lung removed as a young man -- had double pneumonia.</p>\n\n<p>But on Wednesday, it said that Francis's clinical conditions had shown a \"slight improvement\" while cautioning that his prognosis remained \"reserved\".</p>\n\n<p>A respiratory attack Francis suffered at the weekend that required high levels of oxygen has not been repeated, although he continues to receive oxygen and do breathing exercises.</p>\n\n<p>On Thursday, he \"alternated high-flow oxygen therapy with a venturi mask,\" the Vatican said, referring to an oxygen mask that delivers oxygen at controlled concentrations.</p>\n\n<p>\"In the morning, the Holy Father dedicated his time to respiratory physiotherapy, alternating it with rest,\" said the Vatican.</p>\n\n<p>In the afternoon, following another session of therapy, he prayed in the chapel located on the 10th floor of the Gemelli in the special papal suite, said the Vatican. He then spent time working, it said.</p>\n\n<p>The pope's latest improvement comes after his deteriorating condition at the weekend sparked fears that the head of the world's nearly 1.4 billion Catholics might not pull through.</p>\n\n<p>Doctors have warned the path to recovery could be long, with the Jesuit pontiff likely staying in hospital beyond this week.</p>\n\n<p>Among those praying for the health of Francis Thursday were a group of Mexican pilgrims, who paid a visit to the hospital.</p>\n\n<p>\"Today we go back to Mexico and we wanted before we leave to come and see where he is. It doesn't matter if we only see the window, but we also wanted to say some prayers,\" a teary Lili Iparrea Fernandez, 74, told AFP.</p>\n\n<p>\"We would like to go in to kiss his feet,\" said another pilgrim, Flor Mercado Garcia, 66.</p>\n\n<p>Garcia brought an offering of yellow flowers for Francis, but ended up placing it at the feet of the statue of John Paul II in front of the hospital, amid the growing mass of candles, drawings, and messages of support.</p>\n\n<p>'Not there yet'</p>\n\n<p>Francesco Blasi, head of pneumology at Milan Polyclinic, and Stefania Vaglio, director of the Immune-hematology unit at the Sant'Andrea Polyclinic in Rome, said the pope's prognosis remains reserved because \"the respiratory problem has not been resolved.</p>\n\n<p>\"For an 88-year-old who was already suffering from a chronic respiratory disease before the pneumonia, (his condition) remains critical at least until the improvement is defined as stable,\" they said in a joint interview with the Corriere della Sera daily.</p>\n\n<p>\"We are not there yet. More days of waiting are needed\".</p>\n\n<p>In the meantime, the \"respiratory physiotherapy\" Francis is doing is key for patients with severe pneumonia, Blasi and Vaglio said.</p>\n\n<p>The exercises help them learn how to best use the muscles involved in breathing, they added.</p>\n\n<p>At 14 days so far, this current hospitalization is Francis's longest.</p>\n\n<p>Despite his critical condition, Francis has kept up with Church matters from his hospital suite.</p>\n\n<p>\"The pope wants to push through decisions he cares about, it is a manifestation of strength, of a willingness to govern,\" Adriano Prosperi, a historian specialized in the Church, told the Repubblica daily.</p>\n\n<p>Elected in 2013, Francis has aroused both fervor and fury within the Church with reforms aimed at opening the doors of a centuries-old institution to the modern-day faithful.</p>\n\n<p>\"Francis knows that what he leaves behind is in danger, and wants to protect it\", Prosperi said.</p>",
        "published": "Fri, 28 Feb 2025 07:19:33 +0800",
        "guid": "https://www.manilatimes.net/2025/02/28/world/americas-emea/pope-francis-entered-2nd-day-of-health-improvements-vatican/2064489"
    },
    {
        "title": "Taiwan spots 45 Chinese aircraft in 24 hours",
        "link": "https://www.manilatimes.net/2025/02/28/world/asia-oceania/taiwan-spots-45-chinese-aircraft-in-24-hours/2064035",
        "description": "<p>TAIPEI — Taiwan said Thursday it had detected 45 Chinese aircraft near the self-ruled island, the highest number this year and a tally that comes a day after Taipei denounced China's \"live-fire\" drills off the south.</p>\n\n<p>In the 24 hours to 6:00 a.m., 45 Chinese aircraft and 14 warships were spotted near the island, the de-fense ministry said in a statement.</p>\n\n\n\n\n\n<p>China claims Taiwan as part of its territory and has threatened to use force to bring the island under its control.</p>\n\n<p>Taiwan said Wednesday that China staged a combat drill with aircraft and warships and announced \"live-fire exercises\" in an area about 74 kilometers off the island's south, which Taipei condemned as dangerous and a violation of \"international norms.\"</p>\n\n<p>Beijing's foreign ministry declined to comment on Wednesday.</p>\n\n<p>China has ramped up the deployment of fighter jets and naval vessels around Taiwan in recent years to press its claim of sovereignty over the island, which Taipei rejects.</p>\n\n<p>On Tuesday, Taiwan seized a Chinese-crewed cargo ship suspected of severing a subsea telecoms ca-ble serving Taiwan's Penghu island group.</p>\n\n<p>There is growing concern in Taiwan over the security of its cables after a Chinese-owned cargo ship was suspected of cutting one northeast of the island this year.</p>\n\n<p>Taiwan fears China could sever its communication links as part of an attempt to seize the island or to blockade it.</p>\n\n<p>Taiwan is also a potential flashpoint for a war between China and the United States, which is the is-land's most important backer and biggest arms supplier.</p>\n\n<p>While the United States is legally bound to provide arms to Taiwan, Washington has long maintained \"strategic ambiguity\" when it comes to whether it would deploy its military to defend it from a Chinese attack.</p>\n\n<p>Despite strong bipartisan support in the US Congress for Taiwan, there are fears that President Donald Trump might not consider the island worth defending if China attacked.</p>\n\n<p>Taiwan leader Lai Ching-te has already vowed to boost investment in the United States to reduce the trade imbalance and spend more on the island's military, while his government is also considering in-creasing US natural gas imports.</p>",
        "published": "Fri, 28 Feb 2025 00:13:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/28/world/asia-oceania/taiwan-spots-45-chinese-aircraft-in-24-hours/2064035"
    },
    {
        "title": "NKorea deploys additional troops to Russia",
        "link": "https://www.manilatimes.net/2025/02/28/world/asia-oceania/nkorea-deploys-additional-troops-to-russia/2064033",
        "description": "<p>SEOUL — North Korea has sent more soldiers to Russia and redeployed several to the frontline in Kursk, Seoul's spy agency told AFP on Thursday.</p>\n\n<p>South Korean and Western intelligence agencies have said that more than 10,000 soldiers from the reclusive state were sent to Russia last year to help it fight a shock Ukrainian offensive into the Kursk border region.</p>\n\n\n\n\n\n<p>Earlier this month, Seoul said North Korean soldiers previously fighting alongside Russia's army on the Kursk frontline had not been engaged in combat since mid-January.</p>\n\n<p>Ukraine also said they had been withdrawn following heavy losses.</p>\n\n<p>On Thursday, an official from Seoul's National Intelligence Agency said they had been \"redeployed\" there.</p>\n\n<p>That came alongside \"some additional troop deployments appearing to have taken place,\" the official added.</p>\n\n<p>\"The exact scale is still being assessed,\" the official said.</p>\n\n<p>Neither Moscow nor Pyongyang have confirmed the deployment.</p>\n\n<p>The two countries signed an agreement, including a mutual defense clause, when Russian President Vladimir Putin made a rare visit to the nuclear-armed North last year.</p>\n\n<p>'Brutal' fighting </p>\n\n<p>Ukraine has previously said it captured or killed several North Korean soldiers in Kursk.</p>\n\n<p>President Volodymyr Zelenskyy has also released footage of interrogations with what he said were North Korean prisoners captured by the Ukrainian army there.</p>\n\n<p>This month, Seoul's Chosun Ilbo newspaper published an interview with a North Korean soldier describing \"brutal\" fighting on the frontline.</p>\n\n<p>The soldier, who was visibly wounded, told the paper that many of his fellow North Korean soldiers had been killed by drones and artillery fire.</p>\n\n<p>\"Everyone who joined the army with me is dead,\" he said.</p>\n\n<p>Pyongyang and Moscow have deepened political, military and cultural ties since Russia's invasion of Ukraine in February 2022.</p>\n\n<p>In a New Year's letter, North Korean leader Kim Jong Un hailed Putin and made a possible reference to the war in Ukraine.</p>\n\n<p>He said 2025 would be the year \"when the Russian army and people defeat neo-Nazism and achieve a great victory.\"</p>\n\n<p>On Wednesday, North Korean state media reported Kim had visited a major military academy, urging troops to harness the \"actual experiences of modern warfare.\"</p>",
        "published": "Fri, 28 Feb 2025 00:12:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/28/world/asia-oceania/nkorea-deploys-additional-troops-to-russia/2064033"
    },
    {
        "title": "Japan wildfire kills one, forces evacuations",
        "link": "https://www.manilatimes.net/2025/02/28/world/asia-oceania/japan-wildfire-kills-one-forces-evacuations/2064031",
        "description": "<p>TOKYO — At least one person has died in a wildfire that damaged more than 80 buildings and forced the evacuation of hundreds of residents in Japan, authorities said Thursday.</p>\n\n<p>Military helicopters have been mobilized to try and douse the flames raging in forested areas of Ofunato in the northern region of Iwate.</p>\n\n<p>Aerial footage from public broadcaster NHK showed the bright orange blaze reducing several houses to charred frames.</p>\n\n\n\n<p>\"One burned body was discovered and transferred to a nearby police station,\" a local police official told AFP.</p>\n\n<p>Nearly 600 nearby residents have been evacuated, according to the Ofunato municipality.</p>\n\n<p>As of Thursday morning, city officials estimated that at least 84 buildings had been damaged in the fire.</p>\n\n<p>Ofunato's mayor Kiyoshi Fuchigami described the fire as \"large-scale\" on Wednesday evening, saying around 600 hectares (1,500 acres) of land — three times the size of Monaco — had been burned.</p>\n\n<p>The cause of the blaze remained unknown, he added.</p>\n\n<p>There were about 1,300 wildfires across Japan in 2023, concentrated in the February to April period when the air dries out and winds pick up.</p>\n\n<p>Ofunato has seen only 2.5 millimeters of rainfall this month — on course to fall far below the previous record low for February of 4.4 millimeters in 1967.</p>\n\n<p>Last year was Japan's hottest since records began, mirroring other nations as ever-rising greenhouse gas emissions fuel climate change.</p>\n\n<p>In the case of the latest Iwate fire, \"strong wind\" from the west helped spread a series of smaller wild-fires in the same area, Fuchigami said.</p>\n\n<p>One evacuee, a 45-year-old woman, told NHK that the fire had been approaching her house when she returned from work.</p>\n\n<p>\"I was relieved that my kids were safe,\" she said.</p>\n\n<p>Another, a 32-year-old man, told the broadcaster it was \"my first time to see a series of fires happen in such rapid succession.\"</p>",
        "published": "Fri, 28 Feb 2025 00:11:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/28/world/asia-oceania/japan-wildfire-kills-one-forces-evacuations/2064031"
    },
    {
        "title": "New Zealand, China hold talks on live-fire drills",
        "link": "https://www.manilatimes.net/2025/02/28/world/asia-oceania/new-zealand-china-hold-talks-on-live-fire-drills/2064030",
        "description": "<p>BEIJING — New Zealand used high-level talks in Beijing to raise concerns about the surprise deploy-ment of Chinese warships off its western coast, Foreign Minister Winston Peters said Thursday.</p>\n\n<p>Dozens of commercial flights were forced to divert last week when the vessels an-nounced live firing drills underneath a busy flight path halfway between Australia and New Zealand.</p>\n\n<p>Both nations have criticized China for springing the drills with little warning — Australian officials said a last-minute alert was broadcast on a channel unchecked by air controllers.</p>\n\n<p>Peters said he raised \"the failure to give us adequate notice\" while meeting with China's top diplomat Wang Yi in Beijing on Wednesday.</p>\n\n<p>\"We did place on record our concern, and the expectation that we will have a better warning in the future,\" Peters told reporters after the meeting.</p>\n\n<p>\"I think it would be true to say that he took our concerns on board.\"</p>\n\n<p>New Zealand also raised the importance of \"international rules\" underpinning \"stability\" in the region, Peters added in a statement released Thursday.</p>\n\n<p>\"Our region and the world are facing a myriad of challenges, including increased ten-sions in the South China Sea and Taiwan Strait.\"</p>\n\n<p>Australia and close ally New Zealand have been monitoring the vessels — a frigate, a cruiser and a supply tanker — since they were detected in international waters off Aus-tralia last week.</p>\n\n<p>Officials said 49 commercial flights were forced to divert around the live firing zone on Feb. 21.</p>\n\n<p>Australia said the drills took place in international waters, and has conceded China's conduct abided by international law.</p>\n\n<p>China has defended its conduct as \"safe, standard and professional.\"</p>\n\n<p>The warships were 648 kilometers northeast of Australia's Bass Strait on Tuesday morn-ing, New Zealand's defense force said.</p>",
        "published": "Fri, 28 Feb 2025 00:10:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/28/world/asia-oceania/new-zealand-china-hold-talks-on-live-fire-drills/2064030"
    },
    {
        "title": "Scammed workers in Myanmar await return",
        "link": "https://www.manilatimes.net/2025/02/28/world/asia-oceania/scammed-workers-in-myanmar-await-return/2064029",
        "description": "<p>MAE SOT, Thailand — A new crackdown on online scam centers has led to over 7,000 people world-wide being held in a Myanmar border town awaiting repatriation, and those helping them said the un-precedented number is straining the resources of Thailand and leading to delays.</p>\n\n<p>The crackdown coordinated among Thailand, Myanmar and China follows Thai Prime Minister Paetong-tarn Shinawatra's visit to Beijing this month, where she told Chinese leader Xi Jinping that Thailand would act against the scam networks that have drawn in hundreds of thousands of people.</p>\n\n\n\n\n\n<p>They are often lured under false pretenses to work in scam centers in Myanmar, Cambodia and Laos, where they financially exploit people around the world through false romances, bogus investment pitches and illegal gambling schemes.</p>\n\n<p>Many find themselves trapped in virtual slavery.</p>\n\n<p>Officials from Thailand, Myanmar and China are expected to meet next week to address the logistics of the crackdown as fears grow about a possible humanitarian crisis.</p>\n\n<p>They aim to establish guidelines for repatriations to avoid confusion, Thai Defense Ministry spokesman Thanathip Sawangsang told The Associated Press.</p>\n\n<p>As part of Thailand's crackdown, it also has cut off electricity, internet and gas supplies to several areas in Myanmar hosting scam centers along the border, citing national security.</p>\n\n<p>Amy Miller, Southeast Asia director of aid group Acts of Mercy International and based in Thailand's Mae Sot on the Myanmar border, told AP she has never seen such a large-scale release of potential victims of human trafficking.</p>\n\n<p>\"The ability to get them over to Thailand and process them and house them and feed them would be impossible for most governments,\" she said.</p>\n\n<p>Thailand's deputy prime minister, Phumtham Wechayachai, on Tuesday acknowledged concerns and said relevant agencies were working on the situation as fast as they could to coordinate repatriations.</p>\n\n<p>\"I'm also worried that if we don't hurry up the process, it would become a problem if they can't handle it and let them loose,\" Phumtham told reporters in Bangkok, referring to Myanmar authorities.</p>\n\n<p>Logistical issues include verifying identities, which has complicated and slowed down countries repatri-ation efforts, according to a diplomatic source with direct knowledge of the situation who spoke on condition of anonymity because they were not authorized to speak to the media on the issue.</p>\n\n<p>Over half of the 7,000 waiting are Chinese, with the rest from a mix of countries.</p>\n\n<p>Earlier this month, about 260 people from 20 countries, ranging from Ethiopia to Brazil to the Philip-pines, crossed from Myanmar into Thai custody as part of the crackdown.</p>",
        "published": "Fri, 28 Feb 2025 00:09:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/28/world/asia-oceania/scammed-workers-in-myanmar-await-return/2064029"
    },
    {
        "title": "Hamas returns four more bodies of Israeli hostages",
        "link": "https://www.manilatimes.net/2025/02/28/world/americas-emea/hamas-returns-four-more-bodies-of-israeli-hostages/2064027",
        "description": "<p>GAZA CITY — The bodies of four Israeli hostages were handed over by Hamas early Thursday, authori-ties confirmed, followed by the return of another group of freed Palestinian prisoners to the occupied West Bank.</p>\n\n<p>The office of Prime Minister Benjamin Netanyahu confirmed they had received the coffins of \"four fallen hostages,\" and a process to formally identify them had started in Israel.</p>\n\n\n\n\n\n<p>In Ramallah, Agence France-Presse (AFP) journalists saw a first group of more than 600 prisoners due to be freed by Israel descend from a bus before a jubilant crowd.</p>\n\n<p>They were supposed to have been freed last weekend, but Israel stopped the process following out-rage over elaborate ceremonies.</p>\n\n<p>Hamas had been holding to hand over hostages, dead or alive, seized in its shock Oct. 7, 2023 attack.</p>\n\n<p>The row had threatened the first phase of a fragile Gaza ceasefire deal that went into effect on Jan. 19.</p>\n\n<p>Several of the freed Palestinians were hoisted in the air, some of them conducting in-terviews from the shoulders of friends or relatives.</p>\n\n<p>A group of women broke into tears as they gathered around one released prisoner, and a child held aloft made peace signs with both hands.</p>\n\n<p>Earlier, Hamas said the return of the four Israeli bodies would take place in private \"to prevent the oc-cupation from finding any pretext for delay or obstruction.\"</p>\n\n<p>Israeli media identified them as Ohad Yahalomi, Tsachi Idan, Itzik Elgarat and Shlomo Mansour.</p>\n\n<p>'Negotiations will begin'</p>\n\n<p>The ceasefire has largely halted the war sparked by Hamas' Oct. 7, 2023 attack on Israel, and seen 25 hostages released alive so far in exchange for more than 1,100 prisoners.</p>\n\n<p>There have been sporadic incidents of violence, however.</p>\n\n<p>The Israeli military said it carried out air strikes on several launch sites inside Gaza after a projectile was fired from there on Wednesday, though the munition fell short inside the Palestinian territory.</p>\n\n<p>In Washington, President Donald Trump's top envoy to the Middle East said Israeli representatives were en route to talks on the next phase of the ceasefire.</p>\n\n<p>The first phase of the deal is supposed to end on Saturday, but negotiations for the next stage — which were due to begin in early February — have not yet started.</p>\n\n<p>Minute's silence</p>\n\n<p>On Wednesday, thousands gathered in Israel for the funeral of Shiri Bibas and her sons, who were killed in captivity in Gaza and had become symbols of the country's hostage ordeal.</p>\n\n<p>The Israeli parliament held a minute of silence to mourn their deaths, as well as those of other victims of Hamas' Oct. 7 attack.</p>\n\n<p>\"Yesterday, the funeral of Oded Lifshitz took place; today, the funeral of Shiri, Kfir and Ariel Bibas is taking place. We remember all the victims of Oct. 7. We remember, and we will not forget,\" said speaker Amir Ohana.</p>",
        "published": "Fri, 28 Feb 2025 00:08:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/28/world/americas-emea/hamas-returns-four-more-bodies-of-israeli-hostages/2064027"
    },
    {
        "title": "US company eyes second lunar touchdown",
        "link": "https://www.manilatimes.net/2025/02/28/world/americas-emea/us-company-eyes-second-lunar-touchdown/2064012",
        "description": "<p>KENNEDY SPACE CENTER, Florida — A US company is aiming for its second lunar touchdown after a lander carrying a suite of unique experiments was successfully launched aboard a SpaceX rocket on Wednesday.</p>\n\n<p>Intuitive Machines made history last year as the first private entity to put a robot on the moon, though the triumph was marred by the lander tipping onto its side — something it hopes to avoid this time around.</p>\n\n\n\n\n\n<p>The Houston-based firm's hexagonal-shaped lander, Athena, blasted off in a SpaceX Falcon 9 rocket at 7:16 p.m. from the National Aeronautics and Space Administration's (NASA) Kennedy Space Center in Florida.</p>\n\n<p>If all goes well, it will touch down around March 6 at the vast Mons Mouton plateau, a site closer to the lunar South Pole than any previously targeted.</p>\n\n<p>Athena carries scientific instruments, including a drill to search for ice beneath the surface and a first-of-its-kind hopping drone named Grace after a famous computer scientist, Grace Hopper.</p>\n\n<p>It is designed to traverse the moon's rugged inclines, boulders and craters — a valuable capability to support future crewed missions.</p>\n\n<p>Also aboard is a small rover, which will test a lunar cellular network provided by Nokia Bell Labs by re-laying commands, images and video between the lander, rover and hopper.</p>\n\n<p>This network is planned to eventually be integrated into astronauts' suits.</p>\n\n<p>Intuitive Machines CEO Trent Martin spoke excitedly about the hopper, emphasizing that such drones could complement rovers in future missions by going \"down into extreme environments where you can't drive,\" including lunar pits and underground passages carved by ancient lava flows.</p>\n\n<p>Until recently, soft lunar landings were achieved only by a handful of well-funded national space agen-cies.</p>\n\n<p>Now, the US is working to make private missions routine through the Commercial Lunar Payload Ser-vices program, a public-private collaboration aimed at delivering NASA hardware to the surface at a fraction of the cost of traditional missions.</p>\n\n<p>\"I'm very excited to see the science that our tech demonstrations deliver as we prepare for humani-ty's return to the Moon and the journey to Mars,\" NASA's Nicky Fox told reporters, referencing the Artemis program, which aims to return astronauts to the lunar surface later this decade.</p>\n\n<p>Sticking the landing</p>\n\n<p>However, Intuitive Machines will want to achieve an upright landing — a feat the company fell short of with its previous lander, Odysseus, which went to space in February 2024.</p>\n\n<p>It came down too fast, caught a foot on the surface and tipped over, coming to rest at a 30-degree an-gle. This limited its ability to generate solar power and prevented it from completing NASA experi-ments under a $118-million contract.</p>\n\n<p>This time, the price tag is $62.5 million.</p>\n\n<p>Martin said the company had made key improvements — including better cabling for the laser altime-ter, an instrument that provides altitude and velocity readings and helps select a safe landing site.</p>\n\n<p>Athena's arrival at the moon is set to be preceded on March 2 by another private US lander, Firefly Aerospace's Blue Ghost, which launched on a more circuitous journey back in January, sharing a ride with Tokyo-based ispace's Resilience lander.</p>\n\n<p>Also hitching a ride on this rocket will be NASA's Lunar Trailblazer probe, which will enter orbit after a four-month journey and begin a two-year mission to study the distribution of different forms of water on the moon.</p>",
        "published": "Fri, 28 Feb 2025 00:07:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/28/world/americas-emea/us-company-eyes-second-lunar-touchdown/2064012"
    },
    {
        "title": "High court blocks order on US aid release",
        "link": "https://www.manilatimes.net/2025/02/28/world/americas-emea/high-court-blocks-order-on-us-aid-release/2064007",
        "description": "<p>WASHINGTON, D.C. — The US Supreme Court on Wednesday temporarily blocked a judge's order giving the Trump administration a midnight deadline to release billions of dollars in foreign aid.</p>\n\n<p>Chief Justice John Roberts said the order issued by US District Judge Amir Ali will remain on hold until the high court has a chance to weigh in more fully.</p>\n\n<p>Ali had ordered the federal government to comply with his decision temporarily blocking a freeze on foreign aid, ruling in a lawsuit filed by nonprofit groups and businesses.</p>\n\n<p>An appellate panel refused the administration's request to intervene.</p>\n\n<p>The federal government froze foreign assistance after an executive order from President Donald Trump targeting what he called wasteful programs that do not correspond to his foreign policy goals.</p>\n\n<p>The Trump administration said Wednesday it is eliminating more than 90 percent of the US Agency for International Development's (USAid) foreign aid contracts and $60 billion in overall assistance around the world.</p>\n\n<p>The cuts detailed by the administration would leave few surviving USAid projects for advocates to try to save in what are ongoing court battles with the administration.</p>\n\n<p>The Trump administration outlined its plans in both an internal memo obtained by The Associated Press and filings in one of those federal lawsuits Wednesday.</p>\n\n<p>The memo said officials were \"clearing significant waste stemming from decades of institutional drift.\"</p>\n\n<p>More changes are planned in how USAid and the State Department deliver foreign assis-tance, it said.</p>\n\n<p>In the federal court filings on Wednesday, nonprofits owed money on contracts with USAid describe both Trump political appointees and members of Musk's teams terminating USAid's contracts around the world at breakneck speed, without time for any meaningful review, they said.</p>\n\n<p>The nonprofits, among thousands of contractors, owed billions of dollars in payment since the freeze began, called the en masse contract terminations a maneuver to get around complying with the order to lift the funding freeze temporarily.</p>\n\n<p>The State Department said Secretary of State Marco Rubio had reviewed the terminations.</p>\n\n<p>In all, the Trump administration said it will eliminate 5,800 of 6,200 multiyear USAid contract awards, for a cut of $54 billion.</p>\n\n<p>Another 4,100 of 9,100 State Department grants were being eliminated, for a cut of $4.4 billion.</p>\n\n<p>The State Department memo, which was first reported by the Washington Free Beacon, described the administration as spurred by a federal court order that gave officials until the end of the day Wednes-day to lift the Trump administration's monthlong block on foreign aid funding.</p>\n\n<p>\"In response, State and USAid moved rapidly,\" targeting USAid and State Department foreign aid pro-grams in vast numbers for contract terminations, the memo said.</p>\n\n<p>The Trump administration asked the Supreme Court to intervene Wednesday night as an appeals court refused to lift the midnight deadline.</p>",
        "published": "Fri, 28 Feb 2025 00:06:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/28/world/americas-emea/high-court-blocks-order-on-us-aid-release/2064007"
    },
    {
        "title": "Starmer, Trump meet on US support for Ukraine",
        "link": "https://www.manilatimes.net/2025/02/28/world/americas-emea/starmer-trump-meet-on-us-support-for-ukraine/2063673",
        "description": "<p>(UPDATE) WASHINGTON, D.C. — British Prime Minister Keir Starmer will visit the White House on Thursday to convince President Donald Trump that a lasting peace in Ukraine will endure only if Kyiv and European leaders are at the table as negotiations move forward with Moscow.</p>\n\n<p>Starmer's trip, coming a few days after French Prime Minister Emmanuel Macron's own visit, reflects the mounting concern felt by much of Europe that Trump's aggressive push to find an end to Russia's war in Ukraine signals his willingness to concede too much to Russian President Vladimir Putin.</p>\n\n\n\n\n\n<p>\"We're going to do the best we can to make the best deal we can for both sides,\" Trump said Wednesday as he held the first Cabinet meeting of his second term. \"For Ukraine, we're going to try very hard to make a good deal so that they can get as much [land] back as possible.\"</p>\n\n<p>Trump's accord with Russia has unsettled America's historic allies in Europe, who have found them-selves on their heels with Trump returning to the White House with a determination to dramatically make over US foreign policy to correspond with his \"America First\" world view.</p>\n\n<p>The drifting White House view of Ukraine under Trump is leading to a tectonic shift in transatlantic rela-tions.</p>\n\n<p>But the administration is pushing back on the notion that Trump is ignoring Europe or that Trump is too eager in his push for settlement talks with Putin.</p>\n\n<p>\"He hasn't conceded anything to anyone,\" Vice President JD Vance said. \"He's doing the job of a dip-lomat.\"</p>\n\n<p>Trump's meeting with Starmer comes a day before he is to meet with Ukrainian President Volodymyr Zelenskyy.</p>\n\n<p>In that meeting Friday, the two are expected to sign off on a contentious agreement that would give the US access to Ukraine's critical minerals, which are used in the aerospace, defense and nuclear in-dustries.</p>\n\n<p>Zelenskyy had chafed at signing off on an agreement without specific security guarantees from the US.</p>\n\n<p>But Trump, in announcing plans for the leaders to sign the agreement, was noncommittal about any coming American security guarantees.</p>\n\n<p>\"I'm not going to make security guarantees... very much,\" Trump said. \"We're going to have Europe do that.\"</p>\n\n<p>The British prime minister confirmed Wednesday that he will host a meeting of international leaders in the United Kingdom on Sunday, focused on Ukraine.</p>\n\n<p>Zelenskyy is expected to attend.</p>\n\n<p>Starmer also announced plans this week for the UK to bolster defense spending — an issue that should sit well with Trump, who has been critical that European allies are spending too little on defense.</p>\n\n<p>He'll stress that Europe must \"play its part on global defense and step up for the good of collective Eu-ropean security.\"</p>",
        "published": "Fri, 28 Feb 2025 00:05:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/28/world/americas-emea/starmer-trump-meet-on-us-support-for-ukraine/2063673"
    },
    {
        "title": "Japanese teens arrested for using AI to create illegal phone contracts",
        "link": "https://www.manilatimes.net/2025/02/27/world/japanese-teens-arrested-for-using-ai-to-create-illegal-phone-contracts/2063924",
        "description": "<p>TOKYO, Japan — Japanese police have arrested three teenagers who allegedly used AI chatbot ChatGPT to create fraudulent mobile phone contracts and illegally access carrier networks, authorities and local media said on Thursday.</p>\n\n<p>The three males, aged 14, 15 and 16, allegedly developed a program using ChatGPT to create fake contracts and hack the Rakuten Mobile phone network, the Yomiuri Shimbun and other media reported.</p>\n\n<p>The two high school students and a middle-schooler also illegally bought people's credit card, ID and password information online that the AI program then used to create the fake contracts, the reports said.</p>\n\n<p>A police spokesman told AFP that two of the teens were arrested on Tuesday on suspicion of \"violating the unauthorized access prohibition act\" and computer fraud.</p>\n\n<p>The students allegedly sold at least 2,500 illegal contracts, amounting to around 7.5 million yen ($50,000) in cryptocurrency, Kyodo News reported, citing unidentified police sources.</p>\n\n<p>They also allegedly bought more than 3.3 billion IDs and passwords from someone they met on the encrypted messaging platform Telegram, the Yomiuri and other media said, citing anonymous investigative sources.</p>\n\n<p>E-commerce giant Rakuten, the parent company of Rakuten Mobile, issued a statement warning customers: \"Please be vigilant about contracts that you have no idea about.\"</p>\n\n<p>The company also \"confirmed the fraudulent mobile phone contracts using illicitly obtained IDs and passwords.\"</p>\n\n<p>\"We have been fully cooperating with police investigation on this issue, and have suspended use of illegal phone contracts and implemented password reset,\" the statement said.</p>\n\n<p>Rakuten, which owns the popular messaging service Viber, apologized for the issue, adding that no data leaks were detected from within the company.</p>",
        "published": "Thu, 27 Feb 2025 21:10:46 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/japanese-teens-arrested-for-using-ai-to-create-illegal-phone-contracts/2063924"
    },
    {
        "title": "Caution urged as ailing pope records slight improvement",
        "link": "https://www.manilatimes.net/2025/02/27/world/caution-urged-as-ailing-pope-records-slight-improvement/2063922",
        "description": "<p>VATICAN CITY — Pope Francis, battling pneumonia in both lungs, slept well and is resting, the Vatican said Thursday, after revealing the 88-year-old's condition was slightly improving.</p>\n\n<p>Nevertheless, both the Vatican and experts warned the pontiff was not out of danger.</p>\n\n<p>Francis, who had part of a lung removed as a young man, was admitted to Rome's Gemelli hospital on February 14, initially with breathing difficulties.</p>\n\n<p>But his condition deteriorated, sparking fears that the head of the world's nearly 1.4 billion Catholics might not pull through.</p>\n\n<p>\"The pope slept well last night and is now resting,\" the Vatican said in a morning bulletin, fueling hope the Argentine might be rounding a corner.</p>\n\n<p>A Vatican source said the pope also \"got up and had breakfast.\"</p>\n\n<p>\"The clinical conditions of the Holy Father in the last 24 hours have shown a further, slight improvement,\" the Vatican said late Wednesday.</p>\n\n<p>But it warned: \"Although a slight improvement is being recorded, the prognosis remains reserved.\"</p>\n\n<p>A respiratory attack Francis suffered at the weekend that required high levels of oxygen has not been repeated, although he continues to receive oxygen and do breathing exercises.</p>\n\n<p>On Wednesday, the Vatican said a CT scan performed Tuesday had showed \"normal progression of the pulmonary inflammatory condition\" while blood tests on Wednesday confirmed the improvement.</p>\n\n<p>It also said that a mild renal insufficiency detected at the weekend \"had resolved.\"</p>\n\n<p>As Catholics across the globe pray for Francis, doctors have warned the path to recovery could be long, with the Jesuit pontiff likely staying in hospital beyond this week.</p>\n\n<p>'Not there yet'</p>\n\n<p>Francesco Blasi, head of pneumology at Milan Polyclinic, and Stefania Vaglio, director of the Immune-hematology unit at the Sant'Andrea Polyclinic in Rome, said the pope's prognosis remains reserved because \"the respiratory problem has not been resolved.</p>\n\n<p>\"For an 88-year-old who was already suffering from a chronic respiratory disease before the pneumonia, (his condition) remains critical at least until the improvement is defined as stable,\" they said in a joint interview with the Corriere della Sera daily.</p>\n\n<p>\"We are not there yet. More days of waiting are needed.\"</p>\n\n<p>In the meantime, the \"respiratory physiotherapy\" Francis is doing, according to the Vatican, is key for patients with severe pneumonia, Blasi and Vaglio said.</p>\n\n<p>The exercises help them learn how to best use the muscles involved in breathing, they added. \"Basically, it is a readjustment to exertion\".</p>\n\n<p>At 14 days so far, this current hospitalization is Francis's longest.</p>\n\n<p>Pilgrims and faithful have been flocking to the Vatican and the Gemelli to pray for him, with another prayer service to be held in St Peter's Square later Thursday evening.</p>\n\n<p>Despite his critical condition, Francis has kept up with Church matters from his hospital suite.</p>\n\n<p>\"The pope wants to push through decisions he cares about, it is a manifestation of strength, of a willingness to govern,\" Adriano Prosperi, a historian specialized in the Church, told the Repubblica daily.</p>\n\n<p>The Argentine, elected in 2013, has aroused both fervor and fury within the Church with reforms aimed at opening the doors of a centuries-old institution to the modern-day faithful.</p>\n\n<p>\"Francis knows that what he leaves behind is in danger, and wants to protect it\", Prosperi said.</p>",
        "published": "Thu, 27 Feb 2025 21:08:17 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/caution-urged-as-ailing-pope-records-slight-improvement/2063922"
    },
    {
        "title": "UN nature talks in 'end game' to break funding deadlock",
        "link": "https://www.manilatimes.net/2025/02/27/world/un-nature-talks-in-end-game-to-break-funding-deadlock/2063918",
        "description": "<p>ROME — Brazil spearheaded a last-ditch effort to break the deadlock at UN nature talks in Rome on Thursday, as nations struggled against the clock to agree a deal over money to halt rapid global species loss.</p>\n\n<p>Rich and developing countries broadly agree over the scale of the crisis that threatens the ecosystems and wildlife that humans rely on for food, climate regulation and economic prosperity.</p>\n\n<p>But they are locked in a dispute over how to deliver funding, which caused a previous meeting in Cali, Colombia last year to end in disarray.</p>\n\n<p>The rebooted COP16 talks in Rome are tasked with bridging those differences, against a backdrop of geopolitical tensions and global economic concerns.</p>\n\n<p>In a bid to unlock agreement on what should be the final day of talks, Brazil put forward a new \"compromise attempt\" text on behalf of the BRICS country bloc that includes Russia, China and India.</p>\n\n<p>This sought to whittle down the document under negotiation and clarify two main goals to be agreed — closing the multi-billion dollar biodiversity financing gap and deciding on the institutions that will deliver that money.</p>\n\n<p>Brazil negotiator Patrick Luna said the proposal was to ensure that while countries were embarking on a marathon global effort, \"we are not running on a treadmill, we are advancing towards these goals.\"</p>\n\n<p>'End game'</p>\n\n<p>COP16 president Susana Muhamad told negotiators in a plenary Thursday morning that the talks were in their \"end game.\"</p>\n\n<p>She warned that progress on ambitious targets to protect nature by 2030 was on the line, urging nations to show \"that collectively we can mobilize this change to safeguard biodiversity, which is life.\"</p>\n\n<p>Scientists have warned that a million species are threatened with extinction, while unsustainable farming and consumption destroys forests, depletes soils and spreads plastic pollution to even the most remote areas of the planet.</p>\n\n<p>Young protesters greeted negotiators as they arrived at the building of the UN Food and Agriculture Organization on Thursday, playing a soundtrack of rainforest noises and handing out flyers urging: \"Don't let silence be our legacy.\"</p>\n\n<p>In a landmark 2022 agreement, countries agreed to halt the destruction of nature by the end of this decade.</p>\n\n\nDelegates attend the COP16 biodiversity conference at the UN's Food and Agriculture Organization (FAO) headquarters in Rome, on February 25, 2025. AFP PHOTO\n\n\n<p>They laid out a program of 23 objectives to be achieved by 2030, including protecting 30 percent of the world's land and seas. Just 17 percent and eight percent respectively are protected currently, the UN says.</p>\n\n<p>Countries have already agreed to deliver $200 billion a year in finance for nature by 2030, including $30 billion a year from wealthier countries to poorer ones.</p>\n\n<p>The total for 2022 was about $15 billion, according to the OECD.</p>\n\n<p>The main debate is over developing countries' demand for the creation of a specific biodiversity fund.</p>\n\n<p>Wealthy nations — including the European Union and Canada — are opposed, arguing that setting up multiple funds fragments development aid, which is already under pressure from budget cuts and the slashing of overseas aid by new US President Donald Trump.</p>\n\n<p>'Cautiously positive'</p>\n\n<p>There were signs that countries were inching closer together, with the European Union's representative saying they were \"cautiously positive\" about the BRICS proposal, although tough negotiations are expected to stretch well into the evening.</p>\n\n<p>Brazil, which is hosting UN climate talks later this year in the Amazon rainforest, has taken a pivotal role in the biodiversity talks and has one of the largest delegations to the Rome meeting.</p>\n\n<p>It has warned that the painful progress on finance could reverberate across other treaty negotiations this year.</p>\n\n<p>The United States, which is withdrawing from climate and health action globally, would normally have sent a team despite not being a signatory of the UN biodiversity convention.</p>\n\n<p>But no officials turned up for the meeting, according to a list of participants from the UN.</p>\n\n<p>The failure to finalize agreement in Cali was the first in a string of disappointing outcomes for the planet at UN summits last year and comes as trade disputes and conflicts rattle global cooperation.</p>\n\n<p>A climate finance deal at COP29 in Azerbaijan in November was slammed as disappointing, while separate negotiations about desertification and plastic pollution stalled in December.</p>",
        "published": "Thu, 27 Feb 2025 21:00:23 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/un-nature-talks-in-end-game-to-break-funding-deadlock/2063918"
    },
    {
        "title": "'Escaping hell': Myanmar scam center workers plead to go home",
        "link": "https://www.manilatimes.net/2025/02/27/world/escaping-hell-myanmar-scam-center-workers-plead-to-go-home/2063913",
        "description": "<p>MYAWADDY, Myanmar — Hundreds of exhausted young men lie in an open-sided detention center in a seedy Myanmar border town, sweating through thick tropical heat by day and prey to clouds of mosquitoes by night.</p>\n\n<p>They are among some 7,000 people from more than two dozen countries released from scam compounds who are now enduring a grueling wait to be sent home through Thailand.</p>\n\n<p>Conditions in the overcrowded temporary camp visited by Agence France-Presse in the town of Myawaddy, near the Thai border, were squalid and those held there were begging to leave.</p>\n\n<p>\"It's really no good,\" one 18-year-old Malaysian man told AFP, saying the toilets and showers were so dirty they were unusable.</p>\n\n<p>\"I hope I can contact my parents quickly so I can go.\"</p>\n\n<p>A Chinese detainee who gave his family name as Wang said he was \"very happy\" at the prospect of getting out.</p>\n\n<p>\"I can finally escape this hell... China is the safest,\" he said.</p>\n\n<p>'Help me, help me, help me'</p>\n\n<p>Scam centers have sprung up in Myanmar's lawless border areas in recent years as part of a criminal industry worth billions of dollars a year.</p>\n\n<p>Thousands of foreign workers staff the centers, trawling social media for victims to fleece, often through romance or investment cons.</p>\n\n<p>Many workers say they were trafficked or tricked into taking the work and suffer beatings and abuse, though the government in China — where most come from — regards them as criminal suspects.</p>\n\n<p>Under heavy pressure from Beijing, Myanmar's junta and allied militias have taken action to curb the centers.</p>\n\n<p>The \"crackdown\" has so far involved armed uniformed men coming to the sites and asking for volunteers to leave and go home, several freed workers told AFP in Myawaddy.</p>\n\n<p>But processing the workers for repatriation has been slow, leaving them trapped in limbo, smoking and playing cards to pass the time in the detention facility, which has a roof but no walls to keep the elements and insects out.</p>\n\n\nIn this photo taken on February 23, 2025 alleged scam centre workers and victims rest during a crackdown operation by the Karen Border Guard Force (BGF) on illicit activity, at the border checkpoint with Thailand in Myanmar's eastern Myawaddy township. AFP PHOTO\n\n\n<p>Many had their passports confiscated by scam center bosses, and those AFP spoke to said their mobile phones were taken away.</p>\n\n<p>An Indian man who said he was tricked into working in the scam centers after applying for a data entry job in Thailand, told AFP he had contacted his embassy in Bangkok several times.</p>\n\n<p>He begged them \"help me, help me, help me. But no one helps me,\" he said.</p>\n\n<p>\"The feeling is not good because we are in trouble right now.\"</p>\n\n<p>Myanmar's raging civil war has complicated efforts to tackle the scam compounds, as most are in areas outside the ruling junta's control.</p>\n\n<p>The Karen Border Guard Force (BGF), an independent militia allied to the junta, controls two of the most notorious scam towns, Myawaddy and Shwe Kokko.</p>\n\n<p>The BGF released thousands from illegal scam compounds last week and wants to swiftly deport them to neighboring Thailand for repatriation, saying it is struggling to cope with looking after so many people.</p>\n\n<p>\"People have to stay in cramped conditions,\" said its spokesman Naing Maung Zaw.</p>\n\n<p>\"We have to cook three meals to feed thousands of people and arrange their healthcare,\" he said, adding he was worried about a possible outbreak of contagious diseases.</p>\n\n<p>Struggling to cope</p>\n\n<p>The United Nations estimates that as many as 120,000 people — many of them Chinese men — may be working in Myanmar scam centers against their will.</p>\n\n<p>Gangs that run the compounds lure people with promises of high-paying jobs, then force them to defraud people from around the world or face severe punishment and abuse.</p>\n\n<p>The sites on the Thai-Myanmar border vary in how they treat their staff, analysts say, and Thai officials have claimed that a majority of workers go there intentionally.</p>\n\n<p>Victims released from smaller compounds claim that as a more sophisticated operation, Shwe Kokko — one of the area's biggest scam hubs — draws more people who willingly go there to commit fraud.</p>\n\n<p>But \"not everyone living in Shwe Kokko is a criminal,\" Naing Maung Zaw said.</p>\n\n<p>A Chinese man surnamed Shen denied allegations that the scam center workers had travelled to Myanmar intentionally, saying he had been tricked and forced.</p>\n\n<p>\"If I did it voluntarily, I would take all legal responsibilities,\" he said.</p>\n\n<p>But so far China has treated all returning detainees — 600 were sent back last week — as suspects, with state TV showing them marched off the plane in handcuffs by police on their return home.</p>\n\n<p>Thailand, Myanmar and China are expected to hold three-way talks in the coming weeks to arrange logistics for further repatriations, with Thailand saying it is working with over a dozen foreign embassies.</p>\n\n<p>One of 14 detained Pakistani men who hoped to return before Ramadan said he felt abandoned by authorities after hearing of other repatriations.</p>\n\n<p>\"We know we're safe now. But it's been eight days. So why can't we go to Thailand now?\" he told AFP.</p>\n\n<p>Stretched for resources to look after the hundreds of foreigners in their charge, Naing Maung Zaw pleaded to foreign embassies to \"come and take your nationals... They want to go home.\"</p>",
        "published": "Thu, 27 Feb 2025 20:57:30 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/escaping-hell-myanmar-scam-center-workers-plead-to-go-home/2063913"
    },
    {
        "title": "US mother who dropped baby from Paris window placed in care",
        "link": "https://www.manilatimes.net/2025/02/27/world/us-mother-who-dropped-baby-from-paris-window-placed-in-care/2063893",
        "description": "<p>PARIS, France — An 18-year-old student from the United States who dropped her newborn baby to its death from a Paris hotel window has been placed in psychiatric care, French prosecutors said Wednesday.</p>\n\n<p>The newborn was \"thrown from the second-floor window of a hotel in the 20th arrondissement\" in eastern Paris on Monday, a prosecution source said.</p>\n\n<p>The baby was given emergency treatment but did not survive.</p>\n\n<p>Police were alerted after an infant wrapped in a cloth, with its umbilical cord still attached, was discovered in front of the hotel, a police source said.</p>\n\n<p>The mother had given birth in a room at the hotel and then thrown her child out the window, according to the source.</p>\n\n<p>French officials said they had launched a murder investigation. But the woman could be declared unfit to stand trial now that she has been placed in psychiatric care.</p>\n\n<p>Officials said the woman was \"part of a group of young adults travelling in Europe.\"</p>",
        "published": "Thu, 27 Feb 2025 20:44:50 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/us-mother-who-dropped-baby-from-paris-window-placed-in-care/2063893"
    },
    {
        "title": "Japan forest fire kills one, prompts evacuations",
        "link": "https://www.manilatimes.net/2025/02/27/world/japan-forest-fire-kills-one-prompts-evacuations/2063685",
        "description": "<p>TOKYO — At least one person has died in a wildfire that damaged more than 80 buildings and forced the evacuation of hundreds of residents in Japan, authorities said Thursday.</p>\n\n<p>Military helicopters have been mobilized to try and douse the flames raging in forested areas of Ofunato in the northern region of Iwate.</p>\n\n<p>Aerial footage from public broadcaster NHK showed the bright orange blaze reducing several houses to charred frames.</p>\n\n<p>\"One burned body was discovered and transferred to a nearby police station,\" a local police official told Agence France-Presse.</p>\n\n<p>Nearly 600 nearby residents have been evacuated, according to the Ofunato municipality.</p>\n\n<p>As of Thursday morning, city officials estimated that at least 84 buildings had been damaged in the fire.</p>\n\n<p>Ofunato's mayor Kiyoshi Fuchigami described the fire as \"large-scale\" on Wednesday evening, saying around 600 hectares (1,500 acres) of land — three times the size of Monaco — had been burned.</p>\n\n<p></p>\n\n<p>The cause of the blaze remained unknown, he added.</p>\n\n<p>There were about 1,300 wildfires across Japan in 2023, concentrated in the February to April period when the air dries out and winds pick up.</p>\n\n<p>Ofunato has seen only 2.5 millimeters (0.1 inches) of rainfall this month — on course to fall far below the previous record low for February of 4.4 millimeters in 1967.</p>\n\n<p>And last year was Japan's hottest since records began, mirroring other nations as ever-rising greenhouse gas emissions fuel climate change.</p>\n\n<p>In the case of the latest Iwate fire, \"strong wind\" from the west helped spread a series of smaller wildfires in the same area, Fuchigami said.</p>\n\n<p>One evacuee, a 45-year-old woman, told NHK that the fire had been approaching her house when she returned from work.</p>\n\n<p>\"I was relieved that my kids were safe,\" she said.</p>\n\n<p>Another, a 32-year-old man, told the broadcaster it was \"my first time to see a series of fires happen in such rapid succession.\"</p>",
        "published": "Thu, 27 Feb 2025 16:17:13 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/japan-forest-fire-kills-one-prompts-evacuations/2063685"
    },
    {
        "title": "USAID workers will be given 15 minutes to clear their workspaces as the agency gets dismantled",
        "link": "https://www.manilatimes.net/2025/02/27/world/usaid-workers-will-be-given-15-minutes-to-clear-their-workspaces-as-the-agency-gets-dismantled/2063618",
        "description": "<p>WASHINGTON, D.C. — Thousands of US Agency for International Development workers who have been fired or placed on leave as part of the Trump administration's dismantling of the agency are being given a brief window Thursday and Friday to clear out their workspaces.</p>\n\n<p>USAID placed 4,080 staffers who work across the globe on leave Monday. That was joined by a \"reduction in force\" that will affect another 1,600 employees, a State Department spokesman said in an emailed response to questions.</p>\n\n<p>USAID has been one of the biggest targets so far of a broad campaign by President Donald Trump and the Department of Government Efficiency, a project of Elon Musk, to slash the size of the federal government. The actions at USAID leave only a fraction of its employees on the job.</p>\n\n<p>Trump and Musk have moved swiftly to shutter the foreign aid agency, calling its programs out of line with the president's agenda and asserting without evidence that its work is wasteful. In addition to its scope, their effort is extraordinary because it has not involved Congress, which authorized the agency and has provided its funding.</p>\n\n<p>A report from the Congressional Research Service earlier this month said congressional authorization is required \"to abolish, move, or consolidate USAID,\" but the Republican majorities in the House and Senate have made no pushback against the administration's actions. There's virtually nothing left to fund, anyway: The administration now says it is eliminating more than 90 percent of USAID's foreign aid contracts and $60 billion in US assistance around the world.</p>\n\n<p>It's unclear how many of the more than 5,600 USAID employees who have been fired or placed on leave work at the agency's headquarters building in Washington. A notice on the agency's website said staff at other locations will have the chance to collect their personal belongings at a later date.</p>\n\n\nRetired United States Agency for International Development worker Julie Hanson Swanson (left) join supporters of USAID workers outside the USAID's Bureau of Humanitarian affairs office in Washington, Friday, Feb. 21, 2025. AP PHOTO\n\n\n<p>The notice laid out instructions for when specific groups of employees should arrive to be screened by security and escorted to their former workspaces. Those being let go must turn in all USAID-issued assets. Workers on administrative leave were told to retain their USAID-issued materials, including diplomatic passports, \"until such time that they are separated from the agency.\"</p>\n\n<p>Many USAID workers saw the administration's terms for retrieving their belongings as insulting. In the notice, the employees were instructed not to bring weapons, including firearms, \"spear guns\" and \"hand grenades.\" Each worker is being given just 15 minutes at their former workstation.</p>\n\n<p>The administration's efforts to slash the federal government are embroiled in various lawsuits, but court challenges to temporarily halt the shutdown of USAID have been unsuccessful.</p>\n\n<p>However, a federal judge on Tuesday gave the Trump administration a deadline of this week to release billions of dollars in US foreign aid, saying it had given no sign of complying with his nearly two-week-old court order to ease the funding freeze. Late Wednesday, the Supreme Court temporarily blocked that order, with Chief Justice John Roberts saying it will remain on hold until the high court has a chance to weigh in more fully.</p>\n\n<p>That court action resulted from a lawsuit filed by nonprofit organizations over the cutoff of foreign assistance through USAID and the State Department. Trump froze the money through an executive order on his first day in office that targeted what he portrayed as wasteful programs that do not correspond to his foreign policy goals.</p>\n\n<p>Virginia Democratic Rep. Gerald Connolly said in a statement that the attack on USAID employees was \"unwarranted and unprecedented.\" Connolly, whose district includes a sizable federal workforce, called the aid agency workers part of the \"world's premier development and foreign assistance agency\" who save \"millions of lives every year.\"</p>",
        "published": "Thu, 27 Feb 2025 14:24:45 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/usaid-workers-will-be-given-15-minutes-to-clear-their-workspaces-as-the-agency-gets-dismantled/2063618"
    },
    {
        "title": "North Korea behind $1.5 billion crypto theft, FBI says",
        "link": "https://www.manilatimes.net/2025/02/27/world/north-korea-behind-15-billion-crypto-theft-fbi-says/2063600",
        "description": "<p>WASHINGTON, D.C. — The US Federal Bureau of Investigation on Wednesday accused North Korea of being behind the theft of $1.5 billion worth of digital assets last week, the largest crypto heist in history.</p>\n\n<p>\"(North Korea) was responsible for the theft of approximately $1.5 billion USD in virtual assets from cryptocurrency exchange, Bybit,\" the FBI said in a public service announcement.</p>\n\n<p>The bureau said a group called TraderTraitor, also known as the Lazarus Group, was behind the theft.</p>\n\n\nAn FBI seal is displayed on a podium before a news conference at the field office in Portland, Ore., Jan. 16, 2025. AP PHOTO\n\n\n<p>It said they were \"proceeding rapidly and have converted some of the stolen assets to Bitcoin and other virtual assets dispersed across thousands of addresses on multiple blockchains.\"</p>\n\n<p>\"It is expected these assets will be further laundered and eventually converted to fiat currency,\" the FBI added.</p>\n\n<p>Lazarus Group gained notoriety a decade ago when it was accused of hacking into Sony Pictures as revenge for \"The Interview,\" a film that mocked North Korean leader Kim Jong Un.</p>\n\n<p>North Korea's cyber-warfare program dates back to at least the mid-1990s.</p>\n\n<p>It has since grown to a 6,000-strong cyber-warfare unit known as Bureau 121 that operates from several countries, according to a 2020 US military report.</p>",
        "published": "Thu, 27 Feb 2025 13:38:48 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/north-korea-behind-15-billion-crypto-theft-fbi-says/2063600"
    },
    {
        "title": "Zelenskyy set to meet Trump Friday with Ukraine minerals on table",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/zelenskyy-set-to-meet-trump-friday-with-ukraine-minerals-on-table/2063585",
        "description": "<p>KYIV, Ukraine — President Volodymyr Zelenskyy is set to meet Donald Trump on Friday to finalize a deal on US access to Ukraine's mineral wealth, hoping to win guarantees of future American support.</p>\n\n<p>Holding his first cabinet meeting Wednesday, Trump said the Ukrainian president's visit to Washington was \"now confirmed\", after days of tension between the two leaders over the minerals deal.</p>\n\n<p>Zelenskyy, who has come under mounting pressure from US officials to sign the accord, told a press conference he would immediately follow his trip to Washington with talks with UK Prime Minister Keir Starmer and other European leaders in Britain at the weekend.</p>\n\n<p>His comments came just after Russian artillery killed at least five people in Ukraine's war-battered east and a drone barrage claimed two more lives near Kyiv, including a Ukrainian journalist.</p>\n\n<p>Discussions were fraught on the minerals deal, which would grant the United States preferential access to Ukrainian natural resources in exchange for US security support.</p>\n\n<p>Officials late on Tuesday said they had come to an agreement following protracted negotiations, but Zelenskyy told reporters in Kyiv that more difficult work lay ahead.</p>\n\n<p>\"This is a start, this is a framework agreement,\" he told journalists.</p>\n\n<p>Further discussions between US and Ukrainian officials would determine the nature of security guarantees for Ukraine and the exact sums of money at stake in the accords.</p>\n\n<p>\"Guarantees of peace and security are the key to preventing Russia from destroying the lives of other nations,\" Zelenskyy said in his evening video address.</p>\n\n<p>However, Trump earlier brushed aside Ukraine's aspirations of joining the Atlantic defence alliance, saying: \"NATO -- you can forget about.\"</p>\n\n<p>\"I think that's probably the reason the whole thing started,\" he added, referring to the war.</p>\n\n<p>'Could be great' </p>\n\n<p>Zelenskyy had warned the \"deal could be a great success or simply disappear. Whether it is a big success, I think, depends on our conversation with President Trump. We'll draw conclusions after.\"</p>\n\n<p>Zelenskyy's refusal to sign a first draft of the accord delivered to him in Kyiv by the US treasury secretary was met with anger by Trump, who called the Ukrainian leader a \"dictator\" afterward.</p>\n\n<p>The Kremlin has also sought to woo Trump by lavishing praise on the US leader and by encouraging American investments in natural resources in Ukrainian territory controlled by Russian forces.</p>\n\n<p>Russian and US diplomats will meet in Istanbul on Thursday to discuss resolving issues related to their embassies, Russia's foreign minister said, as tensions ease between the two countries.</p>\n\n<p>But both Moscow and Kyiv have stepped up aerial attacks on their energy and military facilities, even as Trump pushes for a deal to end the conflict launched by Russia more than three years ago.</p>\n\n<p>AFP journalists in Kyiv heard explosions ringing out after Russia launched its drone barrage, which the Ukrainian air force later said consisted of 177 drones of various types targeting regions across the country.</p>\n\n<p>Deadly attacks </p>\n\n<p>The Ukrinform news agency announced Wednesday afternoon that its journalist Tetiana Kulyk was among those killed in the attack.</p>\n\n<p>\"Her untimely death has shocked her colleagues and is a huge loss for the agency,\" it said in a statement.</p>\n\n<p>The university where Kulyk's husband worked said it was likely that he was at home with her at the time of the strike, and authorities said they had found a second body.</p>\n\n<p>And Ukraine's largest private energy company, DTEK, said one of its facilities had been damaged in the Dnipropetrovsk region, without elaborating.</p>\n\n<p>On the front line, Russian forces have been clawing their way towards the town of Kostyantynivka and intensively bombarding the civilian hub in the eastern Donetsk region, which the Kremlin claims is part of Russia.</p>\n\n<p>Regional authorities said five people were killed and 11 wounded in the latest strikes by Russia, which has a better-resourced and large army across the sprawling front line.</p>\n\n<p>Ukraine however announced that it had launched a successful counterattack in the Donetsk region, gaining control over the village of Kotlyne near a key transit artery and the logistics hub of Pokrovsk.</p>\n\n<p>The Russian defence ministry said separately that its forces had gained control over two villages in the Kursk region where Ukrainian forces launched a surprise offensive in August last year.</p>\n\n<p>Energy facilities damaged </p>\n\n<p>Kyiv has stepped up air strikes against energy and military facilities on Russian territory in recent months, in what it says is a response to Moscow's bombardment of its cities and energy infrastructure.</p>\n\n<p>Drone attacks overnight targeted the Russian regions of Bryansk and Kursk, according to the ministry.</p>\n\n<p>No major damage was immediately reported by Russian media or authorities.</p>\n\n<p>burs-jbr/brw/giv/jhb</p>",
        "published": "Thu, 27 Feb 2025 12:21:14 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/zelenskyy-set-to-meet-trump-friday-with-ukraine-minerals-on-table/2063585"
    },
    {
        "title": "News wires decry restrictions on access to White House events",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/news-wires-decry-restrictions-on-access-to-white-house-events/2063584",
        "description": "<p>WASHINGTON, D.C. — Three major international news wire agencies on Wednesday called steps by the White House to limit their access to the pool covering President Donald Trump a threat to the independence of the press.</p>\n\n<p>On Tuesday, the White House stripped journalists of the nearly century-old power to decide which of them cover US presidential events, with Trump boasting that he was now \"calling those shots\" on media access.</p>\n\n<p>\"It is essential in a democracy for the public to have access to news about their government from an independent, free press,\" said a statement signed by the editorial heads of Reuters, Bloomberg News and The Associated Press.</p>\n\n<p>\"We believe that any steps by the government to limit the number of wire services with access to the President threatens that principle.\"</p>\n\n<p>The press pool is a small group of reporters that covers the US president in cramped spaces, particularly the Oval Office, and shares their material with other news organizations.</p>\n\n<p>The three agencies, which had permanent seats as part of the White House pool in the past, have seen that access reduced to a single seat under the new policy.</p>\n\n<p>The Associated Press, which Trump has barred from presidential events in a row over his renaming the Gulf of Mexico as the \"Gulf of America,\" has seen its access to presidential events revoked completely.</p>\n\n<p>In their statement, the agencies said the move \"harms the spread of reliable information to people, communities, businesses and global financial markets that heavily depend on our reporting.\"</p>\n\n<p>The statement was signed by AP Executive Editor Julie Pace, Bloomberg Editor-in-Chief John Micklethwait and Reuters Editor-in-Chief Alessandra Galloni.</p>\n\n<p>Before the White House announcement, members of the pool were chosen by the White House Correspondents Association, an independent group representing journalists.</p>\n\n<p>AFP is also part of the White House pool, but is in a different category to AP, Bloomberg and Reuters. Its access has not been altered by the recent changes by the Trump administration.</p>\n\n<p>Katherine Jacobsen, program coordinator with watchdog Committee to Protect Journalists (CPJ), told AFP \"solidarity among news organizations\" was crucial when faced with such challenges.</p>\n\n<p>\"This is not a partisan issue, this is not a left-leaning media issue or a right-leaning media issue,\" she said.</p>\n\n<p>\"This is an issue of access to information and the state of American democracy and what does it say if one of the world's largest wire agencies is not able to access pool information at the White House.\"</p>",
        "published": "Thu, 27 Feb 2025 12:18:54 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/news-wires-decry-restrictions-on-access-to-white-house-events/2063584"
    },
    {
        "title": "EU was born to 'screw' US, Trump says",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/eu-was-born-to-screw-us-trump-says/2063579",
        "description": "<p>WASHINGTON, D.C. — President Donald Trump said Wednesday that the European Union was born to \"screw\" the United States, laying bare his hostility to the longtime US partner as he detailed new tariffs.</p>\n\n<p>Trump's month back in the White House has been marked by soaring friction between Washington and its European allies, with the United States abruptly shifting gears on support for Ukraine and Germany's likely next leader urging Europe to seek take greater control of its own defense.</p>\n\n<p>\"Look, let's be honest, the European Union was formed in order to screw the United States,\" Trump told reporters as he gathered his cabinet for the first time.</p>\n\n<p>\"That's the purpose of it, and they've done a good job of it. But now I'm president,\" Trump said.</p>\n\n<p>The European Commission shot back that the European Union is \"the world's largest free market\" and has been \"a boon for the United States.\"</p>\n\n<p>Former Swedish prime minister Carl Bildt, writing on X, said Trump had a \"seriously distorted view of history\" as the EU was \"actually set up to prevent war on the European continent.\"</p>\n\n<p>The United States for decades cheered on European integration, seeing the EU's formation in 1993 as a historic achievement to end conflict on a continent ravaged by two world wars.</p>\n\n<p>Trump by contrast applauded Britain when it left the single European market, and has vowed an \"America First\" policy of pursuing self-interest above any abstract concepts of partnership.</p>\n\n<p>Trump said at his cabinet meeting that the European Union has \"really taken advantage of us.\"</p>\n\n<p>The United States had a trade deficit to the 27-nation bloc of $235.6 billion last year, according to official US figures.</p>\n\n<p>Asked if he had made a decision on tariff levels for the European Union, Trump added: \"We'll be announcing it very soon and it'll be 25 percent, generally speaking.\"</p>\n\n<p>He said that cars would be among the products to be hit -- grim news for Germany whose export-driven economy has been in a slump.</p>\n\n<p>The European Commission warned it would respond \"firmly and immediately\" to new tariffs.</p>\n\n<p>Trump has also slapped tariffs on US neighbors Canada and Mexico as well as rival China, citing issues including illegal immigration and fentanyl smuggling.</p>\n\n<p>EU meeting scrapped </p>\n\n<p>Trump, who has made the deportation of undocumented immigrants a top priority, acknowledged his origins in Europe, saying wryly: \"I guess I'm from there at some point a long time ago, right?\"</p>\n\n<p>But whatever the common heritage, tensions have risen sharply with the European Union on a series of issues starting with Ukraine.</p>\n\n<p>EU foreign policy chief Kaja Kallas was visiting Washington on Wednesday and had earlier announced that she would meet Secretary of State Marco Rubio.</p>\n\n<p>The meeting was canceled, with a European Union spokesman citing \"scheduling issues.\" Trump, however, saw French President Emmanuel Macron on Monday and meets British Prime Minister Keir Starmer on Thursday.</p>\n\n<p>On Monday, the United States sided with Russia and against nearly all European allies at the United Nations in backing a resolution that called for a swift end to the war without insisting on Ukraine's territorial integrity.</p>\n\n<p>Trump insisted Wednesday it was up to Europe, not the United States, to provide security guarantees to Ukraine, even as President Volodymyr Zelensky prepared to fly to Washington to sign an agreement giving US control of much of his country's mineral wealth.</p>\n\n<p>The winner of Germany's election on Sunday, Friedrich Merz, is a longstanding supporter of the transatlantic alliance but has warned not to be under illusions about Trump.</p>\n\n<p>Merz said that Europe must move quickly to \"achieve independence\" from the United States on defense matters.</p>\n\n<p>Rubio, in an interview broadcast Wednesday with Fox News, said that the NATO alliance was \"not in jeopardy\" but that Europe needed to spend more on its own defense.</p>\n\n<p>\"We're not saying do your own thing. We're saying do more. It's their continent, right?\" he said.</p>",
        "published": "Thu, 27 Feb 2025 12:17:05 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/eu-was-born-to-screw-us-trump-says/2063579"
    },
    {
        "title": "Private US company blasts off for second Moon landing attempt",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/private-us-company-blasts-off-for-second-moon-landing-attempt/2063578",
        "description": "<p>A US company is aiming for its second lunar touchdown after a lander carrying a suite of unique experiments successfully launched aboard a SpaceX rocket on Wednesday.</p>\n\n<p>Intuitive Machines made history last year as the first private entity to put a robot on the Moon, though the triumph was marred by the lander tipping onto its side -- something it hopes to avoid this time around.</p>\n\n<p>The Houston-based firm's hexagonal-shaped lander, Athena, blasted off in a SpaceX Falcon 9 rocket at 7:16 pm (0016 GMT Thursday) from NASA's Kennedy Space Center in Florida.</p>\n\n<p>If all goes well, it will touch down around March 6 at the vast Mons Mouton plateau, a site closer to the lunar south pole than any previously targeted.</p>\n\n<p>Athena carries scientific instruments, including a drill to search for ice beneath the surface and a first-of-its-kind hopping drone named Grace after a famous computer scientist, Grace Hopper.</p>\n\n<p>It is designed to traverse the Moon's rugged inclines, boulders, and craters -- a valuable capability to support future crewed missions.</p>\n\n<p>Also aboard is a small rover, which will test a lunar cellular network provided by Nokia Bell Labs by relaying commands, images, and video between the lander, rover, and hopper. This network is planned to eventually be integrated into astronauts' suits.</p>\n\n<p>Intuitive Machines CEO Trent Martin spoke excitedly about the hopper, emphasizing that such drones could complement rovers in future missions by going \"down into extreme environments where you can't drive,\" including lunar pits and underground passages carved by ancient lava flows.</p>\n\n<p>Until recently, soft lunar landings were achieved only by a handful of well-funded national space agencies.</p>\n\n<p>Now, the US is working to make private missions routine through the Commercial Lunar Payload Services (CLPS) program, a public-private collaboration aimed at delivering NASA hardware to the surface at a fraction of the cost of traditional missions.</p>\n\n<p>\"I'm very excited to see the science that our tech demonstrations deliver as we prepare for humanity's return to the Moon and the journey to Mars,\" NASA's Nicky Fox told reporters, referencing the Artemis program, which aims to return astronauts to the lunar surface later this decade.</p>\n\n<p>Sticking the landing </p>\n\n<p>First, however, Intuitive Machines will want to achieve an upright landing -- a feat the company fell short of with its previous lander, Odysseus, which went to space in February 2024.</p>\n\n<p>It came down too fast, caught a foot on the surface and tipped over, coming to rest at a 30-degree angle. This limited its ability to generate solar power and prevented it from completing NASA experiments under a $118 million contract.</p>\n\n<p>This time, the price tag is $62.5 million.</p>\n\n<p>Landing on the Moon is challenging due to the absence of an atmosphere, which rules out the use of parachutes.</p>\n\n<p>Instead, spacecraft must rely on precisely controlled thruster burns to slow their descent while navigating treacherous terrain.</p>\n\n<p>Martin said the company had made key improvements -- including better cabling for the laser altimeter, an instrument that provides altitude and velocity readings and helps select a safe landing site.</p>\n\n<p>Athena's arrival at the Moon is set to be preceded on March 2 by another private US lander, Firefly Aerospace's Blue Ghost, which launched on a more circuitous journey back in January, sharing a ride with Tokyo-based ispace's Resilience lander.</p>\n\n<p>Also hitching a ride on this rocket will be NASA's Lunar Trailblazer probe, which will enter orbit after a four-month journey and begin a two-year mission to study the distribution of different forms of water on the Moon.</p>\n\n<p>These missions come at a delicate time for NASA, amid speculation that it may scale back or cancel its astronaut program to the Moon in favor of Mars -- a key goal of both President Donald Trump and his close advisor Elon Musk, SpaceX tycoon.</p>",
        "published": "Thu, 27 Feb 2025 12:14:28 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/private-us-company-blasts-off-for-second-moon-landing-attempt/2063578"
    },
    {
        "title": "Pope battling pneumonia shows new improvement, Vatican says",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/pope-battling-pneumonia-shows-new-improvement-vatican-says/2063563",
        "description": "<p>VATICAN CITY — Pope Francis's condition showed \"a further, slight improvement\", the Vatican said Wednesday, while continuing to maintain the prognosis for the 88-year-old fighting pneumonia in both lungs was \"reserved\".</p>\n\n<p>\"The clinical conditions of the Holy Father in the last 24 hours have shown a further, slight improvement,\" said the Vatican in its nightly bulletin on the health of the pontiff, who has been in hospital since February 14.</p>\n\n<p>\"Although a slight improvement is being recorded, the prognosis remains reserved,\" it said.</p>\n\n<p>The Argentine pope was originally admitted to Rome's Gemelli hospital with breathing difficulties and bronchitis, but his condition subsequently deteriorated, sparking widespread concern among Catholics.</p>\n\n<p>Respiratory attacks he suffered at the weekend that required high levels of oxygen and blood transfusions have not repeated, according to the Vatican, although he continues to receive oxygen and do breathing exercises.</p>\n\n<p>On Wednesday, the Vatican said a CT scan performed Tuesday showed \"normal progression of the pulmonary inflammatory condition\" while blood tests on Wednesday confirmed the improvement.</p>\n\n<p>It also said that a mild renal insufficiency detected at the weekend \"had resolved.\"</p>\n\n<p>As Catholics across the globe pray for Francis, doctors have warned the path to recovery could be long, with the Jesuit pontiff likely staying in hospital beyond this week.</p>\n\n<p>Despite his critical condition, the leader of the world's nearly 1.4 billion Catholics has kept up with Church matters from his hospital suite, according to the Vatican.</p>\n\n<p>Now on his 13th day in the hospital, the pope Wednesday was \"sitting in a chair, and continuing with the treatment as normal\", a Vatican source said.</p>\n\n<p>The Vatican said he received the Eucharist in the morning and spent his afternoon working.</p>\n\n<p>The current hospitalisation is Francis's fourth and longest.</p>\n\n<p>The pope, who had part of one of his lungs removed as a young man, has suffered increasing health problems in recent years.</p>\n\n<p>He is prone to bronchitis and suffers from hip and knee pain, which has made him reliant on a wheelchair.</p>\n\n<p>Pilgrims and faithful have been flocking to the Vatican and the Gemelli to pray for Francis, with a fresh round of prayers held in St Peter's Square later Wednesday evening.</p>",
        "published": "Thu, 27 Feb 2025 11:02:38 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/pope-battling-pneumonia-shows-new-improvement-vatican-says/2063563"
    },
    {
        "title": "Tesla owners sour on Musk's venture into US politics",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/tesla-owners-sour-on-musks-venture-into-us-politics/2063562",
        "description": "<p>WASHINGTON, D.C. — Tom Blackburn was so proud of his Tesla, he even bought one in bright red to stand out. But with company CEO Elon Musk's foray into US politics, he's sworn never to buy from the electric carmaker again.</p>\n\n<p>Musk has already divided Americans by helping President Donald Trump slash government spending in moves denounced as illegal and immoral by critics.</p>\n\n<p>Now the controversy may be ricocheting against Tesla – his pioneering brand once adored by environmentally conscious buyers.</p>\n\n<p>\"I'm just a little embarrassed to be driving it at this point,\" retired attorney Blackburn told AFP of the Tesla he bought more than a decade ago. \"I have pretty much soured on Tesla as a brand.\"</p>\n\n<p>A bumper sticker reading \"I bought this before I knew he was crazy\" has adorned his car since last year.</p>\n\n<p>The 76-year-old from Virginia jokes: \"Now I think I need something stronger.\"</p>\n\n<p>Musk became chief executive of Tesla in 2008, overseeing the company's rise to the world's most valuable automaker in terms of market capitalization.</p>\n\n<p>But analysts say Musk's political endeavors -- including backing far-right parties in Europe and sharing conspiracy theories online -- could isolate Tesla's traditionally liberal market base.</p>\n\n<p>\"I think he will have a long-term damaging effect on the brand and the business,\" said Daniel Binns, global CEO of Elmwood Brand Consultancy.</p>\n\n<p>He said that Tesla needs to \"disassociate\" from Musk in its marketing, warning of a \"perfect storm\" looming as an aging lineup of cars puts it at risk of losing customers to rival companies.</p>\n\n<p>\"The brand on so many levels is not aligned with its audience and the market is filled with fantastic competitors,\" Binns told AFP.</p>\n\n<p>Tesla's share price slumped by nine percent this week as it reported disappointing sales in Europe, which traders at least partly attributed to issues with how buyers view Musk.</p>\n\n<p>However, investors are yet to see strong evidence that the billionaire's politics are hurting Tesla's business.</p>\n\n<p>\"Increased political activity does create a risk that Tesla may alienate some consumers from buying a Tesla, but it's too early to say there is an impact to the company,\" said Seth Goldstein, equity strategist at Morningstar.</p>\n\n<p>'Dump your stock' </p>\n\n<p>Controversies generated by Musk, including what resembled a Nazi salute -- he said it was not one -- at a Trump rally, have nonetheless already prompted a backlash.</p>\n\n<p>Kumait Jaroje, a physician from the Boston area, told AFP he is trying to sell his Tesla Cybertruck to avoid harassment after a note reading \"Nazi F*** Off\" was stuck on it.</p>\n\n<p>The 40-year-old, who supported Trump in November's election, bought the futuristic-looking vehicle in gold last year to advertise his cosmetic surgery, but said he has since been sworn at and cut off by other motorists.</p>\n\n<p>\"I'm avoiding driving it,\" said Jaroje, adding that \"Tesla has become a label for people who like Musk -- which is not true.\"</p>\n\n<p>Around 54 percent of Americans hold unfavorable views of Musk, according to a Pew Research Center poll, though the results are split on party lines with Democrats far more critical than Republicans.</p>\n\n<p>Some are showing their opposition to Musk by protesting at Tesla showrooms and encouraging owners to \"Dump your stock\" to devalue the vehicles.</p>\n\n<p>American singer Sheryl Crow sold her Tesla in protest of Musk this month and said the proceeds would go to NPR, a US radio network that faces cuts in its government funding.</p>\n\n<p>Yet Luis Garay, an independent who voted Democrat in the election, told AFP he can separate Musk's political views from Tesla.</p>\n\n<p>\"We love Tesla cars, we don't like Elon Musk's political views,\" said the 68-year-old from Maryland.</p>\n\n<p>For self-described liberal Margaret Moerchen, from US capital Washington, it is crucial she makes clear that \"our driving a Tesla does not endorse Elon Musk.\"</p>\n\n<p>Her Tesla, which she bought in 2015 to reduce her carbon emissions, is now covered in stickers reading \"Up with EVs, down with Musk\" and the LGBTQ pride flag.</p>\n\n<p>The 45-year-old astronomer said she won't be buying Tesla again and instead cited her interest in competitor Rivian.</p>\n\n<p>\"Tesla's not the only game in town anymore,\" she said.</p>",
        "published": "Thu, 27 Feb 2025 10:59:17 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/tesla-owners-sour-on-musks-venture-into-us-politics/2063562"
    },
    {
        "title": "Proposed 'weather control' bans surge across US states",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/proposed-weather-control-bans-surge-across-us-states/2063561",
        "description": "<p>WASHINGTON, D.C. — Fake stories that atmospheric experiments are triggering natural disasters have led to US states pushing blanket bans on weather modification, which experts say may jeopardize current local scientific programs and hinder future research.</p>\n\n<p>From recent deadly flooding in Kentucky to the Florida and North Carolina monster hurricanes of 2024, Americans have amplified increasingly conspiratorial explanations for extreme weather events -- even blaming manufactured clouds blocking sunlight for the devastation.</p>\n\n<p>In response, lawmakers are moving to criminalize legitimate scientific experiments in the atmosphere.</p>\n\n<p>In Kentucky, Republican John Hodgson told AFP he introduced a bill because his constituents \"do not want to allow any government attempts to modify the solar radiation or weather.\"</p>\n\n<p>But no such government program played a role in the state's weather whiplash.</p>\n\n<p>\"None of this is government control,\" said Shane Holinde, a meteorologist at the Kentucky Climate Center.</p>\n\n<p>\"It is all Mother Nature,\" he told AFP of the \"rollercoaster of a month.\"</p>\n\n<p>The severe weather events claimed 23 lives across the state, according to Democratic Governor Andy Beshear.</p>\n\n<p>The actions in Kentucky and other states highlight how misinformation has become entrenched in political discourse, driving legislative efforts in response to conspiracy theories.</p>\n\n<p>Tennessee is the first and only state to have passed such a law, despite witness testimony citing chemtrails -- a conspiracy that purports toxic chemicals are being sprayed from aircraft.</p>\n\n<p>Kentucky bill co-sponsor, Republican Steve Rawlings, also alluded to them, telling local media his efforts address constituents' concerns of \"streaks in the skies.\"</p>\n\n<p>The efforts reflect general confusion over beneficial, small-scale activities, such as targeted cloud seeding programs in the arid West and large-scale geoengineering projects that are still decades away from possible implementation.</p>\n\n<p>For example, the text targets stratospheric aerosol injection -- a futuristic technique that the wider public knows little about.</p>\n\n<p>Scientists hope the method might allow them to shift the total energy balance between the Earth and the Sun and reduce some of the most blatant effects of climate change, including supercharged floods and storms, but it is currently only at a research stage.</p>\n\n<p>The Kentucky legislation mirrors bills advancing in Florida and Arizona since the start of the year.</p>\n\n<p>Edward Parson, environmental law professor at UCLA, said such bills often seek \"to prohibit something that is not happening.\"</p>\n\n<p>He warned that as more states consider these laws, people will be misled to believe they are \"a sensible, legitimate\" issue.</p>\n\n<p>Blanket bans </p>\n\n<p>As global warming makes weather extremes more likely, each new natural disaster brings further pushback against \"weather control\" from an increasingly loud crowd, including prominent political figures such as Republican Congresswoman Marjorie Taylor Greene.</p>\n\n<p>Blanket bans also run the risk of hindering projects shown to benefit farmers by managing hyper-local precipitation and reducing crop losses from hail.</p>\n\n<p>\"These state legislations feel a little bit like a knee-jerk reaction,\" said Deborah Sivas, environmental law professor at Stanford University, while cautioning regulation around larger geoengineering experiments may prove necessary on an international scale.</p>\n\n<p>\"There is a bigger conversation to be had about if you can do things to manipulate weather patterns\" over the ocean or other large shared areas, she said.</p>\n\n<p>Dana Willbanks of Columbia University's Climate Science Legal Defense Fund is tracking science-silencing initiatives nationwide.</p>\n\n<p>She pointed to a surge of climate-skeptic discourse and censorship at all levels of government since the start of the second Trump administration, down to city councils and school boards.</p>\n\n<p>\"We are going to start seeing more and more outrageous bills\" like bans on weather control, she said.</p>",
        "published": "Thu, 27 Feb 2025 10:53:11 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/proposed-weather-control-bans-surge-across-us-states/2063561"
    },
    {
        "title": "Taiwan says detects 45 Chinese aircraft in 24-hours, highest this year",
        "link": "https://www.manilatimes.net/2025/02/27/world/asia-oceania/taiwan-says-detects-45-chinese-aircraft-in-24-hours-highest-this-year/2063559",
        "description": "<p>TAIPEI — Taiwan said Thursday it detected 45 Chinese aircraft near the self-ruled island, the highest number this year and a tally that comes a day after Taipei condemned China's \"live-fire\" drills off the south.</p>\n\n<p>China claims democratic Taiwan as part of its territory and has threatened to use force to bring the island under its control.</p>\n\n<p>Beijing has increased the deployment of fighter jets and naval vessels around Taiwan in recent years to press its claim of sovereignty, which Taipei rejects.</p>\n\n<p>In the 24 hours to 6:00 am (2200 GMT on Wednesday), 45 Chinese aircraft and 14 warships were spotted near Taiwan, Taipei's defence ministry said in a statement.</p>\n\n<p>It was the highest number of Chinese aircraft detected this year and the most since December 11, an AFP tally of the ministry's daily figures shows.</p>\n\n<p>Taiwan said Wednesday that China staged a combat drill with aircraft and warships and announced \"live-fire exercises\" in an area about 40 nautical miles (74 kilometres) off the island's south, which Taipei condemned as dangerous and a violation of \"international norms\".</p>\n\n<p>Taiwan's military responded by sending forces to \"monitor, alert and respond appropriately\", the ministry said.</p>\n\n<p>Beijing's foreign ministry declined to comment on Wednesday.</p>\n\n<p>Taiwan's foreign ministry on Thursday condemned China's actions and called on Beijing to \"exercise rational self-restraint\" and to \"immediately stop military provocations\".</p>\n\n<p>The ministry also urged the international community \"to continue to pay attention to the security of the Taiwan Strait and the region, and jointly condemn China's\" actions.</p>\n\n<p>On Tuesday, Taiwan seized a Chinese-crewed cargo ship suspected of severing a subsea telecoms cable serving Taiwan's Penghu island group.</p>\n\n<p>There is growing concern in Taiwan over the security of its cables after a Chinese-owned cargo ship was suspected of cutting one northeast of the island this year.</p>\n\n<p>Taiwan fears China could sever its communication links as part of an attempt to seize the island or to blockade it.</p>\n\n<p>Flashpoint </p>\n\n<p>Taiwan is also a potential flashpoint for a war between China and the United States, which is the island's most important backer and biggest arms supplier.</p>\n\n<p>While the United States is legally bound to provide arms to Taiwan -- which Beijing opposes -- Washington has long maintained \"strategic ambiguity\" when it comes to whether it would deploy its military to defend it from a Chinese attack.</p>\n\n<p>Despite longstanding strong bipartisan support in the US Congress for Taiwan, there are fears that President Donald Trump might not consider the island worth defending if China attacked.</p>\n\n<p>Taiwan President Lai Ching-te has already vowed to boost investment in the United States to reduce the trade imbalance and spend more on the island's military, while his government is also considering increasing US natural gas imports.</p>\n\n<p>The dispute between China and Taiwan dates back to 1949 when Chiang Kai-shek's Kuomintang nationalist forces fled to Taiwan after losing the Chinese civil war with Mao Zedong's communist fighters.</p>\n\n<p>Communist China has never ruled Taiwan, where indigenous tribes have lived for thousands of years. The island was partly or totally ruled at various times by the Dutch, Spanish, China's Qing dynasty and Japan.</p>",
        "published": "Thu, 27 Feb 2025 10:49:38 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/asia-oceania/taiwan-says-detects-45-chinese-aircraft-in-24-hours-highest-this-year/2063559"
    },
    {
        "title": "Iran speeds production of near weapons-grade uranium as US tensions rise",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/iran-speeds-production-of-near-weapons-grade-uranium-as-us-tensions-rise/2063558",
        "description": "<p>VIENNA — Iran has accelerated its production of near weapons-grade uranium as tensions between Tehran and Washington rise after the election of US President Donald Trump, a report by the United Nations' nuclear watchdog seen by The Associated Press on Wednesday showed.</p>\n\n<p>The report by the Vienna-based International Atomic Energy Agency said that as of Feb. 8, Iran has 274.8 kilograms (605.8 pounds) of uranium enriched up to 60%. That's an increase of 92.5 kilograms (203.9 pounds) since the IAEA's last report in November.</p>\n\n<p>That material is a short, technical step away from weapons-grade levels of 90%.</p>\n\n<p>A report in November 2024 put the stockpile at 182.3 kilograms (401.9 pounds). It had 164.7 kilograms (363.1 pounds) last August.</p>\n\n<p>\"The significantly increased production and accumulation of high enriched uranium by Iran, the only non-nuclear weapon State to produce such nuclear material, is of serious concern,\" the confidential report stated. According to the IAEA, approximately 42 kilograms of 60% enriched uranium is theoretically enough to produce one atomic bomb, if enriched further to 90%.</p>\n\n<p>The IAEA also estimated in its quarterly report that as of Feb. 8, Iran's overall stockpile of enriched uranium stands at 8,294.4 kilograms (18,286 pounds), which represents an increase of 1,690.0 kilograms (3725.8 pounds) since the last report in November.</p>\n\n<p>Trump administration warns TehranThe Trump administration said Iran must be prevented from acquiring nuclear weapons.</p>\n\n<p>\"President Trump has put the Iran Regime on notice by reimposing Maximum Pressure and is committed to ensuring the regime never gets a nuclear weapon. He has also made clear he is open to talks with Iran to come to an agreement that fully addresses the outstanding issues between our two countries,\" National Security Council spokesperson Brian Hughes said.</p>\n\n<p>Trump's first term in office was marked by a particularly troubled period in relations with Tehran. In 2018 he unilaterally withdrew the US from Iran's nuclear deal with world powers, leading to sanctions hobbling the economy, and ordered the killing of the country's top general.</p>\n\n<p>Under the original 2015 nuclear deal, Iran was allowed to enrich uranium only up to 3.67% purity and maintain a stockpile of uranium of 300 kilograms.</p>\n\n<p>Iran's accelerated production of near weapons-grade uranium puts more pressure on Trump as he's repeatedly said he's open to negotiations with the Islamic Republic while also increasingly targeting Iran's oil sales with sanctions as part of his reimposed \"maximum pressure\" policy.</p>\n\n<p>Iran's Supreme Leader Ayatollah Ali Khamenei, who has final say on all state matters, in a speech in August opened the door to talks with the US, saying there is \"no harm\" in engaging with the \"enemy.\"</p>\n\n<p>However, more recently he tempered that, saying that negotiations with America \"are not intelligent, wise or honorable\" after Trump floated nuclear talks with Tehran.</p>\n\n<p>\"Regarding the nuclear negotiations, the position of the Islamic Republic of Iran is very clear. We will not negotiate under pressure, threat or sanctions,\" Iran's Foreign Minister Abbas Araghchi said on Tuesday during a press conference with his Russian counterpart Sergey Lavrov.</p>\n\n<p>Iran's mission at the United Nations in New York did not immediately respond to a request for comment.</p>\n\n<p>IAEA inspectors banned as Iran begins operating more centrifugesIran has maintained its nuclear program is for peaceful purposes only, but IAEA Director General Rafael Mariano Grossi has previously warned that Tehran has enough uranium enriched to near-weapons-grade levels to make \"several\" nuclear bombs if it chose to do so.</p>\n\n<p>Iranian officials have increasingly suggested Tehran could pursue an atomic bomb. US intelligence agencies assess that Iran has yet to begin a weapons program, but has \"undertaken activities that better position it to produce a nuclear device, if it chooses to do so.\"</p>\n\n<p>The IAEA already warned last December that Iran was poised to \"quite dramatically\" increase its stockpile of near weapons-grade uranium as it has started operating cascades of advanced centrifuges.</p>\n\n<p>That move came as a response to the Board of Governors at the IAEA passing a resolution condemning Iran for failing to cooperate fully with the agency. In the past, Iran has repeatedly responded to the board's resolutions by further enhancing its nuclear program.</p>\n\n<p>Wednesday's report also said that Iran has also not reconsidered its September 2023 decision to ban some of the agency's most experienced inspectors from monitoring its nuclear program.</p>\n\n<p>\"The Director General deeply regrets that Iran, despite having indicated a willingness to consider accepting the designation of four additional experienced Agency inspectors, did not accept their designations,\" the report said.</p>\n\n<p>Unanswered questions remain, despite 2023 dealAdditionally, the report says that \"no progress was made towards resolving the outstanding safeguards issues in relations to Varamin and Turquzabad,\" the two locations in Iran where the nuclear watchdog has questions about the origin and location of man-made uranium particles found there.</p>\n\n<p>The report also said that Grossi held telephone discussions with Araghchi at the beginning of this year, during which he \"reiterated his readiness to work with Iran to resume implementation\" of a deal the agency and Tehran agreed two years ago.</p>\n\n<p>The Joint Statement included a pledge by Iran to resolve issues around Varamin and Turquzabad, where inspectors have questions about possible undeclared nuclear activity, and to allow the IAEA to \"implement further appropriate verification and monitoring activities.\"</p>\n\n<p>\"Foreign Minister Araghchi indicated Iran's preparedness to cooperate with the Agency and raised the possibility of the Director General visiting Tehran again,\" the report said.</p>\n\n<p>The IAEA report also said the agency verified that Tehran had increased the number of operating cascades of advanced centrifuges, powerful machines that spin rapidly to enrich uranium. Cascades are clusters of centrifuges.</p>\n\n<p>The report said Iran had increased the number of IR-6 centrifuges by 5 to a total of 7 at its underground nuclear plant at Fordo.</p>\n\n<p>The nuclear watchdog also verified that Iran had increased the number of operating cascades of IR-2m centrifuges by 12 to a total of 27 at its underground nuclear plant in Natanz.</p>\n\n<p>Under the original 2015 nuclear deal, Iran was allowed to enrich uranium to only 3.67% with a limited number of its first-generation centrifuges at the underground Natanz Fuel Enrichment Plant only.</p>\n\n<p>The more advanced model of centrifuges that Iran is using now enrich uranium at a much faster pace than the baseline IR-1 centrifuges.</p>",
        "published": "Thu, 27 Feb 2025 10:34:48 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/iran-speeds-production-of-near-weapons-grade-uranium-as-us-tensions-rise/2063558"
    },
    {
        "title": "Musk and his 'humble tech support' effort get star turn at Trump's Cabinet meeting",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/musk-and-his-humble-tech-support-effort-get-star-turn-at-trumps-cabinet-meeting/2063557",
        "description": "<p>WASHINGTON, D.C. — Elon Musk took a star turn at the first Cabinet meeting of President Donald Trump's new term, holding forth in a black \"Make America Great Again\" campaign hat on Wednesday about his role as \"humble tech support\" for the federal government — and laying out dire stakes if his cost-cutting efforts fail.\"If we don't do this, America will go bankrupt,\" Musk told department heads assembled around a large wooden table in the Cabinet Room.Trump, not one to easily share the spotlight, seemed happy to turn the top of the hour-plus meeting over to Musk for a \"little summary\" of what the Department of Government Efficiency has been up to, saying that Musk's team had found evidence of \"horrible things\" afoot in the government.\"He's sacrificing a lot,\" Trump said of Musk, referencing the time the world's richest man is taking away from his many business ventures. \"He's also getting hit.\"Musk, for his part, said his lightning-fast efforts to right-size the government had drawn death threats and he jokingly knocked his fist on his \"wooden head\" as he said he hoped to find $1 trillion to trim from the federal budget, an effort that has caused extensive disruption among federal workers and those who rely on their services.Musk defended his weekend attempt to require government workers to justify their prior week's work under penalty of termination — a move that drew pushback from many in the room on national security and privacy grounds — as merely a \"pulse check\" to ensure that those working for the government have \"a pulse and two neurons,\" adding that \"this is not a high bar\" for workers to meet.Speculating that some workers are either dead or fictional, Musk added that the goal was to see that workers are real, alive and can \"write an email.\"Asked if members of the Cabinet were happy with Musk, the DOGE guru started to answer the question. But Trump interjected and said he might want to let Cabinet members answer. Then Trump joked that if anyone disagreed, he might \"throw them out.\"That drew applause from Cabinet members.Trump then turned things back to Musk, who said the president had \"put together, I think, the best Cabinet ever.\"\"And I don't give false praise,\" he added.Musk did volunteer that his efforts to slash government spending would \"make mistakes.\"He cited as an example that, while hustling to dramatically shrink the US Agency for International Development, \"One of the things we accidentally canceled very briefly was Ebola prevention.\" Musk insisted that \"there was no interruption\" in services before the funding was restored.But a USAID official said Wednesday that no funds for the agency's Ebola response had been released under President Donald Trump's Jan. 20 funding freeze for foreign aid, including for efforts to combat the spread of the deadly virus.After about 15 minutes of focus on Musk and DOGE, Trump shifted the spotlight of the Cabinet meeting back to his own accomplishments in his first weeks in office.The Cabinet sat mostly silently for more than an hour, as Trump opened the floor to questions from an invited group of reporters.Asked if he expected his Cabinet to follow his directives without exception, Trump initially scoffed at the question before answering, \"of course, no exceptions.\"</p>",
        "published": "Thu, 27 Feb 2025 10:28:53 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/musk-and-his-humble-tech-support-effort-get-star-turn-at-trumps-cabinet-meeting/2063557"
    },
    {
        "title": "The Trump administration sets the stage for large-scale federal worker layoffs in a new memo",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/the-trump-administration-sets-the-stage-for-large-scale-federal-worker-layoffs-in-a-new-memo/2063555",
        "description": "<p>WASHINGTON, D.C. — The US government is facing a generational realignment as President Donald Trump directs federal agencies to develop plans for eliminating employee positions and consolidating programs.</p>\n\n<p>Senior officials set the downsizing in motion on Wednesday with a memo that dramatically expands Trump's efforts to scale back a workforce described as an impediment to his agenda. Thousands of probationary employees have already been fired, and now the Republican administration is turning its attention to career officials with civil service protection.</p>\n\n<p>\"We're cutting down the size of government. We have to,\" Trump said during the first Cabinet meeting of his second term. \"We're bloated. We're sloppy. We have a lot of people that aren't doing their job.\"</p>\n\n<p>The ripple effects will be felt around the country. Roughly 80% of federal workers live outside the Washington area, and government services — patent approvals, food inspections, park maintenance and more — could be hindered depending on how cuts are handled.</p>\n\n<p>Resistance is expected. Labor unions, Democratic state leaders and other organizations have tried, with some success, to slow Trump down with litigation, while Republicans are growing more concerned about how a slash-and-burn strategy could affect their constituents.</p>\n\n<p>\"Once you do this damage, it's going to be incredibly hard to rebuild the capacity of these organizations,\" said Don Moynihan, a public policy professor at the University of Michigan. \"It's not like you can turn the switch back on and everything is going to be the way it was before.\"</p>\n\n<p>Agencies are directed to submit by March 13 their plans for what is known as a reduction in force, which would not only lay off employees but eliminate the position altogether. The result could be extensive changes in how government functions.</p>\n\n<p>No specific targets for cutbacks were included in the memo. However, as an example, Trump said the Environmental Protection Agency could reduce its staff by 65%.</p>\n\n<p>More plans are due on April 14, when agencies are expected to outline how they will consolidate management, become more efficient and potentially relocate offices to parts of the country that are less expensive than Washington. The memo said agencies have a Sept. 30 deadline for implementation.</p>\n\n<p>Administration officials framed their effort as a cost-saving measure with a clear ideological goal.</p>\n\n<p>\"The federal government is costly, inefficient, and deeply in debt. At the same time, it is not producing results for the American public,\" said the memo from Russell Vought, director of the White House's Office of Management and Budget, and Charles Ezell, acting director of the Office of Personnel Management, which functions as a human resources agency. \"Instead, tax dollars are being siphoned off to fund unproductive and unnecessary programs that benefit radical interest groups while hurting hard-working American citizens.\"</p>\n\n<p>Vought was an author of Project 2025, a conservative blueprint for Trump's second term, and he has advocated for centralizing power under the presidency and dismantling federal bureaucracy.</p>\n\n<p>\"We're not going to save our country without a little confrontation,\" Vought said last summer during a podcast hosted by Trump ally Stephen Bannon.</p>\n\n<p>Moynihan described the memo as a \"backdoor way\" of reducing the size of government since Congress hasn't passed any legislation to cut programs.</p>\n\n<p>\"There's a fundamental realignment of power here,\" he said. \"This administration is saying we have much more power than any previous administration when it comes to deciding how government works.\"</p>\n\n<p>Kevin Owen, an employment lawyer who represents federal workers, compared the administration's initiative to the kind of disruptions that are caused by government shutdowns during congressional budget standoffs.</p>\n\n<p>\"This looks like a plan for a significant and shocking reduction of the federal workforce that I don't think the American people are prepared for,\" Owen said. \"It's going to cripple a lot of government functions.\"</p>\n\n<p>He said that Trump and his allies were focusing on speed rather than precision as they overhaul the government.</p>\n\n<p>\"Their plan is to do the damage and get sued,\" he said. If a court ultimately rules against them, \"by that point, they would have gotten what they wanted in interim.\"</p>\n\n<p>Trump foreshadowed the effort in a recent executive order that he signed with Elon Musk, the billionaire entrepreneur who oversees the so-called Department of Government Efficiency, known as DOGE. The order said agency leaders \"shall promptly undertake preparations to initiate large-scale reductions in force,\" or RIF.</p>\n\n<p>Some departments have already begun this process. The General Services Administration, which handles federal real estate, told employees on Monday that a reduction in force was underway and they would do \"everything in our power to make your departure fair and dignified.\"</p>\n\n<p>Law enforcement, national security, public safety, military positions and US Postal Service positions are exempt.</p>\n\n<p>The memo was released shortly before Trump convened Cabinet officials as well as Musk, who attended the meeting wearing a black \"Make America Great Again\" campaign hat.</p>\n\n<p>Musk described himself during the meeting as \"humble tech support\" for the federal government, and he talked about his cost-cutting crusade in existential terms.</p>\n\n<p>\"If we don't do this, America will go bankrupt,\" he said.</p>\n\n<p>Musk has caused turmoil within the federal workforce, most recently by demanding that employees justify their jobs or risk getting fired. OPM later said that the edict was voluntary, although workers could face similar requests in the future.</p>\n\n<p>He described his request as a \"pulse check.\"</p>\n\n<p>\"Are these people real? Are they alive? And can they write an email?\" he said.</p>\n\n<p>Before the meeting, White House press secretary Karoline Leavitt told reporters that \"all of the Cabinet secretaries take the advice and direction of DOGE.\"</p>\n\n<p>Musk's operation became more powerful on Wednesday with a new executive order signed by Trump. He directed agencies to develop new systems for distributing and justifying payments so they could be monitored by DOGE representatives. Employee travel is being limited and agency credit cards are being frozen unless they're used for disaster relief or supervisors create an exception.</p>\n\n<p>The order said government workers must be \"accountable to the American public.\"</p>",
        "published": "Thu, 27 Feb 2025 10:20:21 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/the-trump-administration-sets-the-stage-for-large-scale-federal-worker-layoffs-in-a-new-memo/2063555"
    },
    {
        "title": "Trump administration says it's cutting 90% of USAID foreign aid contracts",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/trump-administration-says-its-cutting-90-of-usaid-foreign-aid-contracts/2063553",
        "description": "<p>WASHINGTON, D.C. — The Trump administration said Wednesday it is eliminating more than 90% of the US Agency for International Development's foreign aid contracts and $60 billion in overall US assistance around the world, putting numbers on its plans to eliminate the majority of US development and humanitarian help abroad.</p>\n\n<p>The cuts detailed by the administration would leave few surviving USAID projects for advocates to try to save in what are ongoing court battles with the administration.</p>\n\n<p>The Trump administration outlined its plans in both an internal memo obtained by The Associated Press and filings in one of those federal lawsuits Wednesday.</p>\n\n<p>Wednesday's disclosures also give an idea of the scale of the administration's retreat from US aid and development assistance overseas, and from decades of US policy that foreign aid helps US interests by stabilizing other countries and economies and building alliances.</p>\n\n<p>The memo said officials were \"clearing significant waste stemming from decades of institutional drift.\" More changes are planned in how USAID and the State Department deliver foreign assistance, it said.</p>\n\n<p>President Donald Trump and ally Elon Musk have hit foreign aid harder and faster than almost any other target in their push to cut the size of the federal government. Both men say USAID projects advance a liberal agenda and are a waste of money.</p>\n\n<p>Trump on Jan. 20 ordered what he said would be a 90-day program-by-program review of which foreign assistance programs deserved to continue, and cut off all foreign assistance funds almost overnight.</p>\n\n<p>The funding freeze has stopped thousands of US-funded programs abroad, and the administration and Musk's Department of Government Efficiency teams have pulled the majority of USAID staff off the job through forced leave and firings.</p>\n\n<p>In the federal court filings Wednesday, nonprofits owed money on contracts with USAID describe both Trump political appointees and members of Musk's teams terminating USAID's contracts around the world at breakneck speed, without time for any meaningful review, they say.</p>\n\n<p>\"'There are MANY more terminations coming, so please gear up!''' a USAID official wrote staff Monday, in an email quoted by lawyers for the nonprofits in the filings.</p>\n\n<p>The nonprofits, among thousands of contractors, owed billions of dollars in payment since the freeze began, called the en masse contract terminations a maneuver to get around complying with the order to lift the funding freeze temporarily.</p>\n\n<p>So did a Democratic lawmaker.</p>\n\n<p>\"The administration is brazenly attempting to blow through Congress and the courts by announcing the completion of their sham 'review' of foreign aid and the immediate termination of thousands of aid programs all over the world,\" said Connecticut Sen. Chris Murphy, a member of the Senate Foreign Relations Committee.</p>\n\n<p>The State Department said Secretary of State Marco Rubio had reviewed the terminations.</p>\n\n<p>In all, the Trump administration said it will eliminate 5,800 of 6,200 multiyear USAID contract awards, for a cut of $54 billion. Another 4,100 of 9,100 State Department grants were being eliminated, for a cut of $4.4 billion.</p>\n\n<p>The State Department memo, which was first reported by the Washington Free Beacon, described the administration as spurred by a federal court order that gave officials until the end of the day Wednesday to lift the Trump administration's monthlong block on foreign aid funding.</p>\n\n<p>\"In response, State and USAID moved rapidly,\" targeting USAID and State Department foreign aid programs in vast numbers for contract terminations, the memo said.</p>\n\n<p>The Trump administration asked the Supreme Court to intervene Wednesday night as an appeals court refused to lift the midnight deadline.</p>\n\n<p>Trump administration officials — after repeated warnings from the federal judge in the case — also said Wednesday they were finally beginning to send out their first or any payments after more than a month with no known spending. Officials were processing a few million dollars of back payments, officials said, of billions of dollars owed to US and international organizations and companies.</p>",
        "published": "Thu, 27 Feb 2025 10:16:33 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/trump-administration-says-its-cutting-90-of-usaid-foreign-aid-contracts/2063553"
    },
    {
        "title": "India's grand Hindu festival ends",
        "link": "https://www.manilatimes.net/2025/02/27/world/asia-oceania/indias-grand-hindu-festival-ends/2062972",
        "description": "<p>PRAYAGRAJ, India — India's Kumbh Mela festival concluded on Wednesday, with final ritual river bathing ceremonies ending six weeks of celebration that organizers say have been attended by hundreds of millions of devotees.</p>\n\n<p>Despite two deadly stampedes that killed dozens, the festival in the northern city of Prayagraj has been hailed as a triumph by Prime Minister Narendra Modi's Hindu nationalist party, bolstering its carefully cultivated image as a steward of Hindu resurgence and national prosperity.</p>\n\n<p>Both Modi and his ally, firebrand Hindu monk Yogi Adityanath — chief minister of India's most populous state of Uttar Pradesh, where the festival is held — say the millennia-old festival has been the \"grandest\" yet.</p>\n\n<p>The Kumbh Mela is rooted in Hindu mythology, a battle between deities and demons for control of a pitcher containing the nectar of immortality.</p>\n\n<p>The festival, which opened on Jan. 13, ends Wednesday, coinciding with the Hindu festival of Maha Shivratri, in honor of the deity Shiva.</p>\n\n<p>According to eyebrow-raising figures from Adityanath's state government, more than 620 million devotees took part in the festival, a staggering statistic even for the world's most populous nation of 1.4 billion people.</p>\n\n<p>Millions more people seeking salvation are expected to shrug off stomach-churning fecal matter measurements to immerse themselves in sacred river waters on Wednesday.</p>\n\n<p>Authorities say the estimates have been calculated using artificial intelligence and surveillance cameras, but the figures are impossible to independently verify.</p>\n\n<p>The festival was marred by a deadly stampede on Jan. 29 that killed at least 30 people and injured 90 others.</p>\n\n<p>Officials insisted for hours that no one was seriously injured, despite graphic television footage from the scene.</p>\n\n<p>Earlier this month, another 18 people died during a stampede at the main railway station in New Delhi when surging crowds scrambled to catch trains to Prayagraj.</p>\n\n<p>The deaths have taken the sheen off the government's claims of stellar management of the event.</p>\n\n<p>But the twin tragedies failed to deter millions who continued to pour into the temporary township along the banks of the river.</p>",
        "published": "Thu, 27 Feb 2025 00:23:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/asia-oceania/indias-grand-hindu-festival-ends/2062972"
    },
    {
        "title": "Taiwan deploys forces after China's live fire drills",
        "link": "https://www.manilatimes.net/2025/02/27/world/asia-oceania/taiwan-deploys-forces-after-chinas-live-fire-drills/2062971",
        "description": "<p>TAIPEI — Taiwan dispatched forces on Wednesday in response to China's \"live-fire\" drills off the self-ruled island, Taipei's defense ministry said, condemning the exercises as dangerous.</p>\n\n<p>China deployed 32 aircraft around Taiwan as part of a joint combat drill and announced \"live-fire exercises\" in an area about 74 kilometers off the island's south, the ministry said in a statement.</p>\n\n<p>Taiwan's military responded by sending sea, air and land forces to \"monitor, alert and respond appropriately,\" the statement said.</p>\n\n<p>China's People's Liberation Army \"has blatantly violated international norms by unilaterally designating a drill zone off the coast of Kaohsiung and Pingtung, claiming to conduct live-fire exercises without prior warning,\" the ministry said.</p>\n\n<p>\"This move not only caused a high degree of danger to the safety of international flights and vessels at sea, but is also a blatant provocation to regional security and stability.\"</p>\n\n<p>China has ramped up the deployment of fighter jets and warships around Taiwan in recent years to press its claim of sovereignty over the island — which Taipei rejects.</p>\n\n<p>The defense ministry said the live-fire exercises come after China held similar drills off Vietnam and Australia, and \"prove that China is the only and biggest threat to peace and stability in the Taiwan Strait and the Indo-Pacific region.\"</p>\n\n<p>The drills also come after Taiwan on Tuesday seized a Chinese-crewed cargo ship suspected of severing a subsea telecoms cable serving Taiwan's Penghu island group.</p>\n\n<p>There is growing concern in Taiwan over the security of its cables after a Chinese-owned cargo ship was suspected of cutting one northeast of the island this year.</p>\n\n<p>China has threatened to use force to bring Taiwan under its control.</p>\n\n<p>Taiwan fears China could sever its communication links as part of an attempt to seize the island or blockade it.</p>\n\n<p>Taiwan is a potential flashpoint for a war between China and the United States, which is the island's most important backer and biggest arms supplier.</p>\n\n<p>While the United States is legally bound to provide arms to Taiwan, Washington has long maintained \"strategic ambiguity\" when it comes to whether it would deploy its military to defend the island from a Chinese attack.</p>\n\n<p>Despite strong bipartisan support in the US Congress for Taiwan, there are fears that US President Donald Trump might not consider the island worth defending if China attacked.</p>\n\n<p>Taiwan leader Lai Ching-te has already vowed to boost investment in the United States to reduce the trade imbalance and spend more on the island's military, while his government is also considering increasing US natural gas imports.</p>",
        "published": "Thu, 27 Feb 2025 00:22:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/asia-oceania/taiwan-deploys-forces-after-chinas-live-fire-drills/2062971"
    },
    {
        "title": "Nauru sells citizenship for climate change efforts",
        "link": "https://www.manilatimes.net/2025/02/27/world/asia-oceania/nauru-sells-citizenship-for-climate-change-efforts/2062970",
        "description": "<p>SYDNEY, Australia — Pacific microstate Nauru is selling citizenship to fund its retreat from rising seas, President David Adeang told AFP, opening a contentious \"golden passport\" scheme as other climate financing runs dry.</p>\n\n<p>The low-lying island nation of around 13,000 residents is planning a mass inland relocation as creeping seas start to eat away at its fertile coastal fringe.</p>\n\n<p>It will drum up funding by selling passports to foreigners for $105,000 each, despite fears such schemes are ripe for criminal exploitation.</p>\n\n<p>\"For Nauru it is not just about adapting to climate change, but about securing a sustainable and prosperous future for generations to come,\" Adeang said.</p>\n\n<p>\"This is about more than survival. It is about ensuring future generations have a safe, resilient and sustainable home. We are ready for the journey ahead.\"</p>\n\n<p>The island republic sits on a small plateau of phosphate rock in the sparsely populated South Pacific.</p>\n\n<p>With a total landmass of just 21 square kilometers, it is one of the world's smallest nations.</p>\n\n<p>Unusually pure phosphate deposits — a key ingredient in fertilizer — once made Nauru one of the wealthiest places, per capita, on the planet.</p>\n\n<p>But these supplies have long dried up, and researchers today estimate 80 percent of Nauru has been rendered uninhabitable by mining.</p>\n\n<p>What little land Nauru has left is threatened by encroaching tides — scientists have measured sea levels rising 1.5 times faster than global averages.</p>\n\n<p>Golden passports</p>\n\n<p>Existing climate funding efforts are \"not sufficient\" to address the challenge, said Edward Clark, who runs Nauru's new Economic and Climate Resilience Citizenship Program.</p>\n\n<p>\"Debt financing places an undue burden on future generations and there is not enough aid,\" he told AFP.</p>\n\n<p>Nauru's government expects to reap $5.7 million in the program's first year, equating to around 66 successful applications, Clark said.</p>\n\n<p>It hopes this will gradually increase to $43 million — or about 500 successful applications — which would account for almost 20 percent of total government revenue.</p>\n\n<p>Nauru officials believe 90 percent of the population will eventually need to move to higher ground.</p>\n\n<p>The first phase of this mass relocation is estimated to cost more than $60 million.</p>\n\n<p>To pay the bill, Nauru has pinned its hopes on the new citizenship-by-investment program.</p>\n\n<p>\"It is well known that developing climate-vulnerable countries are disproportionately impacted by climate change, and there is therefore an urgent need to ensure they disproportionately benefit from climate innovation,\" he said.</p>\n\n<p>Nations such as Nauru \"have both a need and a right to be prosperous,\" Clark added.</p>\n\n<p>Nauru claims its passport will provide visa-free entry into 89 countries, including the United Kingdom, Ireland, United Arab Emirates and Hong Kong.</p>\n\n<p>A 'pioneering' fix?</p>\n\n<p>More than 60 different nations offer some form of migration for investment schemes, Australia's Lowy Institute has found.</p>\n\n<p>Pacific nations such as Vanuatu, Samoa and Tonga have all dabbled in selling passports, according to the think tank.</p>\n\n<p>A previous Nauru attempt to sell passports ended in disaster.</p>\n\n<p>In 2003, Nauru officials sold citizenship to al-Qaida members who were later arrested in Asia, according to Australian broadcaster ABC.</p>\n\n<p>Clark said this time Nauru would only offer passports to like-minded investors that passed \"the strictest and most thorough due diligence procedures.\"</p>",
        "published": "Thu, 27 Feb 2025 00:21:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/asia-oceania/nauru-sells-citizenship-for-climate-change-efforts/2062970"
    },
    {
        "title": "Cook Islands PM overcomes no-confidence vote",
        "link": "https://www.manilatimes.net/2025/02/27/world/asia-oceania/cook-islands-pm-overcomes-no-confidence-vote/2062966",
        "description": "<p>SYDNEY, Australia — The Cook Islands' prime minister survived a no-confidence vote Wednesday, blaming \"misinformation\" from former colonial ruler New Zealand for destabilizing his Pacific country.</p>\n\n<p>The parliament voted 13-to-9 against the motion of no-confidence in Prime Minister Mark Brown's government, sparked by a partnership deal he signed with Beijing.</p>\n\n<p>The agreement, sealed during a state visit to China this month, irked New Zealand's government and worried some Cook Islanders keen to maintain close ties with Wellington.</p>\n\n<p>Brown said New Zealand media had sold short his consultation with Wellington on the China accord, as well as overblowing his now-defunct plan for a \"symbolic\" Cook Islands passport.</p>\n\n<p>\"This constant media barrage, Mr. Speaker, has now led to destabilization in our country,\" he told parliament.</p>\n\n<p>\"This motion of no confidence has been built on misinformation.\"</p>\n\n<p>The self-governing Cook Islands, a country of 17,000 people, has a \"free association\" relationship with New Zealand, which provides budgetary assistance as well as helping on foreign affairs and defense.</p>\n\n<p>Its people hold New Zealand citizenship.</p>\n\n<p>New Zealand has alleged a lack of consultation and transparency from the Cook Islands government over the five-year \"action plan\" for a comprehensive strategic partnership that was signed with Premier Li Qiang.</p>\n\n<p>Brown said his government had consulted \"for months\" with Wellington about the agreement.</p>\n\n<p>\"But the messaging that goes out is that we never consult.\"</p>\n\n<p>The Cook Islands had also given assurances that the passport proposal — meant as a \"symbolic passport of identity,\" not a travel document — was now \"a dead matter,\" he said.</p>\n\n<p>Wellington, \"through its New Zealand media,\" had still repeatedly made clear it was unhappy with \"how we are expressing our self-determination.\"</p>\n\n<p>\"It becomes very clear this is not about consultation. This is about control,\" Brown said.</p>\n\n<p>\"We never once talked to the New Zealand government about cutting our ties with New Zealand, but the message that our people received is that we are cutting our ties with New Zealand.\"</p>\n\n<p>The Cook Islands' leader took a shot at New Zealand Foreign Minister Winston Peters for urging a \"reset\" in ties in a speech last week, citing \"challenges in the government-to-government relationship.\"</p>\n\n<p>\"He has made this announcement without talking to me or any of our officials at all,\" Brown said.</p>\n\n<p>\"We are being spoken to, rather than spoken with, on a matter as important and fundamental as our free association relationship.\"</p>\n\n<p>A spokesperson for New Zealand's foreign minister said members of the Cook Islands parliament had the absolute right of free speech.</p>",
        "published": "Thu, 27 Feb 2025 00:20:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/asia-oceania/cook-islands-pm-overcomes-no-confidence-vote/2062966"
    },
    {
        "title": "China's Xi calls for 'calm' response to challenges",
        "link": "https://www.manilatimes.net/2025/02/27/world/asia-oceania/chinas-xi-calls-for-calm-response-to-challenges/2062788",
        "description": "<p>(UPDATE) BEIJING — Chinese President Xi Jinping told top officials on Wednesday that Beijing should address domestic and international difficulties \"calmly,\" one week before the country's biggest annual political gathering.</p>\n\n<p>The world's second-largest economy is facing down sluggish internal demand and a protracted property sector crisis, as well as the possibility of a deepening trade war with the United States after US President Donald Trump took office.</p>\n\n<p>Xi's comments were in response to a 2024 work report submitted by officials, which he \"earnestly reviewed ... and put forward important requirements,\" state news agency Xinhua said.</p>\n\n<p>This year, \"we must enhance our political capabilities, calmly respond to challenges brought about by changes in the domestic and international situation (and) adhere to the general key of working to seek progress while maintaining stability,\" Xi said, according to Xinhua.</p>\n\n<p>Xi added that leaders must work to \"promote the sustained recovery of the economy, steadily improve people's living standards, and ensure stability in the overall social situation.\"</p>\n\n<p>China is set to convene its largest annual political gathering in Beijing next week.</p>\n\n<p>Known as the \"Two Sessions,\" the event is centered upon plenary sessions of the National People's Congress and a top political advisory body.</p>\n\n<p>Observers will be closely watching this year's gathering for signs of more robust policy support for the economy, which has struggled to achieve a full recovery since the Covid pandemic.</p>",
        "published": "Thu, 27 Feb 2025 00:19:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/asia-oceania/chinas-xi-calls-for-calm-response-to-challenges/2062788"
    },
    {
        "title": "US, Ukraine agree to minerals accord terms",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/us-ukraine-agree-to-minerals-accord-terms/2062635",
        "description": "<p>(UPDATE) LONDON/WASHINGTON — The US and Ukraine have agreed on the terms of a draft minerals deal central to Kyiv's push to win Washington's support as President Donald Trump seeks to rapidly end the war with Russia, two sources with knowledge of the matter said on Tuesday.</p>\n\n<p>A source familiar with the contents of the draft agreement said that it does not specify any US security guarantees or continued flow of weapons but says that the United States wants Ukraine to be \"free, sovereign and secure.\"</p>\n\n<p>One of the sources familiar with the deal said future weapons shipments are still being discussed between Washington and Kyiv.</p>\n\n<p>Trump told reporters that Ukrainian President Volodymyr Zelenskyy wants to come to Washington on Friday to sign a \"very big deal.\"</p>\n\n<p>This came after the two leaders exchanged hostile words last week.</p>\n\n<p>The US president, who has cast the deal as a repayment for billions of dollars in aid to Kyiv, also said some form of peacekeeping troops are needed in Ukraine if an agreement to end the conflict is struck.</p>\n\n<p>Moscow, which launched an invasion of Ukraine three years ago, has refused to accept any deployment of NATO forces.</p>\n\n<p>Trump's rush to impose an end to Russia's war in Ukraine and his lurch toward Moscow have stoked fears of far-reaching US concessions to Russian President Vladimir Putin that could undermine security in Ukraine and Europe and alter the geopolitical landscape.</p>\n\n<p>Officials on both sides have agreed to the draft and advised it should be signed, the sources said.</p>\n\n<p>Money back for taxpayers</p>\n\n<p>The deal could open up Ukraine's vast mineral wealth to the US.</p>\n\n<p>\"What we're doing is now we're saying, look, we want to be secured,\" Trump said. \"The American taxpayer now is going to get their money back, plus.\"</p>\n\n<p>Zelenskyy refused to sign an earlier draft of a minerals agreement as Washington sought rights to $500 billion in Ukraine's natural wealth.</p>\n\n<p>Kyiv protested it had received far less than that in US aid, and the deal lacked the security guarantees Ukraine needs.</p>\n\n<p>Under the terms of a draft minerals agreement, according to sources familiar with its contents, the United States and Ukraine would establish a Reconstruction Investment Fund to collect and reinvest revenues from Ukrainian sources, including minerals, hydrocarbons, and other extractable materials.</p>\n\n<p>Ukraine would contribute to the fund 50 percent of the revenue minus operating expenses and continue until the contributions reach the sum of $500 billion.</p>\n\n<p>The United States would provide a long-term financial commitment to the development of a \"stable and economically prosperous Ukraine.\"</p>\n\n<p>Asked what Ukraine would get in return for the minerals deal, Trump cited what he said was $350 billion already provided by the US \"and lots of... military equipment and the right to fight on.\"</p>\n\n<p>European allies scramble</p>\n\n<p>\"I hear that he's coming on Friday,\" Trump told reporters. \"Certainly, it's okay with me if he'd like to. And he would like to sign it together with me.\"</p>\n\n<p>European officials have been left flat-footed by Trump's decisions to hold talks on ending the war in Ukraine with Russia, spurning both Kyiv and Europe, and by his administration's warning that the US was no longer primarily focused on Europe's security.</p>\n\n<p>A White House meeting could give Zelenskyy a chance to make his case for continued US support directly to Trump, who last week falsely accused Kyiv of starting the war.</p>\n\n<p>Ukraine has deposits of 22 of the 34 minerals identified by the European Union as critical, according to Ukrainian data.</p>\n\n<p>They include industrial and construction materials, ferroalloy, precious and non-ferrous metals, and some rare earth elements.</p>\n\n<p>Ukraine's reserves of graphite, a key component in electric vehicle batteries and nuclear reactors, represent 20 percent of global resources.</p>",
        "published": "Thu, 27 Feb 2025 00:18:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/us-ukraine-agree-to-minerals-accord-terms/2062635"
    },
    {
        "title": "Trump plans to sell 'gold card' visas for $5M",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/trump-plans-to-sell-gold-card-visas-for-5m/2062896",
        "description": "<p>WASHINGTON — US President Donald Trump disclosed plans Tuesday to sell new \"gold card\" residency permits for a price of $5 million each — and said Russian oligarchs may be eligible.</p>\n\n<p>Trump said sales of the new visa, a high-priced version of the traditional green card, would bring in job creators and could be used to reduce the US national deficit.</p>\n\n<p>\"We're going to be selling a gold card. You have a green card; this is a gold card. We're going to be putting a price on that card of about $5 million,\" Trump told reporters in the Oval Office.</p>\n\n<p>The Republican president, who has made the deportation of millions of undocumented migrants a priority of his second term, said the new card would be a route to highly prized US citizenship.</p>\n\n<p>\"A lot of people are going to want to be in this country, and they'll be able to work and provide jobs and build companies,\" Trump said.</p>\n\n<p>\"It'll be people with money.\"</p>\n\n<p>Sales of the cards would start in about two weeks, Trump added.</p>\n\n<p>\"We'll be able to sell maybe a million of these cards. We have it all worked out from a legal standpoint,\" Trump added.</p>\n\n<p>The billionaire former real estate tycoon said that all applicants for the new gold cards would be carefully vetted.</p>\n\n<p>But asked if wealthy Russians would also be able to apply, Trump said it was a possibility.</p>\n\n\n\n\n\n\n\n<p>\"Possibly. I know some Russian oligarchs that are very nice people. It's possible,\" Trump said. \"They're not as wealthy as they used to be. I think they can. I think they can afford $5 million.\"</p>\n\n<p>A number of Russian oligarchs have been hit by western sanctions since Moscow's invasion of Ukraine three years ago.</p>\n\n<p>Trump has caused shock in European capitals by suddenly opening negotiations with Russia to end the war, amid fears that he could be willing to sell Ukraine short.</p>\n\n<p>The US president told reporters that lifting sanctions on Russia was possible \"at some point\" but was not currently on the table.</p>\n\n<p>US Commerce Secretary Howard Lutnick, standing at Trump's side in the Oval Office, said of the gold cards that \"we can use that money to reduce our deficit.\"</p>\n\n<p>Trump, who has branded a series of hotels and casinos in a long business career, even suggested the new cards could also be named after him.</p>\n\n<p>\"Somebody said, 'Can we call it the Trump gold card?' I said, 'If it helps, use the name Trump,'\" he said.</p>",
        "published": "Thu, 27 Feb 2025 00:17:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/trump-plans-to-sell-gold-card-visas-for-5m/2062896"
    },
    {
        "title": "Power back in most Chile homes after blackout",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/power-back-in-most-chile-homes-after-blackout/2062894",
        "description": "<p>SANTIAGO — Authorities in Chile said they restored power to most homes on Wednesday, hours after a massive, rare blackout caused transport chaos in the capital and forced the president to declare a state of emergency and curfew across much of the country.</p>\n\n<p>Chile's worst blackout in well over a decade struck on Tuesday afternoon, leaving millions without power.</p>\n\n<p>President Gabriel Boric blamed private companies that manage the grid for the system's failure.</p>\n\n<p>\"This is outrageous! The daily life of millions of Chileans can't be impacted like this by companies that don't do their job,\" Boric said in a statement issued by his office.</p>\n\n<p>Early Wednesday, \"90 percent of (electricity) consumption was restored\" to homes, the power system's operator said in a statement.</p>\n\n<p>According to the Senapred disaster response agency, the outage affected an area stretching all the way from Arica in the long, narrow South American country's north to Los Lagos in the south — an area home to over 90 percent of Chile's 20 million people.</p>\n\n<p>The blackout disrupted transport in the capital Santiago, where thousands were evacuated from the metro and people jostled to board overflowing buses.</p>\n\n<p>President Boric had activated \"a state of emergency due to a catastrophe\" and announced a curfew until 6 a.m. Wednesday.</p>\n\n<p>Attack ruled out</p>\n\n<p>Interior Minister Carolina Toha ruled out sabotage as the reason for the power loss, which began at 3:16 p.m. in the middle of the southern hemisphere summer.</p>\n\n<p>\"There is no reason to assume that this is an attack,\" she said on Tuesday, telling reporters it was more likely \"a failure in the system's operation.\"</p>\n\n<p>The metro company, which transports 2.3 million passengers every day, said workers were deployed to all stations \"to support safe evacuations.\"</p>\n\n<p>Out-of-service traffic lights caused major gridlock, with some people having to walk for hours under a hot sun to reach their homes.</p>\n\n<p>Shops and offices closed early.</p>\n\n<p>Dramatic rescues</p>\n\n<p>The Chilevision broadcaster showed video of people trapped on a mechanical ride several meters high at an amusement park in Santiago before being rescued.</p>\n\n<p>An AFP photographer saw firefighters rescue a distraught elderly woman, who had been trapped inside an elevator.</p>\n\n<p>The country's hospital system and prisons were operating on emergency generators.</p>\n\n<p>Boric flew over the capital by helicopter to assess the situation.</p>\n\n<p>In the coastal city of Valparaiso, witnesses also reported shops and businesses closing early and traffic chaos.</p>\n\n<p>Chile boasts one of the best power networks in South America and has not had a blackout this big in about 15 years.</p>",
        "published": "Thu, 27 Feb 2025 00:16:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/power-back-in-most-chile-homes-after-blackout/2062894"
    },
    {
        "title": "Israel agrees to release 600 Palestinian prisoners",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/israel-agrees-to-release-600-palestinian-prisoners/2062893",
        "description": "<p>JERUSALEM — Israel has agreed to release Palestinian prisoners, who were due to be freed last week in exchange for the bodies of four Israeli hostages, Egyptian state-linked media reported, as Washington's top Middle East envoy said talks for a second phase of a Gaza ceasefire deal remained on track.</p>\n\n<p>Palestinian militant group Hamas late Tuesday confirmed the release agreement, negotiated under Egyptian supervision.</p>\n\n<p>In Washington, US President Donald Trump's point person on the Middle East said Israeli representatives were already en route to talks on the next phase of the ceasefire deal.</p>\n\n<p>\"We're making a lot of progress. Israel is sending a team right now as we speak,\" Steve Witkoff told an event for the American Jewish Committee.</p>\n\n<p>\"It's either going to be in Doha or in Cairo, where negotiations will begin again with the Egyptians and the Qataris,\" he said.</p>\n\n<p>This first phase is supposed to end on Saturday, but negotiations planned for the rest of the process — which were to begin in early February — have not started.</p>\n\n<p>Hamas has said it is ready to release \"in one go\" all the hostages remaining during the second phase.</p>\n\n<p>On Sunday, the group accused Israel of endangering the Gaza truce by delaying the release of 600 Palestinian prisoners.</p>\n\n<p>'Dignified swaps'</p>\n\n<p>Israel justified the delay by citing concerns over how the hostages have been freed, with Prime Minister Benjamin Netanyahu describing the process as \"humiliating ceremonies.\"</p>\n\n<p>Since the ceasefire took effect on Jan. 19, Hamas has freed 25 Israeli hostages in public ceremonies across Gaza, where masked, armed fighters have escorted the captives onto stages decorated with slogans.</p>\n\n<p>Israel has released over 1,100 Palestinian prisoners.</p>\n\n<p>The International Committee of the Red Cross has urged all parties to carry out prisoner and hostage swaps \"in a dignified and private manner.\"</p>\n\n<p>Given the nature of the deep-rooted Israeli-Palestinian conflict, prisoner releases from Israeli jails are highly controversial.</p>\n\n<p>In Israel, the prisoners are largely viewed as \"terrorists\" for the violent attacks they have carried out against civilians and security forces.</p>\n\n<p>The Israeli authorities and much of the public see their imprisonment as a necessary measure to prevent further attacks.</p>\n\n<p>For Palestinians, however, the releases are viewed as long-delayed justice, with the prisoners often regarded as symbols of resistance against the Israeli occupation.</p>\n\n<p>Ceasefire holds</p>\n\n<p>Both sides have accused each other of violating the ceasefire, but it has so far held.</p>\n\n<p>Israel vowed to destroy Hamas after its Oct. 7, 2023 attack, and has made bringing back all hostages seized that day one of its war objectives.</p>\n\n<p>In Israel, hundreds of people attended the funeral Tuesday of hostage Oded Lifshitz, a peace activist and former journalist who died in captivity and whose body was returned last week.</p>\n\n<p>Three other Israelis kidnapped in Nir Oz — Shiri Bibas, 32, and her two boys, Ariel and Kfir, ages four and eight and a half months respectively — will be buried on Wednesday.</p>\n\n<p>Alongside the Gaza war — which displaced almost the enclave's entire population of 2.4 million — Israel has intensified its military operations in the West Bank.</p>",
        "published": "Thu, 27 Feb 2025 00:15:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/israel-agrees-to-release-600-palestinian-prisoners/2062893"
    },
    {
        "title": "UN, aid groups warn Haiti unrest rising",
        "link": "https://www.manilatimes.net/2025/02/27/world/americas-emea/un-aid-groups-warn-haiti-unrest-rising/2062892",
        "description": "<p>PORT-AU-PRINCE — Haiti has seen a \"wave of extreme brutality\" in recent weeks, with numerous killings and thousands forced to flee their homes, a consortium of UN agencies, NGOs and donors warned.</p>\n\n<p>\"Entire families have been brutally wiped out in their homes, while others, including children and babies, have been shot dead as they tried to escape,\" the group, organized by the United Nations Office for the Coordination of Humanitarian Affairs, said in a statement Monday.</p>\n\n<p>Gangs control large portions of Haiti, including the majority of the capital, and violence has soared despite the arrival of hundreds of police personnel as part of a Kenya-led multinational security support mission (MSS).</p>\n\n<p>\"We are deeply alarmed and dismayed by the unacceptable and inhuman intensity of the violence raging in Haiti, a wave of extreme brutality which, since the end of January, has resulted in the loss of many lives,\" the group said.</p>\n\n<p>It said 4,000 people had been forced to flee the Kenscoff area of the capital, along with 2,000 more from the Delmas, Port-au-Prince and Petion-ville municipalities.</p>\n\n<p>The group called on \"all parties involved in this violence to break this cycle of terror and put an end to this uncontrolled spiral.\"</p>\n\n<p>Fresh attacks occurred late Monday nights, said residents of two neighborhoods in the capital.</p>\n\n<p>\"They set fire to our house with my father inside. It's cruel,\" a resident who managed to flee the area told AFP.</p>\n\n<p>Haiti, the poorest nation in the Americas, has long been mired in instability, but conditions severely worsened early last year when gangs launched coordinated attacks in the capital to force then-prime minister Ariel Henry to resign.</p>\n\n<p>He handed power to an interim government, which along with the MSS has struggled to wrest back control from the gangs.</p>\n\n<p>The UN-approved MSS has around 1,000 personnel from six nations, though mostly from Kenya, out of 2,500 initially expected.</p>\n\n<p>One Kenyan officer died after being shot on Sunday.</p>\n\n<p>UN officials have repeatedly called for more support for the mission and a surge of resources to the nation, where an estimated 1 million people have been displaced by the violence.</p>\n\n<p>Last week, the UN launched an appeal for over $900 million in aid for Haiti this year, a sharp increase from 2024, which was only 44-percent funded.</p>\n\n<p>On Monday, Prime Minister Alix Didier Fils-Aime said authorities were \"at war\" with the gangs.</p>\n\n<p>\"We are relentlessly committed to enabling the police, the army and MSS to put gangs out of action,\" he promised in a speech to mark his 100 days in office.</p>",
        "published": "Thu, 27 Feb 2025 00:14:00 +0800",
        "guid": "https://www.manilatimes.net/2025/02/27/world/americas-emea/un-aid-groups-warn-haiti-unrest-rising/2062892"
    },
    {
        "title": "Archeologists find Stonehenge-like circle in Denmark",
        "link": "https://www.manilatimes.net/2025/02/26/world/archeologists-find-stonehenge-like-circle-in-denmark/2063071",
        "description": "<p>COPENHAGEN — Danish archeologists have uncovered a 4,000-year-old circle of wooden piles that they say could be linked to Britain's world-renowned Stonehenge.</p>\n\n<p>The 45 neolithic-era wooden pieces, in a circle with a diameter of about 30 meters (100 feet), were found during work on a housing estate in the northwestern town of Aars. The piles are about two meters apart.</p>\n\n<p>\"It is a once in a lifetime find,\" Sidsel Wahlin, conservationist at the town's Vesthimmerland museum, said in an email to Agence France-Presse.</p>\n\n<p>The circle \"points to a strong connection with the British henge world,\" she added.</p>\n\n<p>The two circles of stones at Stonehenge in southern England are believed to have been erected between 3100 BC and 1600 BC.</p>\n\n<p>The Danish archeologists are now trying to find if there is an inner circle at the Aars site.</p>\n\n<p>Wahlin said that some timber circles, considered part of worshipping of the sun, have been found on the Danish island of Bornholm.</p>\n\n<p>She added that the circle in Aars was \"the first one of this larger type that we can properly investigate.\"</p>\n\n<p>Archeologists first found an early Bronze Age (1700-1500 BC) settlement at the building site that included a chieftains grave and a bronze sword, Wahlin said.</p>\n\n<p>\"When I and my colleague opened a new section of the excavation the expected house and some fence quickly turned out to be the entrance area of a very well planned, slightly oval structure,\" she added.</p>\n\n<p>The wooden circle is estimated to date from about 2000 BC but Wahlin said the team had started detailed work on Monday to definitively identify its age and function.</p>\n\n<p>The archeologists are now looking for \"ritual deposits\" such as flint arrowheads and daggers as part of a major sampling exercise at the site.</p>\n\n<p>Wahlin said the next searches would seek to find if there were links between the region and other peoples, such as those who built Stonehenge. She said the influence of other regions could be seen in the pottery and graves that had been found.</p>",
        "published": "Wed, 26 Feb 2025 21:34:28 +0800",
        "guid": "https://www.manilatimes.net/2025/02/26/world/archeologists-find-stonehenge-like-circle-in-denmark/2063071"
    },
    {
        "title": "French police say killed man holding knives in Paris region",
        "link": "https://www.manilatimes.net/2025/02/26/world/french-police-say-killed-man-holding-knives-in-paris-region/2062853",
        "description": "<p>PARIS — French police said officers killed a man holding a knife in each hand after he \"threw himself\" at them in the northeastern Paris suburbs on Wednesday.</p>\n\n<p>At around 7 a.m. (0600 GMT), police approached \"a man sitting at a bus stop with a knife in each hand\" in the town of Dugny, Paris police told Agence France-Presse.</p>\n\n<p>The man \"threw himself at them, without saying a word,\" they said.</p>\n\n<p>One of the officers used an \"electroshock weapon\" without effect, they said.</p>\n\n<p>Another officer then \"used their weapon,\" wounding the man in the chest.</p>\n\n<p>\"CPR was administered until the firemen arrived. Despite the care provided, the man died,\" the police said.</p>\n\n<p>Local police and the inspectorate responsible for investigating police misconduct, called the IGPN, have both opened a probe.</p>\n\n<p>In 2023, 36 people died as a result of police action, the IGPN says.</p>\n\n<p>The incident comes after a 37-year-old Algerian-born man was arrested accused of carrying out a stabbing rampage in the eastern city of Mulhouse on Saturday, killing a Portuguese man and wounding seven traffic and police officers.</p>\n\n<p>The Mulhouse attack suspect is undocumented and had been required to leave French territory.</p>",
        "published": "Wed, 26 Feb 2025 19:30:18 +0800",
        "guid": "https://www.manilatimes.net/2025/02/26/world/french-police-say-killed-man-holding-knives-in-paris-region/2062853"
    },
    {
        "title": "Rights decline but bright spots in South Asia — Freedom House",
        "link": "https://www.manilatimes.net/2025/02/26/world/rights-decline-but-bright-spots-in-south-asia-freedom-house/2062852",
        "description": "<p>WASHINGTON, D.C. — Freedom declined around the world last year with authoritarians solidifying their grip, but South Asia led a series of bright spots, Freedom House said Wednesday in its annual report.</p>\n\n<p>The Washington-based pro-democracy research group elevated two countries to the status of \"free\" — Senegal, where the opposition triumphed after the outgoing president's attempt to delay elections was defeated, and Bhutan, the Himalayan kingdom which consolidated a transition to democracy with competitive polls.</p>\n\n<p>Tiny Bhutan gained the distinction of being the only South Asian country classified as free. But others in the region made strong gains in the index without changing categories — Bangladesh, where iron-fisted leader Sheikh Hasina fled in the face of a revolt, and Sri Lanka, where Anura Kumara Dissanayake was elected president on an anti-corruption platform after breaking the stranglehold of the two long-dominant parties.</p>\n\n<p>The largest score improvement in the index, which tracks both countries and territories, was in Indian-administered Kashmir, which held elections for the first time since the Hindu nationalist government in New Delhi revoked the Muslim-majority region's special status in 2019.</p>\n\n\nBhutan's King Jigme Khesar Namgyel Wangchuck (center) gestures during his visit to the Hanuman temple during the Maha Kumbh Mela festival in Prayagraj on February 4, 2025. AFP PHOTO\n\n\n<p>But Freedom House said India as a whole saw further deterioration as it pointed to Prime Minister Narendra Modi's efforts to gain influence over judicial appointments. The group downgraded the world's largest democracy from \"free\" to \"partly free\" in 2021.</p>\n\n<p>Yana Gorokhovskaia, the co-author of the report, said it was the 19th consecutive year that freedom fell on a global level, but that 2024 was especially volatile due to the high number of elections.</p>\n\n<p>\"The big picture is that this was another year of the same trajectory of a global decline in freedom but because of all the elections, it was more dynamic than previous years,\" she said.</p>\n\n<p>She said that both Bangladesh and Syria, where Islamist-led fighters toppled longtime strongman Bashar al-Assad in December, saw immediate improvements in civil liberties — but that it would be a longer road to see gains in political representation.</p>\n\n<p>Political rights largely \"depend on institutions. And those are easy to destroy but very hard to build up,\" she said.</p>\n\n<p>Four countries become 'not free'</p>\n\n<p>A rare bright spot in the Middle East was Jordan, which was upgraded from \"not free\" to \"partly free.\" Freedom House pointed to reforms that allowed more competitive elections in the kingdom.</p>\n\n<p>On the other hand, four countries were downgraded from \"partly free\" to \"not free\" — Kuwait, Niger, Tanzania and Thailand.</p>\n\n<p>Thailand — which has repeatedly shifted in the Freedom House categories — saw a court disband the party which won the most votes in elections and then dismiss the prime minister from the second-ranking party after an ethics complaint by senators backed by the powerful military.</p>\n\n\nPeople attend an event marking Kuwait's 64th Independence Day and the 34th anniversary of the liberation of Kuwait during the 1990-1991 Gulf War, in Kuwait City on February 25, 2025. AFP PHOTO\n\n\n<p>Kuwait's emir disbanded parliament after elections, while in Tanzania, Freedom House pointed to a crackdown on protesters under President Samia Suluhu Hassan.</p>\n\n<p>Niger came under full grip of the military after a 2023 coup ousted elected president Mohamed Bazoum.</p>\n\n<p>Tunisia, El Salvador and Haiti also saw steep declines. The only country given a perfect 100 score on freedom was Finland, with New Zealand, Norway and Sweden all right behind at 99.</p>\n\n<p>Freedom House, founded in 1941 with bipartisan US support, receives US government funding but is independently administered. The non-profit group has planned layoffs after President Donald Trump froze money aimed at democracy promotion.</p>",
        "published": "Wed, 26 Feb 2025 19:25:29 +0800",
        "guid": "https://www.manilatimes.net/2025/02/26/world/rights-decline-but-bright-spots-in-south-asia-freedom-house/2062852"
    },
    {
        "title": "Critically-ill pope has peaceful night – Vatican",
        "link": "https://www.manilatimes.net/2025/02/26/world/critically-ill-pope-has-peaceful-night-vatican/2062828",
        "description": "<p>VATICAN CITY — A critically ill Pope Francis, battling pneumonia in both lungs, passed a peaceful night, the Vatican said in its latest update Wednesday on the 88-year-old pontiff.</p>\n\n<p>\"The pope passed a peaceful night and is resting,\" the Vatican said in a morning update on the 13th day of Francis's hospital stay.</p>\n\n<p>Francis was admitted to Rome's Gemelli hospital on February 14 with breathing difficulties, after which his condition deteriorated, sparking widespread concern among Catholics.</p>\n\n<p>After suffering respiratory attacks at the weekend that required high levels of oxygen and blood transfusions, the Vatican has said the pope's condition has stabilized, but he remains in a critical condition.</p>\n\n<p>A medical bulletin on Tuesday evening said the Argentine pontiff's \"clinical condition remains critical but stable.\"</p>\n\n<p>\"There have been no acute respiratory episodes and hemodynamic parameters continue to be stable,\" the Vatican said, referring to measurements such as heart rate and blood pressure.</p>\n\n<p>Francis had a new scan \"in the evening for radiological monitoring of bilateral pneumonia,\" the Vatican said. \"The prognosis remains reserved,\" it added.</p>\n\n<p>Despite his critical condition, the leader of the world's nearly 1.4 billion Catholics has kept up with Church matters from his hospital suite, according to the Vatican.</p>\n\n<p>\"In the morning, after receiving the Eucharist, he resumed work activities,\" the statement said.</p>\n\n<p>Pilgrims and faithful have been flocking to the Vatican and the Gemelli to pray for Francis.</p>\n\n<p>Doctors have cautioned that any recovery will take time and that Francis will likely stay in hospital beyond this week.</p>",
        "published": "Wed, 26 Feb 2025 19:18:26 +0800",
        "guid": "https://www.manilatimes.net/2025/02/26/world/critically-ill-pope-has-peaceful-night-vatican/2062828"
    },
    {
        "title": "'Joyful' South Koreans hope rising births will continue",
        "link": "https://www.manilatimes.net/2025/02/26/world/joyful-south-koreans-hope-rising-births-will-continue/2062790",
        "description": "<p>SEOUL — South Koreans rejoiced Wednesday at news that the number of births had risen for the first time in about a decade — a rare bright spot for a country facing a deepening demographic decline.</p>\n\n<p>South Korea's statistics office earlier in the day announced that the country's fertility rate, or the average number of babies a woman is expected to have in her lifetime, was 0.75 last year.</p>\n\n<p>It's only a small uptick from the year before — and still far below the figure of 2.1 needed to maintain South Korea's population of 51 million.</p>\n\n<p>But approached by AFP on the bustling streets of Seoul, many saw the rising fertility rate — for the first time since 2015 — as a positive step in the right direction.</p>\n\n<p>\"The news of the birth rate rebounding after nine years is incredibly joyful for me,\" said Jun Sang-pill, a 34-year-old office worker.</p>\n\n<p>Housewife Park Ye-jin, 41, said her child had recently finished elementary school — along with only 99 other students.</p>\n\n<p>That, she explained, was only a fifth of the kids in her graduating class when she was that age.</p>\n\n<p>\"The graduation ceremony felt quite empty, and I felt sad,\" she told Agence France-Presse.</p>\n\n<p>Nearby, on its vast electronic screen, Seoul's National Museum of Korean Contemporary History displays adverts from the country's presidential committee on population policy — a government body set up in 2023 to find ways to reverse the declining birth rate.</p>\n\n<p>Seoul has poured billions of dollars into efforts to encourage women to have more children and maintain population stability.</p>\n\n<p>Experts say there are multiple reasons for the low birth rate, from high child-rearing costs and property prices to a notoriously competitive society that makes well-paid jobs difficult to secure.</p>\n\n<p>'Disappearing' country</p>\n\n<p>And state efforts had so far failed to boost the birth rate — sparking increasingly dire predictions about the fate of the country.</p>\n\n<p>\"With the birth rate dropping like this, there were even talks about the possibility of South Korea disappearing,\" housewife Park said.</p>\n\n<p>A South Korean official on Wednesday attributed the rise in births to an increasing number of marriages last year — and expressed hope that government policy was helping boost fertility.</p>\n\n<p>Some online were not as positive about the news.</p>\n\n<p>\"South Korea's birth rate is not just the lowest among OECD countries but it is still the absolute lowest. Please do not distort the facts,\" the top comment on the country's largest internet portal read.</p>\n\n<p>\"First increase in nine years!\" another wrote on Threads.</p>\n\n<p>\"South Korea's birth rate graph looks like a bitcoin chart now.\"</p>\n\n<p>Office worker Jun was more optimistic.</p>\n\n<p>\"I hope that this rebound will be the starting point for a continuous increase in South Korea's birth rate in the future,\" he said.</p>\n\n<p>And Park expressed hope that \"graduation ceremonies will feel fuller\" in the future.</p>\n\n<p>\"I believe those empty schoolyards and classrooms can be filled with the sound of children's laughter,\" she said.</p>\n\n<p>\"It makes me really happy.\"</p>",
        "published": "Wed, 26 Feb 2025 17:30:39 +0800",
        "guid": "https://www.manilatimes.net/2025/02/26/world/joyful-south-koreans-hope-rising-births-will-continue/2062790"
    },
    {
        "title": "Cambodian toddler dies of bird flu",
        "link": "https://www.manilatimes.net/2025/02/26/world/cambodian-toddler-dies-of-bird-flu/2062752",
        "description": "<p>PHNOM PENH, Cambodia — A two-year-old girl has died from bird flu in Cambodia, officials said, the Southeast Asian nation's second death from the virus this year.</p>\n\n<p>The girl caught the virus playing near sick chickens at her home in southeastern Prey Veng province and died on Tuesday after suffering fever, coughing and breathing difficulties, the health ministry said in a statement.</p>\n\n<p>Tests confirmed she had contracted the H5N1 strain of bird flu, according to the statement released late Tuesday.</p>\n\n<p>The toddler \"slept and played\" near a chicken cage at her family home where about 15 birds died and others are sick, it added.</p>\n\n<p>The ministry warned bird flu remained a threat in Cambodia and said officials were investigating the source of the virus that caused the girl's death.</p>\n\n<p>Last month, a 28-year-old Cambodian man also died from bird flu after eating infected chicken meat.</p>\n\n<p>The World Health Organization warned in July that patchy surveillance was hampering its ability to manage the risk to humans posed by the H5N1 strain of bird flu.</p>\n\n<p>The WHO called on all countries to step up influenza surveillance and reporting in animals and humans, and for nations to share samples and genetic sequences.</p>\n\n\nMen ride a motorbike loaded with chickens on a bridge in Phnom Penh on February 26, 2025. AFP PHOTO",
        "published": "Wed, 26 Feb 2025 15:56:20 +0800",
        "guid": "https://www.manilatimes.net/2025/02/26/world/cambodian-toddler-dies-of-bird-flu/2062752"
    },
    {
        "title": "Australian says 'wasn't nice' sitting with corpse on long-haul flight",
        "link": "https://www.manilatimes.net/2025/02/26/world/australian-says-wasnt-nice-sitting-with-corpse-on-long-haul-flight/2062679",
        "description": "<p>SYDNEY — An Australian couple have criticized Qatar Airways after a blanket-draped corpse was seated next to them during a long-haul flight.</p>\n\n<p>Mitchell Ring said a passenger died part-way through the 14-hour flight from Melbourne to Doha last week.</p>\n\n<p>\"They tried to wheel her up towards business class, but she was quite a large lady and they couldn't get her through the aisle,\" he told Australian network Nine News this week.</p>\n\n<p>\"They looked a bit frustrated, then they just looked at me and saw seats were available beside me.\"</p>\n\n<p>Ring said he was made to wait next to the corpse even after the plane landed.</p>\n\n<p>\"The ambulance officers and the police came in, and the ambulance officers started pulling the blankets off the lady,\" he said.</p>\n\n<p>\"It wasn't nice.\"</p>\n\n<p>Ring and wife Jennifer Colin were seated next to the corpse while travelling en-route to Venice.</p>\n\n<p>\"I'm not a great flier at the best of times,\" said Colin.</p>\n\n<p>\"There has to be a protocol that looks after the customers on board.\"</p>\n\n<p>Ring said he was seated with the body for around four hours despite other empty seats.</p>\n\n<p>\"They said, 'Can you move over please' and I just said, 'Yes no problem'.</p>\n\n<p>\"Then they placed the lady in the chair I was in.</p>\n\n<p>\"There were a few spare seats around that I could see.\"</p>\n\n<p>In a statement to Australian media, Qatar Airways apologized \"for any inconvenience or distress this incident may have caused.\"</p>\n\n<p>\"First and foremost our thoughts are with the family of the passenger who sadly passed away on board our flight.\"</p>",
        "published": "Wed, 26 Feb 2025 13:22:56 +0800",
        "guid": "https://www.manilatimes.net/2025/02/26/world/australian-says-wasnt-nice-sitting-with-corpse-on-long-haul-flight/2062679"
    },
    {
        "title": "Private US company set for second Moon landing attempt",
        "link": "https://www.manilatimes.net/2025/02/26/world/private-us-company-set-for-second-moon-landing-attempt/2062663",
        "description": "<p>WASHINGTON, D.C. — Intuitive Machines made history last year as the first private company to put a robot on the Moon, although the triumph was marred by the lander tipping onto its side.</p>\n\n<p>Now, the Houston-based firm is gearing up for a second attempt, determined to achieve a perfect touchdown.</p>\n\n<p>Intuitive Machines' hexagonal-shaped lander, Athena, is set to launch aboard a SpaceX Falcon 9 rocket during a window that opens at 7:02 p.m. (0002 GMT) Wednesday from the Kennedy Space Center in Florida, according to an official spaceflight advisory.</p>\n\n<p>If all goes well, it will touch down around March 6 at a spot called the Mons Mouton plateau, a site closer to the lunar south pole than any previously targeted.</p>\n\n<p>Athena carries scientific instruments, including a drill to search for ice beneath the surface and a unique hopping drone named Grace after a famous computer scientist, Grace Hopper. It is designed to traverse the Moon's rugged inclines, boulders, and craters — a valuable capability to support future crewed missions.</p>\n\n<p>Also aboard is a small rover, which will test a lunar cellular network provided by Nokia Bell Labs by relaying commands, images, and video between the lander, rover, and hopper.</p>\n\n<p>Until recently, soft lunar landings were achieved only by a handful of well-funded national space agencies.</p>\n\n<p>Now, the US is working to make private missions routine through the Commercial Lunar Payload Services (CLPS) program, a public-private collaboration aimed at delivering key NASA hardware to the surface at a fraction of the cost of traditional missions. The effort supports the broader Artemis program, which aims to return astronauts to the Moon and apply lessons learned there to prepare for reaching Mars.</p>\n\n<p>\"This is a really sophisticated mission enabled by the partnerships between the government and US industry,\" said Joel Kearns, NASA's deputy associate administrator for exploration.</p>\n\n\nThis February 19, 2025, image courtesy of Intuitive Machines, LLC shows the company's IM-2 mission Nova-C class lunar lander, Athena, encapsulated within SpaceX's payload fairing in preparation for launch, at NASA's Kennedy Space Center in Florida. AFP PHOTO / INTUITIVE MACHINES, LLC\n\n\n<p>Nailing the landing</p>\n\n<p>The first major hurdle, however, will be achieving a perfect landing — a feat the company fell short of with its first lander, Odysseus, which went to space in February 2024. It caught a foot on the surface and tipped over, coming to rest at a 30-degree angle — limiting its solar power and preventing it from completing NASA experiments under a $118 million contract.</p>\n\n<p>This time, the price tag is $62.5 million.</p>\n\n<p>\"Landing on the Moon is very challenging,\" said Kearns. \"It's a lot tougher than landing on Earth, where we have the advantage of air, wings, parachutes, and things like that.\"</p>\n\n<p>But on the Moon, which has an atmosphere so thin it's practically a vacuum, spacecraft must rely solely on controlled bursts from thrusters to slow their descent.</p>\n\n<p>Intuitive Machines CEO Trent Martin acknowledged the challenges and said the company had made key improvements — including better cabling for the laser altimeter, an instrument that provides altitude and velocity readings and helps select a safe landing site.</p>\n\n<p>Another issue the IM-1 mission faced was accurately determining its position en route to the Moon. To improve this, Intuitive Machines has enhanced coordination with NASA's Deep Space Network (DSN) for more precise navigation.</p>\n\n<p>Athena's arrival at the Moon is set to be preceded on March 2 by another private US lander, Firefly Aerospace's Blue Ghost, which launched on a more circuitous journey back in January, sharing a ride with Tokyo-based ispace's Resilience lander.</p>\n\n<p>Also hitching a ride on this rocket will be NASA's Lunar Trailblazer probe, which will enter orbit after a four-month journey and begin a two-year mission to study the distribution of different forms of water on the Moon.</p>\n\n<p>These missions come at a delicate time for NASA, amid speculation that it may scale back or cancel its astronaut program to the Moon in favor of Mars — a key goal of both President Donald Trump and his close advisor Elon Musk.</p>",
        "published": "Wed, 26 Feb 2025 12:23:38 +0800",
        "guid": "https://www.manilatimes.net/2025/02/26/world/private-us-company-set-for-second-moon-landing-attempt/2062663"
    },
    {
        "title": "Ailing pope 'critical but stable', Vatican says",
        "link": "https://www.manilatimes.net/2025/02/26/world/americas-emea/ailing-pope-critical-but-stable-vatican-says/2062646",
        "description": "<p>VATICAN CITY — Pope Francis, who is in hospital with pneumonia in both lungs, is still in a critical condition but is stable and working from his sick bed, the Vatican said Tuesday.</p>\n\n<p>Catholics across the globe have been praying for the 88-year-old amid hope he may be turning a corner on what doctors warn could be a long path to recovery.</p>\n\n<p>\"The Holy Father's clinical condition remains critical but stable,\" the Vatican said the evening of Francis's 12th day in the papal suite of Rome's Gemelli hospital.</p>\n\n<p>\"There have been no acute respiratory episodes and hemodynamic parameters continue to be stable,\" it said in a statement, referring to measurements such as heart rate and blood pressure.</p>\n\n<p>Francis, admitted on February 14 with breathing difficulties, suffered asthmatic respiratory attacks at the weekend that required high levels of oxygen and blood transfusions to combat anaemia.</p>\n\n<p>On Tuesday, \"he underwent a scheduled follow-up CT scan in the evening for radiological monitoring of bilateral pneumonia\", the Vatican said.</p>\n\n<p>\"The prognosis remains reserved,\" it said.</p>\n\n<p>Despite his critical condition, the leader of the world's nearly 1.4 billion Catholics has striven to keep up with Church matters from his hospital suite on the Gemelli's 10th floor, according to the Vatican.</p>\n\n<p>\"In the morning, after receiving the Eucharist, he resumed work activities,\" the statement said.</p>\n\n<p>'Praying for you' </p>\n\n<p>The Argentine pope worked Monday too, receiving the Vatican's secretary of state, Cardinal Pietro Parolin.</p>\n\n<p>Francis approved the canonisation of two Venezuelan and Italian laymen who died in the early 20th century, while authorising the first steps towards sainthood for three 19th-century priests.</p>\n\n<p>He also called the parish priest of Gaza's Catholic community, as he has routinely done since the war there broke out, the Vatican said.</p>\n\n<p>This time, he was thanking him for a video the parish sent him.</p>\n\n<p>\"The whole world is praying for you... and everyone wishes you good health,\" the priest said in the video, published on Vatican News.</p>\n\n<p>Catholics left messages and candles outside the hospital, where a group of faithful held up a banner reading: \"Today, more than ever, we need you Francis\".</p>\n\n<p>Dozens of people attended special prayers for the pope at an Argentine church in Rome Tuesday evening, led by Italian Cardinal Baldassare Reina.</p>\n\n<p>In the chapel of Our Lady of Lujan at the Santa Maria Addolorata church, faithful could leave messages for Francis in a notebook, which would then be sent to him.</p>\n\n<p>\"Prayers are being sent from every part of the world... Let it become a choral prayer, (to) give Pope Francis health, strength, give him the ability to face this moment too, as he has always done\", Reina said.</p>\n\n<p>'Breath of fresh air' </p>\n\n<p>In Buenos Aires, where the former Jorge Bergoglio served as archbishop before being made pope in 2013, hundreds of Argentines prayed for the pontiff.</p>\n\n<p>Speaking in the plaza where Bergoglio used to rail against injustice and inequality, Archbishop Jorge Garcia Cuerva called Francis's papacy \"a breath of oxygen for a world suffocated by violence, suffocated by selfishness, suffocated by exclusion\".</p>\n\n<p>\"Let our prayer be that breath of fresh air that reaches his lungs so that he can recover his health,\" he said.</p>\n\n<p>Honduran Cardinal Oscar Rodriguez Maradiaga, a former coordinator of the pope's Council of Cardinals, told La Repubblica daily Tuesday he felt hopeful the pope would pull through.</p>\n\n<p>\"It's not yet time for him to go to heaven,\" Maradiaga said.</p>\n\n<p>\"He is someone who does not back down in the face of difficulty, does not get discouraged, does not freeze, and does not stop moving forward,\" he told the paper.</p>\n\n<p>Recovery time </p>\n\n<p>Doctors have cautioned that any recovery will take time and that Francis will likely stay in hospital beyond this week.</p>\n\n<p>The pope, who had part of one lung removed as a young man, has increasingly suffered health complications in recent years.</p>\n\n<p>He is prone to respiratory infections, is overweight and suffers knee and hip pain that has led to his reliance on a wheelchair.</p>\n\n<p>It takes a young person at least two weeks to get over double pneumonia, Massimo Andreoni, scientific director of the Italian Society of Infectious and Tropical Diseases, told newspaper La Stampa.</p>\n\n<p>\"For an older person like Pope Francis, with all the added complications... you have to wait even longer for a complete recovery,\" Andreoni said.</p>",
        "published": "Wed, 26 Feb 2025 10:54:11 +0800",
        "guid": "https://www.manilatimes.net/2025/02/26/world/americas-emea/ailing-pope-critical-but-stable-vatican-says/2062646"
    },
    {
        "title": "One-third of Musk's DOGE staff resign in protest",
        "link": "https://www.manilatimes.net/2025/02/26/world/americas-emea/one-third-of-musks-doge-staff-resign-in-protest/2062644",
        "description": "<p>WASHINGTON, D.C. — Roughly a third of staffers at Elon Musk's Department of Government Efficiency have resigned in protest, saying that they will not push through demanded changes that put the country at risk.</p>\n\n<p>\"We swore to serve the American people and uphold our oath to the Constitution across presidential administrations,\" 21 staffers of DOGE wrote in a letter, seen by AFP on Tuesday, to White House chief of staff Susan Wiles.</p>\n\n<p>\"However, it has become clear that we can no longer honor those commitments,\" they added.</p>\n\n<p>The workers initially worked for the United States Digital Service, which was transformed into DOGE after President Donald Trump took office on January 20th, with Musk effectively taking over the department.</p>\n\n<p>Musk is the political force behind DOGE, with a small group of employees faithful to the multi-billionaire being dispatched across government and working toward gutting federal staffing and spending.</p>\n\n<p>While Musk is not the formal administrator of DOGE, the SpaceX and Tesla CEO is nonetheless directing operations and will even attend Trump's first cabinet meeting on Wednesday.</p>\n\n<p>The world's wealthiest person and a top Trump donor, Musk has no ministerial portfolio or formal decision-making authority but has status as a \"special government employee\" and \"senior adviser to the president.\"</p>\n\n<p>He downplayed the significance of the departures, saying that the workers were \"political holdovers\" who worked remotely and refused to return to the office as ordered by Trump.</p>\n\n<p>\"They would have been fired had they not resigned,\" he added on X, the platform he owns.</p>\n\n<p>The signatories describe a chaotic transition process that began on January 21 with hastily conducted interviews by unidentified individuals wearing White House visitor badges.</p>\n\n<p>The interviewers questioned staff about political loyalty, attempted to create division among team members, and displayed \"limited technical ability.\"</p>\n\n<p>Tensions escalated on February 14 when approximately one-third of USDS staff were abruptly terminated via anonymous email.</p>\n\n<p>The dismissed employees had been working on modernizing critical government systems including Social Security, veterans' services, tax filing, healthcare, and disaster relief platforms, the letter said.</p>\n\n<p>\"Their removal endangers millions of Americans who rely on these services every day. The sudden loss of their technology expertise makes critical systems and Americans' data less safe,\" the letter stated.</p>\n\n<p>The employees explicitly refused to participate in what they described as efforts to \"compromise core government systems, jeopardize Americans' sensitive data, or dismantle critical public services.\"</p>\n\n<p>Software for firing </p>\n\n<p>The USDS was established in 2014 during Barack Obama's administration and has historically operated as a non-partisan technology unit tasked with improving government digital services.</p>\n\n<p>The mass resignation came days after Musk engineered a mass email to the federal government's two million workers, ordering them to justify their work in an email or risk being fired.</p>\n\n<p>Government departments on Monday largely told staff to either ignore the DOGE-inspired email or downplayed the risks of not answering it.</p>\n\n<p>According to Wired magazine, engineers at DOGE are working on new software that could assist mass firings of federal workers across the government.</p>\n\n<p>So far, thousands of mainly probationary workers -- employees who are recently hired, promoted, or otherwise changed roles -- have been terminated since Trump's inauguration.</p>\n\n<p>The new software would streamline the dismissal process, known as a reduction in force, for firing federal workers with stronger civil service protections.</p>",
        "published": "Wed, 26 Feb 2025 10:33:14 +0800",
        "guid": "https://www.manilatimes.net/2025/02/26/world/americas-emea/one-third-of-musks-doge-staff-resign-in-protest/2062644"
    },
    {
        "title": "Mastercard Strive signs up 15 service providers",
        "link": "https://www.bworldonline.com/banking-finance/2025/02/28/656103/mastercard-strive-signs-up-15-service-providers/",
        "description": "MASTERCARD’s partnership with Boost Capital has onboarded 15 financial service providers that it said would bolster access to digital financial services of more than 10,000 micro, small and medium enterprises (MSME) in the Philippines. “Small business owners can focus on growing their businesses rather than waiting in line at a bank to fill out an [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656103"
    },
    {
        "title": "A growing appetite: 5 lessons to learn before jumping into the restaurant business",
        "link": "https://www.bworldonline.com/opinion/2025/02/28/656022/a-growing-appetite-5-lessons-to-learn-before-jumping-into-the-restaurant-business/",
        "description": "There’s something about the restaurant biz that calls out to Filipinos. In my many conversations with entrepreneurs, restaurateurs and aspiring entrepreneurs and restaurateurs, their passion for food always rises to the forefront. It’s a testament to how rich Filipino food culture is, that so many of us want to put up a restaurant or food [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656022"
    },
    {
        "title": "Higher costs cut Philex Mining’s 2024 profit to P810M, down 20%",
        "link": "https://www.bworldonline.com/corporate/2025/02/28/656155/higher-costs-cut-philex-minings-2024-profit-to-p810m-down-20/",
        "description": "PANGILINAN-LED Philex Mining Corp. saw its attributable net income decline by 20% to P810 million in 2024 from P1.02 billion a year earlier, as higher costs outpaced revenue growth. Core net income also dropped 22% to P746 million from P963 million, the company said in a disclosure. While revenues grew 6% to P8.18 billion from [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656155"
    },
    {
        "title": "Chinabank posts record 2024 net income",
        "link": "https://www.bworldonline.com/banking-finance/2025/02/28/656104/chinabank-posts-record-2024-net-income/",
        "description": "CHINA Banking Corp.’s (Chinabank) net income rose 12.7% to a record P24.8 billion last year, amid sustained core business growth. Its common equity tier 1 ratio was 15.3%, while total capital adequacy ratio was 16.2%, the Philippine lender said in a statement on Thursday. The publicly listed lender did not provide financial figures for the [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656104"
    },
    {
        "title": "No, celebrities are not the problem",
        "link": "https://www.bworldonline.com/opinion/2025/02/28/656023/no-celebrities-are-not-the-problem/",
        "description": "RECENT pre-election surveys indicate a significant shift in the Philippine political landscape, with media celebrities poised to secure a substantial number of Senate seats in the upcoming May 2025 elections. According to data from the Philippine Center for Investigative Journalism (PCIJ), if current trends persist, 11 out of the 24 Senate seats could be occupied [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656023"
    },
    {
        "title": "PXP Energy cuts net loss to P30.9M in 2024 on higher sales, cost reductions",
        "link": "https://www.bworldonline.com/corporate/2025/02/28/656156/pxp-energy-cuts-net-loss-to-p30-9m-in-2024-on-higher-sales-cost-reductions/",
        "description": "PANGILINAN-LED PXP Energy Corp. narrowed its attributable net loss to P30.9 million for 2024 from P97 million a year earlier, driven by higher petroleum sales volume, reduced overhead costs, and lower net interest expenses. The company’s core net loss stood at P33.3 million during the period, lower than the P42.5 million recorded in 2023, PXP [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656156"
    },
    {
        "title": "BDO, Shizuoka Bank expand tie-up to boost service to Japanese companies",
        "link": "https://www.bworldonline.com/banking-finance/2025/02/28/656105/bdo-shizuoka-bank-expand-tie-up-to-boost-service-to-japanese-companies/",
        "description": "BDO UNIBANK, Inc. has expanded its partnership with Shizuoka Bank Ltd. to boost trade and investment with Japanese companies in the country. “The expanded partnership with Shizuoka Bank enables companies to connect with the right partners, streamline financial transactions and navigate regulatory landscapes,” it said in a statement on Thursday. “This demonstrates BDO’s commitment to [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656105"
    },
    {
        "title": "NGCP eyes completion of P8.1-B Tuy-Dasmariñas project by Q4",
        "link": "https://www.bworldonline.com/corporate/2025/02/28/656157/ngcp-eyes-completion-of-p8-1-b-tuy-dasmarinas-project-by-q4/",
        "description": "POWER TRANSMISSION operator National Grid Corp. of the Philippines (NGCP) expects to complete its P8.1-billion Tuy-Dasmariñas 500-kilovolt (kV) project by the fourth quarter (Q4) of this year.  “One big project is [the] Tuy-Dasmariñas 500-kV backbone in South Luzon, and this is for completion this year. It’s a major transmission [project],” Redi Allan Remoroza, NGCP’s assistant [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656157"
    },
    {
        "title": "Spain’s Repsol acquires 40% stake in Unioil Lubricants",
        "link": "https://www.bworldonline.com/corporate/2025/02/28/656158/spains-repsol-acquires-40-stake-in-unioil-lubricants/",
        "description": "MADRID-BASED multinational energy and petrochemical company Repsol S.A., through its subsidiary, has acquired a 40% stake in the lubricant manufacturing and distribution arm of the Unioil Group of Companies.  In a statement on Thursday, Unioil Group said it had entered into a joint venture agreement with Repsol Downstream Internacional, S.A.U. to invest in Unioil Lubricants, [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656158"
    },
    {
        "title": "The undeniable impact of Bob Dylan",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/02/28/656064/the-undeniable-impact-of-bob-dylan/",
        "description": "YET ANOTHER biopic of a beloved musician has hit the big screen, this time inviting longtime Bob Dylan fans to revisit their favorite songs, and younger audiences to get to know the 1960s icon.",
        "guid": "https://www.bworldonline.com/?p=656064"
    },
    {
        "title": "Peso dips as Trump tariff vs EU fans trade war fears",
        "link": "https://www.bworldonline.com/banking-finance/2025/02/28/656107/peso-dips-as-trump-tariff-vs-eu-fans-trade-war-fears/",
        "description": "THE PESO dipped against the dollar on Thursday after US President Donald J. Trump said he would slap a 25% tariff on the European Union (EU), which vowed to counter “firmly and immediately,” fanning fears of an escalating trade war. It closed at P57.91 a dollar, three centavos weaker than its P57.88 finish on Tuesday, [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656107"
    },
    {
        "title": "SEC pushes on with AML reforms to prevent FATF relisting",
        "link": "https://www.bworldonline.com/corporate/2025/02/28/656159/sec-pushes-on-with-aml-reforms-to-prevent-fatf-relisting/",
        "description": "THE SECURITIES and Exchange Commission (SEC) is ramping up reforms by launching a beneficial ownership registry, tightening oversight of financial institutions and non-profits, and drafting new crypto asset regulations to ensure the Philippines does not return to the Financial Action Task Force’s (FATF) “gray list,” its chairman said.",
        "guid": "https://www.bworldonline.com/?p=656159"
    },
    {
        "title": "ABS-CBN sells 68% of Quezon City property to Ayala Land for P6.24B",
        "link": "https://www.bworldonline.com/corporate/2025/02/28/656160/abs-cbn-sells-68-of-quezon-city-property-to-ayala-land-for-p6-24b/",
        "description": "AYALA LAND, Inc. (ALI) has signed a memorandum of agreement to acquire a portion of ABS-CBN Corp.’s property in Quezon City for P6.24 billion.  In separate disclosures on Thursday, ABS-CBN and property company Ayala Land confirmed the agreement for the sale of ABS-CBN’s property in Quezon City.  The sale covers up to 30,000 square meters, [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656160"
    },
    {
        "title": "The Mall of Asia turns to the skies",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/02/28/656066/the-mall-of-asia-turns-to-the-skies/",
        "description": "THE LARGEST MALL in the Philippines, SM Mall of Asia (MOA) in Pasay City, just got a little bit bigger with the addition of MOA Sky, its redeveloped rooftop area on the fourth level of the mall.",
        "guid": "https://www.bworldonline.com/?p=656066"
    },
    {
        "title": "PLDT profit up 21.4% to P32.3B in 2024, eyes up to P73-B capex",
        "link": "https://www.bworldonline.com/corporate/2025/02/28/656162/pldt-profit-up-21-4-to-p32-3b-in-2024-eyes-up-to-p73-b-capex/",
        "description": "PANGILINAN-LED PLDT Inc. saw its attributable net income for 2024 climb by 21.4% to P32.31 billion, fueled by the company’s all-time-high service revenue growth.  The company’s consolidated revenue for the period surged to P216.83 billion, marking a 2.8% increase from P210.95 billion in 2023, mainly driven by growth in its service revenues. Broken down, PLDT’s [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656162"
    },
    {
        "title": "What would it take for Philippine companies to be future-ready?",
        "link": "https://www.bworldonline.com/spotlight/2025/02/28/655424/what-would-it-take-for-philippine-companies-to-be-future-ready/",
        "description": "For sustainable success, companies must build the business and organization in tandem. It cannot be one and leave the other for later. That season towards the closing of one year and the beginning of a new one is an auspicious time to take stock of the past and gear up for the future. For business [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=655424"
    },
    {
        "title": "Toyota Motor Philippines recognizes excellent 2024 performance of dealer network",
        "link": "https://www.bworldonline.com/spotlight/2025/02/28/656015/toyota-motor-philippines-recognizes-excellent-2024-performance-of-dealer-network/",
        "description": "Toyota Motor Philippines (TMP) recently celebrated its top-performing dealers for 2024 at the annual Toyota Dealer Awards held during the 2025 Dealer Conference. Outstanding marketing professionals and service advisers were also acknowledged during the Toyota Outstanding Performers in Sales and Service (TOPS) Awards. The prestigious President’s Award of Excellence was given to Toyota Marilao, Bulacan, [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656015"
    },
    {
        "title": "TP bolsters sustainable operations in PH",
        "link": "https://www.bworldonline.com/spotlight/2025/02/28/655948/tp-bolsters-sustainable-operations-in-ph/",
        "description": "60% energy use sourced from renewables Teleperformance (TP) in the Philippines, an industry leader in sustainable business, affirms its unwavering commitment to the United Nations Sustainable Development Goals as it announced a significant achievement in its sustainability efforts: over 60% of its nationwide energy consumption now comes from renewable energy sources. Celebrating a major milestone [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=655948"
    },
    {
        "title": "BSP seen to bring down RRR to zero by 2028",
        "link": "https://www.bworldonline.com/top-stories/2025/02/28/656221/bsp-seen-to-bring-down-rrr-to-zero-by-2028/",
        "description": "BIG BANKS’ reserve requirements are seen to be slashed further to zero in the near term, Security Bank said. “Our forecast is that even in the next couple of years, there will still be cuts,” Security Bank Corp. Vice-President and Research Division Head Angelo B. Taningco said in mixed English and Filipino. Mr. Taningco said [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656221"
    },
    {
        "title": "Pag-IBIG Fund declares record-high dividends",
        "link": "https://www.bworldonline.com/top-stories/2025/02/28/656222/pag-ibig-fund-declares-record-high-dividends/",
        "description": "THE HOME Development Mutual Fund or Pag-IBIG Fund has declared a record-high P55.65 billion in total dividends for its members’ savings in 2024. In a statement, Pag-IBIG Fund said this brought the dividend rate for its regular savings to 6.6%, while the rate for its modified Pag-IBIG 2 (MP2) savings went up to 7.1%. The [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656222"
    },
    {
        "title": "Thailand’s planned casinos ‘a big threat’ to PHL, says PAGCOR",
        "link": "https://www.bworldonline.com/top-stories/2025/02/28/656224/thailands-planned-casinos-a-big-threat-to-phl-says-pagcor/",
        "description": "THE THAI government’s plan to legalize casinos poses a “big threat” to the Philippine gaming industry, according to Philippine Amusement and Gaming Corp. (PAGCOR) Chairman and Chief Executive Officer Alejandro H. Tengco.",
        "guid": "https://www.bworldonline.com/?p=656224"
    },
    {
        "title": "Budget gap exceeds full-year ceiling",
        "link": "https://www.bworldonline.com/top-stories/2025/02/28/656225/budget-gap-exceeds-full-year-ceiling/",
        "description": "THE NATIONAL GOVERNMENT’S (NG) budget deficit narrowed year on year in 2024, but overshot the target by 1.48%, the Bureau of the Treasury (BTr) said. Data from the Treasury released on Thursday showed that the budget deficit shrank by 0.38% or P5.7 billion to P1.506 trillion in 2024 from P1.512 trillion in 2023. However, it [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656225"
    },
    {
        "title": "How to succeed in the bakery business",
        "link": "https://www.bworldonline.com/video/2025/02/28/656252/how-to-succeed-in-the-bakery-business/",
        "description": "To succeed in business, love and enjoy what you do, advised Wilson Lee Flores, owner of Kamuning Bakery Café. Interview by Edg Adrian Eva Video editing by Arjale Queral",
        "guid": "https://www.bworldonline.com/?p=656252"
    },
    {
        "title": "Taiwan is not just Taipei (though it is not a bad place to start a visit)",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/02/28/656257/taiwan-is-not-just-taipei-though-it-is-not-a-bad-place-to-start-a-visit/",
        "description": "by Almira Louise S, Martinez, Reporter For the record, there is more to Taiwan than Taipei. The Taiwan Tourism Administration (TTA) wants international visitors, including Filipinos, to explore cities beyond Taipei to experience the country’s culture, history, nature, and cuisine in a showcase of Taiwan’s charm. “We want to see more Filipino visitors to Taiwan [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656257"
    },
    {
        "title": "Navigating Taiwan as a Filipino tourist",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/02/28/656297/navigating-taiwan-as-a-filipino-tourist/",
        "description": "by Almira Louise S. Martinez, Reporter Although the Philippines has no formal diplomatic ties with Taiwan, the two countries have maintained a strong relationship, especially in tourism. In 2024, the Taiwan Tourism Administration (TTA) ranked the Philippines as the fifth largest source of inbound tourists, with approximately 470,000 Filipino tourist arrivals. One of the reasons [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656297"
    },
    {
        "title": "Unleashing Pandora’s Box: DeepSeek, LLMs, and the AI race",
        "link": "https://www.bworldonline.com/video/2025/02/28/656329/unleashing-pandoras-box-deepseek-llms-and-the-ai-race-2/",
        "description": "DeepSeek is a Chinese AI company that develops large language models, which is a type of AI program that can recognize and generate text, among other tasks. Its new AI model, R1, is said to rival the capabilities of leading AI models, while reportedly costing less to develop. In this episode, BusinessWorld talks about LLMs, [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656329"
    },
    {
        "title": "DOST eyes potential use of cinnamon, pili-based mosquito repellent",
        "link": "https://www.bworldonline.com/health/2025/02/28/656336/dost-eyes-potential-use-of-cinnamon-pili-based-mosquito-repellent/",
        "description": "by Edg Adrian A. Eva, Reporter A mosquito repellent made from forest products is being developed by the Department of Science and Technology (DOST) to support the country’s efforts against dengue.  Residual byproducts from essential oil production, such as cinnamon bark, almaciga, and pili resin are being repurposed into incense cones and sticks as insect [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656336"
    },
    {
        "title": "How can a brand protect its reputation?",
        "link": "https://www.bworldonline.com/podcast/2025/02/28/656340/how-can-a-brand-protect-its-reputation/",
        "description": "Follow us on Spotify BusinessWorld B-Side What causes reputational damage? How can one mitigate the effects of it? What are ways companies can protect their reputation? In this B-Side episode, BusinessWorld talks about these topics with R.G. W. Gabunada, a partner at Louder PH, a full-service agency, and the CMO of Mansmith and Fielders, a training [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656340"
    },
    {
        "title": "Trade gap widens to $5.09 billion in January",
        "link": "https://www.bworldonline.com/top-stories/2025/02/28/656357/trade-gap-widens-to-5-09-billion-in-january/",
        "description": "The Philippines’ trade-in-goods deficit widened to a three-month high in January as both exports and imports picked up, the Philippine Statistics Authority (PSA) reported on Friday. The trade deficit could further worsen this year as the US trade war escalates, analysts said. Preliminary data from the PSA showed the country’s trade balance — the difference [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656357"
    },
    {
        "title": "SM Mall of Asia unveils MOA Sky with spectacular event filled with music, art, and culture",
        "link": "https://www.bworldonline.com/spotlight/2025/02/28/656355/sm-mall-of-asia-unveils-moa-sky-with-spectacular-event-filled-with-music-art-and-culture/",
        "description": "The SM Mall of Asia (MOA) recently opened its stunning new attraction, the 55,000-sq.m. MOA Sky, with a launch event that was nothing short of extraordinary. It was a whirlwind of entertainment, celebration, and community spirit, leaving attendees with unforgettable memories. A grand opening with dance and inspiration The event began with a captivating performance [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656355"
    },
    {
        "title": "Gamaba awardee Magdalena Gamayo weaves Philippine cotton again",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/03/656470/gamaba-awardee-magdalena-gamayo-weaves-philippine-cotton-again/",
        "description": "IN PINILI, Ilocos Norte, National Living Treasure Magdalena Gamayo is once more weaving with Philippine cotton. At the age of 100, her hands remain steady, creating swathes of inabel, a traditional Ilocano textile. This return to Philippine cotton — after a long period when weavers had to make do with imported cotton or synthetic thread [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656470"
    },
    {
        "title": "First Gen to supply Cebu’s Oakridge Business Park with renewable energy",
        "link": "https://www.bworldonline.com/corporate/2025/03/03/656553/first-gen-to-supply-cebus-oakridge-business-park-with-renewable-energy/",
        "description": "OAKRIDGE Realty Development Corp. (ORDC), the developer of Oakridge Business Park in Cebu, has renewed its partnership with Lopez-led First Gen Corp. for the construction of a rooftop solar system in the premier development. Under the deal, First Gen will install solar panels totaling 638 kilowatts atop Oakridge Business Park, the company said in a [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656553"
    },
    {
        "title": "Italpinas signs five new joint ventures",
        "link": "https://www.bworldonline.com/corporate/2025/03/03/656545/italpinas-signs-five-new-joint-ventures/",
        "description": "REAL ESTATE developer Italpinas Development Corp. (IDC) has entered into five new joint venture (JV) agreements for real estate development projects. In a media release on Sunday, IDC said three of the five new ventures are in Puerto Princesa, while the other two are for projects in Boracay and Pampanga. “Each of the new JVs [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656545"
    },
    {
        "title": "SLIMTC expects AUMs to reach about P450 billion this year",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/03/656460/slimtc-expects-aums-to-reach-about-p450-billion-this-year/",
        "description": "SUN LIFE Investment Management and Trust Corp. (SLIMTC) expects its assets under management (AUM) to reach P440 billion to P450 billion this year as it plans to launch retail products. “The bulk of it will come from the insurance assets. But for retail alone&#8230; we’re launching the unit investment trust funds (UITFs) by April. We [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656460"
    },
    {
        "title": "Analysts’ February inflation rate estimates",
        "link": "https://www.bworldonline.com/infographics/2025/03/03/656410/analysts-february-inflation-rate-estimates-5/",
        "description": "HEADLINE INFLATION likely slowed in February amid the decline in prices of rice and other key commodities, analysts said. Read the full story.",
        "guid": "https://www.bworldonline.com/?p=656410"
    },
    {
        "title": "CAMPI, TMA sell 37K units in January",
        "link": "https://www.bworldonline.com/velocity/2025/03/03/656385/campi-tma-sell-37k-units-in-january/",
        "description": "APPARENTLY SUSTAINING the momentum of their best-ever sales performance last year, the Chamber of Automotive Manufacturers of the Phlippines, Inc. (CAMPI) and Truck Manufacturers Association (TMA) reported sales of 37,604 vehicles in January. The consolidated sales total of their member companies surpassed the 34,060 units moved in the same month in 2024. In January 2023, [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656385"
    },
    {
        "title": "Style (03/03/25)",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/03/656471/style-03-03-25/",
        "description": "ArteFino returns for resort season LIFESTYLE fair ArteFino is coming back on March 6 to 9 at the North and South Court of Powerplant Mall in Rockwell, Makati. The lifestyle fair is jumping on the Resort Collection bandwagon with wares designed for the coming summer months. Brands include Pinas Sadya, Barba, R. Filart, del, Maison [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656471"
    },
    {
        "title": "CTA cancels P48-M tax on Smart",
        "link": "https://www.bworldonline.com/corporate/2025/03/03/656546/cta-cancels-p48-m-tax-on-smart/",
        "description": "THE COURT of Tax Appeals (CTA) has ruled in favor of Smart Communications, Inc., canceling over P48 million in local franchise taxes assessed by the province of Cagayan for the years 2011–2015, citing an expired demand letter and lack of territorial jurisdiction. “All told, petitioner’s (Smart) insistence on its local franchise tax exemption is untenable. [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656546"
    },
    {
        "title": "HMO industry swings to profit in 2024",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/03/656461/hmo-industry-swings-to-profit-in-2024/",
        "description": "THE HEALTH maintenance organization (HMO) industry returned to profitability in 2024 amid higher revenues, data from the Insurance Commission (IC) showed. The sector’s net income stood at P979.8 million as of end-2024, a turnaround from the P4.27-billion net loss in 2023, according to IC data based on the unaudited financial statements submitted by 28 companies. [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656461"
    },
    {
        "title": "All about auto insurance",
        "link": "https://www.bworldonline.com/velocity/2025/03/03/656386/all-about-auto-insurance/",
        "description": "HAPPY MOTORING is all about peace of mind. You must be confident in the car you are driving, that it is reliable enough to get you to where you are going.",
        "guid": "https://www.bworldonline.com/?p=656386"
    },
    {
        "title": "Surveys: Believe them or not?",
        "link": "https://www.bworldonline.com/opinion/2025/03/03/656445/surveys-believe-them-or-not/",
        "description": "SENATORIAL preference surveys are proliferating these days as May 12 draws near and impeachment issues hover in the minds of politicians. Some survey reports are sending shock waves among the thinking public because candidates over the age of retirement (i.e., aged 69-79) and new aspirant-celebrities with nary any experience in law-making land in the top [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656445"
    },
    {
        "title": "MGen expects to surpass RE target ahead of 2030",
        "link": "https://www.bworldonline.com/corporate/2025/03/03/656547/mgen-expects-to-surpass-re-target-ahead-of-2030/",
        "description": "MERALCO PowerGen Corp. (MGen), the power generation subsidiary of Manila Electric Co. (Meralco), expects to surpass its 1,500-megawatt (MW) renewable energy (RE) target well before 2030, citing a strong project pipeline. In the next two years, MGen’s RE portfolio is expected to reach 3,397 MW, a substantial increase from its current net sellable capacity of [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656547"
    },
    {
        "title": "Yields on BSP securities end slightly higher",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/03/656462/yields-on-bsp-securities-end-slightly-higher/",
        "description": "YIELDS on the Bangko Sentral ng Pilipinas’ (BSP) short-term securities inched higher on Friday even as total demand picked up, with the one-month bill still undersubscribed. The central bank’s securities fetched bids amounting to P141.859 billion on Friday, higher than the P130-billion offer and the P133.598 billion in tenders for the P160 billion auctioned off [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656462"
    },
    {
        "title": "Q&A: ‘It teaches us a lot about buyers’",
        "link": "https://www.bworldonline.com/velocity/2025/03/03/656387/qa-it-teaches-us-a-lot-about-buyers/",
        "description": "AN INITIATIVE that started last year, UAAGI (United Asia Automotive Group, Inc.) On the Move, billed as “a multi-brand automotive extravaganza,” kicked off its 2025 edition with a staging at the Fashion Hall of SM Megamall recently.",
        "guid": "https://www.bworldonline.com/?p=656387"
    },
    {
        "title": "EdCom II Year Two Report: Persistent misreading of the Philippine basic education situation",
        "link": "https://www.bworldonline.com/opinion/2025/03/03/656446/edcom-ii-year-two-report-persistent-misreading-of-the-philippine-basic-education-situation/",
        "description": "The EdCom II Year Two Report entitled “Fixing the Foundations: A Matter of National Survival” persistently misreads the Philippine basic education situation. As stated in our previous column, “EdCom II Year One Report: Misreading the Philippine Education Situation” (March 11, 2024), we do not have a crisis in Philippine education. We have a crisis in [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656446"
    },
    {
        "title": "Employment is sexy at Gucci",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/03/656474/employment-is-sexy-at-gucci/",
        "description": "GUCCI is celebrating its double G logo’s 50th anniversary this year, which uses the initials of its founder, Guccio Gucci. The luxury house’s Fall/Winter 2025 fashion show for Milan Fashion Week last week showed its hold on fashion and the times through a presentation on a runway shaped like their double G. Academy Award-winning composer [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656474"
    },
    {
        "title": "Tomato oversupply exposes logistics, storage shortcomings",
        "link": "https://www.bworldonline.com/agribusiness/2025/03/03/656539/tomato-oversupply-exposes-logistics-storage-shortcomings/",
        "description": "THE GOVERNMENT needs to address logistics bottlenecks and build more storage facilities to avoid wasting the tomato surplus, industry representatives said.",
        "guid": "https://www.bworldonline.com/?p=656539"
    },
    {
        "title": "Honda to launch new HR-V by March 9",
        "link": "https://www.bworldonline.com/corporate/2025/03/03/656548/honda-to-launch-new-hr-v-by-march-9/",
        "description": "HONDA CARS PHILIPPINES, Inc. (HCPI) is set to launch its new HR-V model, further expanding the car manufacturer’s full-hybrid lineup in the Philippines. “This solidifies the company’s commitment to improving people’s way of life by reducing their carbon footprint,” HCPI said in a statement over the weekend. The new HR-V, HCPI’s third hybrid model in [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656548"
    },
    {
        "title": "Pure electric, pure Audi",
        "link": "https://www.bworldonline.com/velocity/2025/03/03/656388/pure-electric-pure-audi/",
        "description": "AUDI PHILIPPINES has just added to its pure-electric options available in the country with the recent introduction of the Audi Q6 e-tron. The SUV now takes its place as the most affordable BEV (battery electric vehicle) of the Ingolstadt-headquartered premium marque here.",
        "guid": "https://www.bworldonline.com/?p=656388"
    },
    {
        "title": "Rates of Treasury bills, bonds may inch lower",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/03/656463/rates-of-treasury-bills-bonds-may-inch-lower/",
        "description": "RATES of the Treasury bills (T-bills) and Treasury bonds (T-bonds) to be auctioned off this week may inch down to track the broad decline in US Treasury yields amid worries over the world’s largest economy. The Bureau of the Treasury (BTr) will auction off P22 billion in T-bills on Monday, or P7 billion each in [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656463"
    },
    {
        "title": "A beloved holy grail product, reformulated",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/03/656475/a-beloved-holy-grail-product-reformulated/",
        "description": "JAPANESE luxury skincare brand Shiseido is introducing a new formula to a tried-and-true classic, the Ultimune Power-Infusing Serum, as part of its refreshing of the company’s Ultimune line.",
        "guid": "https://www.bworldonline.com/?p=656475"
    },
    {
        "title": "D&L Industries lowers 2025 capex to P1 billion",
        "link": "https://www.bworldonline.com/corporate/2025/03/03/656549/dl-industries-lowers-2025-capex-to-p1-billion/",
        "description": "D&#38;L INDUSTRIES, Inc., a listed producer of specialty food ingredients and oleochemicals, is reducing its capital expenditure (capex) budget for 2025 as it focuses on minor expansions at its Batangas plant, its president said. “We are still making minor expansions, not as big as what we’ve done in the past couple of years, but on [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656549"
    },
    {
        "title": "Beyond his time",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/03/656476/beyond-his-time/",
        "description": "AS LONG AS disco and Manila Sound live, Jose “Pitoy” Moreno, who died in 2018, will not be forgotten. His name and the quality of his clothes will live on through Hotdog’s song “Bongga Ka ’Day” (roughly translated: “You’re fabulous, sister”), which has the line, “suot mo’y gawa ni Pitoy” (what you are wearing was made by Pitoy).",
        "guid": "https://www.bworldonline.com/?p=656476"
    },
    {
        "title": "BDO shares rise after reporting 2024 earnings",
        "link": "https://www.bworldonline.com/corporate/2025/03/03/656550/bdo-shares-rise-after-reporting-2024-earnings/",
        "description": "BDO UNIBANK, Inc. was one of the most actively traded stocks in the local market last week after disclosing its 2024 earnings and partnership with a Japanese bank. Data from the Philippine Stock Exchange showed that P2.94 billion worth of 19.83 million BDO shares were traded from Feb. 24 to 28. The Sy-led bank’s shares [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656550"
    },
    {
        "title": "Ayala group’s next-gen leaders chart path to 200th year with synergy, sustainability",
        "link": "https://www.bworldonline.com/corporate/2025/03/03/656551/ayala-groups-next-gen-leaders-chart-path-to-200th-year-with-synergy-sustainability/",
        "description": "THE Ayala group’s next-generation leaders are focusing on synergy and sustainability to drive the conglomerate’s growth as it approaches its 200th year while navigating economic uncertainties and shifting market dynamics. “We’re nine years away from the year 200. We really feel that our core portfolio will carry us to a leadership position by the year [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656551"
    },
    {
        "title": "MPTC defers SMC merger talks",
        "link": "https://www.bworldonline.com/corporate/2025/03/03/656552/mptc-defers-smc-merger-talks/",
        "description": "METRO PACIFIC Tollways Corp. (MPTC) has deferred merger discussions with San Miguel Corp. (SMC) to focus on raising funds to pay down debt, its chairman said.",
        "guid": "https://www.bworldonline.com/?p=656552"
    },
    {
        "title": "Eastern Communications celebrates growing regional reach and cloud wins, eyeing a digital-ready Philippines in 2025",
        "link": "https://www.bworldonline.com/spotlight/2025/03/03/656342/eastern-communications-celebrates-growing-regional-reach-and-cloud-wins-eyeing-a-digital-ready-philippines-in-2025/",
        "description": "According to the latest e-Conomy SEA report by Google, Temasek, and Bain &#38; Company, the Philippines recorded the fastest-growing internet economy among six Southeast Asian nations in 2024. Driven largely by the rising e-commerce sector, the country’s digital economy surged by 20%, with its gross merchandise value (GMV) rising from $26 billion in 2023 to [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656342"
    },
    {
        "title": "Nat’l fiber backbone phases 2 and 3 to be completed by July",
        "link": "https://www.bworldonline.com/top-stories/2025/03/03/656571/natl-fiber-backbone-phases-2-and-3-to-be-completed-by-july/",
        "description": "THE DEPARTMENT of Information and Communications Technology (DICT) is expecting to deploy the second and third phases of the National Fiber Backbone by July. “We are actually ahead of schedule for the second and third phase because these are expected to be deployed sometime later in 2025. I think before SONA (State of the Nation [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656571"
    },
    {
        "title": "$284-M hot money exits Philippines in January",
        "link": "https://www.bworldonline.com/top-stories/2025/03/03/656572/284-m-hot-money-exits-philippines-in-january/",
        "description": "MORE FOREIGN CAPITAL continued to exit the Philippines, yielding a net outflow for a second straight month in January, according to the Bangko Sentral ng Pilipinas (BSP). Transactions on foreign portfolio investments registered with the central bank through authorized agent banks posted a net outflow of $283.69 million during the month. This was 274.1% higher [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656572"
    },
    {
        "title": "Poll: Inflation likely eased in February",
        "link": "https://www.bworldonline.com/top-stories/2025/03/03/656573/poll-inflation-likely-eased-in-february/",
        "description": "HEADLINE INFLATION likely slowed in February amid the decline in prices of rice and other key commodities, analysts said.",
        "guid": "https://www.bworldonline.com/?p=656573"
    },
    {
        "title": "Okada Manila earns Forbes VERIFIED Responsible Hospitality badge",
        "link": "https://www.bworldonline.com/property/2025/03/04/656873/okada-manila-earns-forbes-verified-responsible-hospitality-badge/",
        "description": "OKADA MANILA on Monday said it is the Philippines’ first integrated resort to receive the Forbes Travel Guide VERIFIED Responsible Hospitality badge. The Forbes Travel Guide VERIFIED Responsible Hospitality badge is a third-party certification that sets the global benchmark for environmentally conscious hospitality.  Developed in collaboration with sustainability partner Hervé Houdré, the Responsible Hospitality badge [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656873"
    },
    {
        "title": "PSE income rose 57.5% to P1.21 billion in 2024",
        "link": "https://www.bworldonline.com/corporate/2025/03/04/656948/pse-income-rose-57-5-to-p1-21-billion-in-2024/",
        "description": "THE PHILIPPINE Stock Exchange, Inc. (PSE) grew its 2024 net income by 57.5% to P1.21 billion from P766.31 million in 2023, following its acquisition of the Philippine Dealing System Holdings Corp. (PDS). Operating revenue declined by 0.23% to P1.398 billion from P1.401 billion the previous year, PSE said in an e-mail statement on Monday. PSE [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656948"
    },
    {
        "title": "Manufacturing Purchasing Managers’ Index (PMI) of select ASEAN economies, February 2025",
        "link": "https://www.bworldonline.com/infographics/2025/03/04/656865/manufacturing-purchasing-managers-index-pmi-of-select-asean-economies-february-2025/",
        "description": "PHILIPPINE MANUFACTURING activity in February expanded at its slowest pace in 11 months amid softer growth in orders and output, data from S&#38;P Global showed. Read the full story.",
        "guid": "https://www.bworldonline.com/?p=656865"
    },
    {
        "title": "Dok Eddie Dorotan: Transforming local politics",
        "link": "https://www.bworldonline.com/opinion/2025/03/04/656798/dok-eddie-dorotan-transforming-local-politics/",
        "description": "Our friend Dok Eddie Dorotan is running for mayor of Irosin, Sorsogon. It was a last-minute decision on his part. He was a reluctant candidate who could not bear the thought of having a political dynasty lording it over his hometown and province. And sadly, money defines Philippine elections and often predicts election outcomes. Dok [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656798"
    },
    {
        "title": "PSBank profit up 15%",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/04/656816/psbank-profit-up-15/",
        "description": "PHILIPPINE SAVINGS Bank’s (PSBank) net income rose by 15% year on year to a record high in 2024, backed by strong loan growth and better asset quality. The thrift banking arm of Metropolitan Bank &#38; Trust Co. posted a net profit of P5.21 billion in 2024, up from P4.53 billion in 2023. This translated to [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656816"
    },
    {
        "title": "Micro-D, Novare Technologies rebrand under NOVARE identity",
        "link": "https://www.bworldonline.com/corporate/2025/03/04/656949/micro-d-novare-technologies-rebrand-under-novare-identity/",
        "description": "TECHNOLOGY company Micro-D International, Inc. and its software development subsidiary Novare Technologies, Inc. have rebranded as NOVARE as they seek to become a leading tech player in the Philippines and across Southeast Asia. The rebranding is expected to help NOVARE focus on delivering purposeful technology in the Philippines and neighboring countries amid advancements in application [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656949"
    },
    {
        "title": "Philippines improves in Democracy Index",
        "link": "https://www.bworldonline.com/infographics/2025/03/04/656866/philippines-improves-in-democracy-index/",
        "description": "The Philippines went up two places to 51st out of 167 countries and territories in the Democracy Index 2024 by London-based Economist Intelligence Unit. Despite the improvement in ranking, the country had an overall score of 6.63, the lowest in three years or since 6.62 in 2021 but still higher than the Asia and Australasia [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656866"
    },
    {
        "title": "To reduce poverty and create jobs, 7-8% economic growth is needed",
        "link": "https://www.bworldonline.com/opinion/2025/03/04/656799/to-reduce-poverty-and-create-jobs-7-8-economic-growth-is-needed/",
        "description": "Last week Canada and India released their fourth quarter (Q4) 2024 GDP data. So, the top 15 largest economies in the world have now provided their full year 2024 data (except Brazil and Russia). Extending the list to encompass the top 60 medium and large economies in the world, one sees that the fastest growing [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656799"
    },
    {
        "title": "Belle Corp. says no plans to buy out Melco’s stake in City of Dreams Manila",
        "link": "https://www.bworldonline.com/property/2025/03/04/656871/belle-corp-says-no-plans-to-buy-out-melcos-stake-in-city-of-dreams-manila/",
        "description": "LISTED firm Belle Corp. said it has no plans to buy out Melco Resorts &#38; Entertainment Ltd.’s stake in the City of Dreams Manila integrated resort in Parañaque City. “Please be advised that while Belle is not in a position to confirm the accuracy of the statements about a possible exit of Melco from the [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656871"
    },
    {
        "title": "UnionBank looks to raise funds via local, foreign markets",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/04/656817/unionbank-looks-to-raise-funds-via-local-foreign-markets/",
        "description": "UNION BANK of the Philippines, Inc. (UnionBank) is looking to raise fresh funds via both the domestic and offshore markets, it said on Monday. UnionBank’s board of directors on Feb. 28 approved the issuance of $800 million in papers out of its euro medium-term note (MTN) program and P30 billion in bonds from its expanded [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656817"
    },
    {
        "title": "Entertainment News (03/04/25)",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/04/656759/entertainment-news-03-04-25/",
        "description": "CIGNAL subscribers can now enjoy even more Hollywood blockbusters, award-winning series, and Korean dramas on Disney+, which carries movies and shows from Disney, Pixar, Marvel, Star Wars, National Geographic, and general entertainment content brand Star. Subscribers can access Cignal Play Premium 149 as well as Disney+ for P700. Current Cignal subscribers can also enjoy Disney+ as an add-on to their existing subscriptions starting at the special rate of P495 per month.",
        "guid": "https://www.bworldonline.com/?p=656759"
    },
    {
        "title": "Raslag secures ERC approval for Pampanga solar plants",
        "link": "https://www.bworldonline.com/corporate/2025/03/04/656950/raslag-secures-erc-approval-for-pampanga-solar-plants/",
        "description": "RASLAG Corp. has received certificates of compliance (CoCs) from the Energy Regulatory Commission (ERC), allowing the operation of its Raslag-1 and Raslag-2 solar plants, which have a combined capacity of 23.2 megawatts (MW) in Mexico, Pampanga, the company said on Monday. The company received CoCs dated Oct. 9, 2024, for the 10.046-MW Pampanga Solar Power [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656950"
    },
    {
        "title": "Cap rates ‘stable’ in Metro Manila real estate, says Colliers",
        "link": "https://www.bworldonline.com/property/2025/03/04/656872/cap-rates-stable-in-metro-manila-real-estate-says-colliers/",
        "description": "COLLIERS PHILIPPINES said the Metro Manila real estate market is seeing “relatively stable” capitalization (cap) rates. “In the near term, property cap rates are expected to be relatively stable,” Paul Vincent Ramirez, senior director and head of valuation at Colliers Philippines, said in an e-mail. According to Colliers’ latest Asia-Pacific Cap Rates Report, the Metro [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656872"
    },
    {
        "title": "Sun Life Philippines, Pioneer Insurance top life and nonlife insurers in premiums in 2024",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/04/656818/sun-life-philippines-pioneer-insurance-top-life-and-nonlife-insurers-in-premiums-in-2024/",
        "description": "SUN LIFE of Canada (Philippines), Inc. (Sun Life Philippines) and Pioneer Insurance and Surety Corp. were the top life and nonlife insurers in 2024 in terms of premium income, data from the Insurance Commission (IC) showed. Sun Life Philippines posted the highest premium income among life insurers last year at P57.155 billion, while Pioneer Insurance [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656818"
    },
    {
        "title": "Marvel’s Daredevil: Born Again brings back beloved characters",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/04/656760/marvels-daredevil-born-again-brings-back-beloved-characters/",
        "description": "ALMOST seven years since the Netflix Daredevil series ended, comic-book fans are bracing themselves for the action crime drama to return — this time under Disney.",
        "guid": "https://www.bworldonline.com/?p=656760"
    },
    {
        "title": "SMPC posts 30% profit decline on weaker selling prices",
        "link": "https://www.bworldonline.com/corporate/2025/03/04/656952/smpc-posts-30-profit-decline-on-weaker-selling-prices/",
        "description": "CONSUNJI-LED Semirara Mining and Power Corp. (SMPC) reported a 30% decline in net income to P19.6 billion for 2024 due to lower coal and electricity selling prices. “The effect of weaker selling prices was cushioned by record-high coal shipments and power generation, increased electricity sales, and a lower government share,” SMPC said in its financial [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656952"
    },
    {
        "title": "Are you ready for 2030?",
        "link": "https://www.bworldonline.com/opinion/2025/03/04/656801/are-you-ready-for-2030/",
        "description": "I remember the Y2K phenomenon when right before the year became 2000, everyone was nervously waiting for the start of the millennium because people said computers could blow up, files may forever be lost, and anything we had saved in our laptops would disappear into thin air. Well, guess what?",
        "guid": "https://www.bworldonline.com/?p=656801"
    },
    {
        "title": "BPI expects to complete rebranding of Robinsons Bank branches by October",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/04/656819/bpi-expects-to-complete-rebranding-of-robinsons-bank-branches-by-october/",
        "description": "BANK of the Philippine Islands (BPI) expects to finish rebranding all branches of Robinsons Bank Corp. (RBC) by October. “By October, all Robinsons Bank branches will be branded as BPI. So, you won’t see any Robinsons branches by October,” BPI Executive Vice-President and RBC President and Chief Executive Officer Elfren Antonio S. Sarte told reporters [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656819"
    },
    {
        "title": "Workout studio Ultra Lagree brings in a new kind of fitness",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/04/656761/workout-studio-ultra-lagree-brings-in-a-new-kind-of-fitness/",
        "description": "CARDIO, weight, and strength training tend to involve a lot of different workout regimens. For fitness-minded Filipinos, this makes working out quite demanding both physically and in terms of schedule — but not in the 45-minute class Ultra Lagree. “Basically it’s low impact, high intensity. You sweat even if you’re moving really slow because the [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656761"
    },
    {
        "title": "RLC unveils first EV charging station, plans to build 2,000 more in five years",
        "link": "https://www.bworldonline.com/corporate/2025/03/04/656953/rlc-unveils-first-ev-charging-station-plans-to-build-2000-more-in-five-years/",
        "description": "ROBINSONS Land Corp. (RLC) said it plans to build 2,000 electric vehicle (EV) charging units within five years to support the transition to electric mobility.  “After this first installation at GBF Center, Robinsons Land plans to extend the GoCharge network by partnering with EV and energy industry leaders to deploy chargers across its various developments [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656953"
    },
    {
        "title": "Security Bank books record 2024 income",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/04/656820/security-bank-books-record-2024-income/",
        "description": "SECURITY BANK Corp. saw its net profit rise by 23.4% to an all-time high in 2024, driven by record revenues. The bank’s attributable net income climbed to a record P11.24 billion last year from P9.11 billion in 2023, it said in a disclosure to the stock exchange on Monday. “This is on the back of [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656820"
    },
    {
        "title": "Fruitas plans more acquisitions",
        "link": "https://www.bworldonline.com/corporate/2025/03/04/656954/fruitas-plans-more-acquisitions/",
        "description": "FOOD and beverage kiosk operator Fruitas Holdings, Inc. said it hopes to continue its acquisition spree as it expands its brand portfolio. “What we are looking at would still be along the lines of our businesses,” Fruitas Chief Financial Adviser Calvin F. Chua said during the Money Talks with Cathy Yang program on One News [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656954"
    },
    {
        "title": "T-bills fetch mostly lower yields on inflation bets",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/04/656821/t-bills-fetch-mostly-lower-yields-on-inflation-bets/",
        "description": "THE GOVERNMENT made a full award of the Treasury bills (T-bills) it offered on Monday at mostly lower rates on expectations that Philippine headline inflation slowed last month and with investors swamping the offer. The Bureau of the Treasury (BTr) raised P22 billion as planned from the T-bills it auctioned off on Monday as total [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656821"
    },
    {
        "title": "MPIC may not revive MRT-3 O&M proposal — Pangilinan",
        "link": "https://www.bworldonline.com/corporate/2025/03/04/656955/mpic-may-not-revive-mrt-3-om-proposal-pangilinan/",
        "description": "METRO PACIFIC Investments Corp. (MPIC) is unlikely to resubmit its unsolicited proposal for the operations and maintenance (O&#38;M) of Metro Rail Transit Line 3 (MRT-3), its chairman said.  “Our submission expired. I do not know where we are now, but I think that expired,” MPIC Chairman Manuel V. Pangilinan told reporters last week.  Mr. Pangilinan [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656955"
    },
    {
        "title": "Business units drive LT Group profit to P28.92B",
        "link": "https://www.bworldonline.com/corporate/2025/03/04/656956/business-units-drive-lt-group-profit-to-p28-92b/",
        "description": "LT GROUP, Inc. recorded a 14% increase in its attributable net income for 2024, reaching a record-high P28.92 billion from P25.42 billion in 2023. Consolidated revenue rose by 11.9% to P129 billion in 2024 from P115.3 billion in 2023, propelled by improved revenues across all segments, LT Group said in a regulatory filing on Monday. [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656956"
    },
    {
        "title": "PHL unlikely to reach IPO target this year, say analysts",
        "link": "https://www.bworldonline.com/corporate/2025/03/04/656957/phl-unlikely-to-reach-ipo-target-this-year-say-analysts/",
        "description": "THE PHILIPPINES is unlikely to meet its target of six initial public offerings (IPOs) this year as issuers wait for improved market conditions and higher valuations, according to analysts.",
        "guid": "https://www.bworldonline.com/?p=656957"
    },
    {
        "title": "RRR cut unlikely to boost bank lending",
        "link": "https://www.bworldonline.com/top-stories/2025/03/04/656911/rrr-cut-unlikely-to-boost-bank-lending/",
        "description": "REDUCING the reserve requirement ratio (RRR) for big banks will not necessarily lead to increased lending, Pantheon Macroeconomics said, as elevated interest rates continue to dampen demand for credit. “The thing is, RRR cuts are a supply-side measure, which doesn’t directly address the prevailing deficiencies in credit demand, depressed in part by still-high interest rates,” [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656911"
    },
    {
        "title": "Proposed local online gambling ban to hurt NG revenues — analysts",
        "link": "https://www.bworldonline.com/top-stories/2025/03/04/656912/proposed-local-online-gambling-ban-to-hurt-ng-revenues-analysts/",
        "description": "THE PROPOSED BAN on Philippine inland gaming operators (PIGOs) may hurt National Government (NG) revenues as well as stocks of listed gaming-related companies, analysts said.",
        "guid": "https://www.bworldonline.com/?p=656912"
    },
    {
        "title": "Peso may sink to P62-per-dollar level this year",
        "link": "https://www.bworldonline.com/top-stories/2025/03/04/656913/peso-may-sink-to-p62-per-dollar-level-this-year/",
        "description": "THE PHILIPPINE PESO could sink to as low as P62 per dollar this year as a dovish central bank and increased liquidity in the financial system weigh on the currency, Bank of America (BofA) Global Research said. “We believe policy desire for easier financial conditions remains a negative for the peso,” it said in a [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656913"
    },
    {
        "title": "Manufacturing growth slows in Feb.",
        "link": "https://www.bworldonline.com/top-stories/2025/03/04/656914/manufacturing-growth-slows-in-feb/",
        "description": "PHILIPPINE MANUFACTURING activity in February expanded at its slowest pace in 11 months amid softer growth in orders and output, data from S&#038;P Global showed.",
        "guid": "https://www.bworldonline.com/?p=656914"
    },
    {
        "title": "AXA Philippines launches life insurance product with guaranteed annual payouts",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/05/657127/axa-philippines-launches-life-insurance-product-with-guaranteed-annual-payouts/",
        "description": "AXA PHILIPPINES Life and General Insurance Corp. has launched a life insurance product with guaranteed payouts yearly. AXA Secure Future provides life insurance coverage as well as yearly payouts of 8% of the basic sum insured beginning on the eighth to the 20th year at a seven-year pay plan period, independent of market conditions, the [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657127"
    },
    {
        "title": "AI agents to streamline Philippine businesses’ workload — Salesforce",
        "link": "https://www.bworldonline.com/bw-launchpad/2025/03/05/657193/ai-agents-to-streamline-philippine-businesses-workload-salesforce/",
        "description": "PHILIPPINE companies should use artificial intelligence (AI) agents to streamline their workload and focus on more complex tasks, according to US-based customer relationship management platform Salesforce. “This helps businesses in the Philippines scale and alleviate the workload of overwhelmed teams so that they can focus on creative and strategic tasks,” Salesforce said in a statement. [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657193"
    },
    {
        "title": "ACEN Australia to develop pumped hydro project",
        "link": "https://www.bworldonline.com/corporate/2025/03/05/657206/acen-australia-to-develop-pumped-hydro-project/",
        "description": "ACEN AUSTRALIA, a subsidiary of ACEN Corp., will develop an 800-megawatt (MW) pumped hydro project in Australia after securing a long-term energy service agreement. ACEN Australia’s Phoenix Pumped Hydro was selected for a long-term energy service agreement supporting New South Wales’ (NSW) Electricity Infrastructure Roadmap, NSW said in a media release last week. For the [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657206"
    },
    {
        "title": "Philippines slips to 21st place in 40-Country Global Youth Index",
        "link": "https://www.bworldonline.com/infographics/2025/03/05/657166/philippines-slips-to-21st-place-in-40-country-global-youth-index/",
        "description": "The Philippines dropped two notches to 21st out of 40 countries with a score of 50.9 out of 100 in the latest edition of the Global Youth Index by Saudi Arabian nonproﬁt organization Misk Foundation. The index measures factors that determine youth development worldwide. The Philippines tied with Indonesia.",
        "guid": "https://www.bworldonline.com/?p=657166"
    },
    {
        "title": "Atlanta Fed shock sounds ‘Trumpcession’ warning",
        "link": "https://www.bworldonline.com/opinion/2025/03/05/657089/atlanta-fed-shock-sounds-trumpcession-warning/",
        "description": "If you haven’t heard the term before, you will now, as a closely watched real-time US economic weathervane is signaling that the US’ GDP is shrinking at the fastest pace since the pandemic lockdown. The Atlanta Fed’s GDPNow model estimate for annualized growth in the current quarter was a stunning -2.8% on Monday, down from [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657089"
    },
    {
        "title": "AIA Philippines looks to incorporate mental health benefits into its products",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/05/657128/aia-philippines-looks-to-incorporate-mental-health-benefits-into-its-products/",
        "description": "AIA PHILIPPINES Life and General Insurance Co., Inc. is looking to integrate mental health benefits into its products as its recent study showed strong demand for related services. “First and foremost, we’re trying to raise awareness about the needs people have relating to their mental health and sustainable mental health. We’re raising awareness, breaking down [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657128"
    },
    {
        "title": "Small businesses told to secure payment system against scams",
        "link": "https://www.bworldonline.com/bw-launchpad/2025/03/05/657194/small-businesses-told-to-secure-payment-system-against-scams/",
        "description": "PHILIPPINE micro, small and medium enterprises (MSMEs) should invest in payment security to stop unscrupulous groups from stealing their money through malicious QR (quick response) codes, according to industry experts.",
        "guid": "https://www.bworldonline.com/?p=657194"
    },
    {
        "title": "NPC seeks ERC approval to recover P21 million in forex-related costs",
        "link": "https://www.bworldonline.com/corporate/2025/03/05/657207/npc-seeks-erc-approval-to-recover-p21-million-in-forex-related-costs/",
        "description": "STATE-RUN National Power Corp. (NPC) is seeking approval from the Energy Regulatory Commission (ERC) to recover costs incurred due to foreign exchange (forex) fluctuations, amounting to approximately P21 million. In its filing with the ERC, promulgated on Jan. 22, NPC is seeking to recover deferred accounting adjustments (DAA) corresponding to additional costs from foreign exchange [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657207"
    },
    {
        "title": "Megawide Construction Corp. to conduct Special Stockholders’ Meeting via remote communication on March 27",
        "link": "https://www.bworldonline.com/spotlight/2025/03/05/657143/megawide-construction-corp-to-conduct-special-stockholders-meeting-via-remote-communication-on-march-27/",
        "description": "&#160; Spotlight is BusinessWorld’s sponsored section that allows advertisers to amplify their brand and connect with BusinessWorld’s audience by publishing their stories on the BusinessWorld Web site. For more information, send an email to online@bworldonline.com. Join us on Viber at https://bit.ly/3hv6bLA to get more updates and subscribe to BusinessWorld’s titles and get exclusive content through www.bworld-x.com.",
        "guid": "https://www.bworldonline.com/?p=657143"
    },
    {
        "title": "Change or continuity? Honoring and strengthening commitments amid shifting times",
        "link": "https://www.bworldonline.com/opinion/2025/03/05/657090/change-or-continuity-honoring-and-strengthening-commitments-amid-shifting-times/",
        "description": "Diplomatic relations are not confined to bilateral, country-to-country ties. Often, there are wider alliances and groupings that must be pursued because each nation has something unique to bring to the table. Trilateral collaborations are an important way to participate in global and regional geopolitics with countries sharing the same values and priorities and even facing [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657090"
    },
    {
        "title": "PERA contributions rose to P491.4 million at end-2024",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/05/657129/pera-contributions-rose-to-p491-4-million-at-end-2024/",
        "description": "FILIPINOS’ Personal Equity and Retirement Account (PERA) contributions jumped by 24% year on year at end-2024, data from the Bangko Sentral ng Pilipinas showed. Accumulated contributions to PERA climbed to P491.4 million at end-2024 from P396.3 million as of 2023, the central bank said. The total number of PERA contributors likewise rose by 6.4% to [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657129"
    },
    {
        "title": "Meralco, KEPCO partner to explore new energy technology",
        "link": "https://www.bworldonline.com/corporate/2025/03/05/657208/meralco-kepco-partner-to-explore-new-energy-technology/",
        "description": "POWER DISTRIBUTOR Manila Electric Co. (Meralco) and Korea Electric Power Corp. (KEPCO) have entered into a partnership to accelerate the adoption of new technology in the Philippine energy industry.  The companies signed a memorandum of understanding (MoU) to foster technical cooperation and exchange programs in the field of new energy technology, Meralco said in a [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657208"
    },
    {
        "title": "Throwing the baby out with the bathwater",
        "link": "https://www.bworldonline.com/opinion/2025/03/05/657091/throwing-the-baby-out-with-the-bathwater/",
        "description": "I fervently hope that the decision of the Trump Administration to freeze international development aid is temporary.",
        "guid": "https://www.bworldonline.com/?p=657091"
    },
    {
        "title": "Yields on Treasury bonds climb",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/05/657130/yields-on-treasury-bonds-climb/",
        "description": "THE GOVERNMENT made a full award of the reissued Treasury bonds (T-bonds) it offered on Tuesday even as the average rate was above secondary market levels, with investors seeking to lock in higher yields ahead of an expected liquidity boost from cuts in banks’ required reserves by month-end. The Bureau of the Treasury (BTr) raised [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657130"
    },
    {
        "title": "San Miguel Corp. to hold Special Meeting of Stockholders on March 27 via remote communication",
        "link": "https://www.bworldonline.com/spotlight/2025/03/05/657046/san-miguel-corp-to-hold-special-meeting-of-stockholders-on-march-27-via-remote-communication/",
        "description": "NOTICE OF SPECIAL MEETING OF THE STOCKHOLDERS March 27, 2025 The Special Meeting of the Stockholders of San Miguel Corporation will be held on Thursday, March 27, 2025 at 2:00 P.M. The Company will not hold a physical meeting and the meeting will be conducted via remote communication and livestreamed at the Company’s website. Stockholders [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657046"
    },
    {
        "title": "Petron plans to offer up to P32B in retail bonds",
        "link": "https://www.bworldonline.com/corporate/2025/03/05/657210/petron-plans-to-offer-up-to-p32b-in-retail-bonds/",
        "description": "ANG-LED oil refiner Petron Corp. announced on Tuesday that it plans to offer up to P32 billion worth of retail bonds. In a regulatory filing, the company said its board of directors approved the offering and issuance of up to P25 billion in retail bonds, with an oversubscription option of up to P7 billion. The [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657210"
    },
    {
        "title": "Arts & Culture (03/05/25)",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/05/657039/arts-culture-03-05-25/",
        "description": "CCP lights up main building, theater for Women’s Month THE Main Building and the Tanghalang Ignacio Gimenez of the Cultural Center of the Philippines (CCP) are bathed in vibrant purple this March to commemorate National Women’s Month. Purple symbolizes justice, dignity, and unwavering commitment to the advancement of women’s rights.  Through this light display, the [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657039"
    },
    {
        "title": "NLEX starts construction of NLEX-C5 Northlink",
        "link": "https://www.bworldonline.com/corporate/2025/03/05/657211/nlex-starts-construction-of-nlex-c5-northlink/",
        "description": "NLEX CORP., a unit of Metro Pacific Tollways Corp. (MPTC), has started construction of the P2.2-billion NLEX-C5 Northlink Section 1A.  “The project plays an integral role in our ongoing expansion, which aims to improve access between NLEX, Valenzuela City, and Quezon City,” MPTC President and Chief Executive Officer Jose Ma. K. Lim said during the [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657211"
    },
    {
        "title": "Denise Weldon: Guided by light",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/05/657040/denise-weldon-guided-by-light/",
        "description": "WHILE it is easy to find oneself overwhelmed by the perpetual dance of stimuli that fills the world today, photographer Denise Weldon finds it is useful to be guided by light, to be able to zero in on the rare sense of quiet and grace that can often emerge from the shadows. Be it the [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657040"
    },
    {
        "title": "Original Filipino musical Pilato takes the stage",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/05/657044/original-filipino-musical-pilato-takes-the-stage/",
        "description": "IN AN ERA of misinformation, creative agency The Corner Studio is entering the theater scene with its inaugural production, Pilato, which questions just what the truth is, with its story of Pontius Pilate. The musical will take audiences through his divisive decision regarding the fate of Jesus Christ, and how this came to be. “It’s [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657044"
    },
    {
        "title": "TIN validation coming to SEC platforms",
        "link": "https://www.bworldonline.com/corporate/2025/03/05/657212/tin-validation-coming-to-sec-platforms/",
        "description": "THE SECURITIES and Exchange Commission (SEC) will soon mandate the tax identification number (TIN) validation service across its online systems to enhance monitoring efforts. “Please be advised that the SEC will soon implement the TIN validation service across all SEC applicable online systems,” the corporate regulator said in a notice dated March 3 on its [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657212"
    },
    {
        "title": "FILRT net income down 6.3% in 2024",
        "link": "https://www.bworldonline.com/corporate/2025/03/05/657213/filrt-net-income-down-6-3-in-2024/",
        "description": "GOTIANUN-LED Filinvest REIT Corp. (FILRT) recorded a 6.3% decline in net income for 2024, falling to P1.63 billion from P1.74 billion in 2023 due to lower rental revenue. Revenue dropped by 4.9% to P2.84 billion in 2024 from P2.99 billion in 2023, FILRT said in a regulatory filing on Tuesday. Rental revenue decreased by 5.2% [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657213"
    },
    {
        "title": "RLC says its P30.4-B bonds kept highest credit rating",
        "link": "https://www.bworldonline.com/corporate/2025/03/05/657214/rlc-says-its-p30-4-b-bonds-kept-highest-credit-rating/",
        "description": "GOKONGWEI-LED Robinsons Land Corp. (RLC) has retained the highest credit rating for its outstanding P30.4-billion bonds, the company said on Tuesday. The Philippine Rating Services Corp. (PhilRatings) has affirmed its PRS Aaa rating with a stable outlook for RLC’s P30.4-billion outstanding bonds, the company said in a regulatory filing. Obligations rated PRS Aaa are considered [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657214"
    },
    {
        "title": "Themis Group sets mandatory tender offer for Ferronoux shares",
        "link": "https://www.bworldonline.com/corporate/2025/03/05/657215/themis-group-sets-mandatory-tender-offer-for-ferronoux-shares/",
        "description": "INVESTMENT FIRM Themis Group Corp. plans to conduct a mandatory tender offer for publicly held shares of Ferronoux Holdings, Inc. as part of its backdoor listing process. In a regulatory filing on Tuesday, Ferronoux said Themis Group would conduct a mandatory tender offer for 128.29 million publicly held common shares. The company did not disclose [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657215"
    },
    {
        "title": "Regulator still targets cashless, unified toll rollout this year",
        "link": "https://www.bworldonline.com/corporate/2025/03/05/657216/regulator-still-targets-cashless-unified-toll-rollout-this-year/",
        "description": "THE TOLL Regulatory Board (TRB) expects the simultaneous implementation of the cashless and unified toll collection system within the year despite the Transportation department’s move to postpone the full cashless toll operation at major expressways.",
        "guid": "https://www.bworldonline.com/?p=657216"
    },
    {
        "title": "RL Commercial REIT to be included in FTSE index",
        "link": "https://www.bworldonline.com/spotlight/2025/03/05/656716/rl-commercial-reit-to-be-included-in-ftse-index/",
        "description": "RL Commercial REIT, Inc. (RCR), the real estate investment trust (REIT) arm of Robinsons Land Corp. (RLC), is poised to be included in the Financial Times Stock Exchange (FTSE) Global All Cap Index, which is expected to enhance the company’s visibility among international investors and drive higher trading activity. RCR secured its inclusion after meeting [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656716"
    },
    {
        "title": "SM Prime aims for upscale residential market after record 2024 performance",
        "link": "https://www.bworldonline.com/spotlight/2025/03/05/656717/sm-prime-aims-for-upscale-residential-market-after-record-2024-performance/",
        "description": "SM Prime Holdings, Inc. (SM Prime) is setting its sights on the premium residential market after posting a record-breaking financial performance in 2024. SM Prime recently announced a historic net income of P45.6 billion, up 14% from the previous year, as consolidated revenues climbed 10% to an all-time high of P140.4 billion. The residential segment [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=656717"
    },
    {
        "title": "Philippines to be well-insulated from Trump’s ‘tit-for-tat’ tariffs, analysts say",
        "link": "https://www.bworldonline.com/top-stories/2025/03/05/657175/philippines-to-be-well-insulated-from-trumps-tit-for-tat-tariffs-analysts-say/",
        "description": "THE PHILIPPINES is seen to be well-insulated from tit-for-tat retaliatory tariffs, analysts said, as its trade balance and currency are not likely to be significantly affected compared with its regional neighbors. “Here in the Philippines, we are the ones importing more rather than exporting. That’s why we think we’re kind of insulated in terms of [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657175"
    },
    {
        "title": "Philippine homeownership dreams stifled by rising costs and stagnant wages",
        "link": "https://www.bworldonline.com/top-stories/2025/03/05/657173/philippine-homeownership-dreams-stifled-by-rising-costs-and-stagnant-wages/",
        "description": "MICHAEL JOSEPH D. SERVER, a 28-year-old Filipino entrepreneur, has been renting a condominium unit in Quezon City near the Philippine capital for two years now and doesn’t plan to buy his own house soon.",
        "guid": "https://www.bworldonline.com/?p=657173"
    },
    {
        "title": "NG debt rises to new high of P16.3T",
        "link": "https://www.bworldonline.com/top-stories/2025/03/05/657174/ng-debt-rises-to-new-high-of-p16-3t/",
        "description": "THE NATIONAL Government’s (NG) outstanding debt hit a fresh high of P16.31 trillion at the end of January as it ramped up borrowings, the Bureau of the Treasury (BTr) said on Tuesday. Preliminary data from the BTr showed that outstanding debt jumped by 1.63% or P261.47 billion to P16.31 trillion from P16.05 trillion at end-2024. [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657174"
    },
    {
        "title": "Palace says it won’t appeal imminent PhilHealth ruling",
        "link": "https://www.bworldonline.com/the-nation/2025/03/05/657532/palace-says-it-wont-appeal-imminent-philhealth-ruling/",
        "description": "MALACAÑANG on Wednesday said it would comply with the Supreme Court’s forthcoming ruling on lawsuits questioning the transfer of billions of pesos of funds from Philippine Health Insurance Corp. (PhilHealth) to the national Treasury. “Whatever the Supreme Court orders, we will comply with it,” Presidential Communications Office Undersecretary Claire B. Castro told a news briefing [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657532"
    },
    {
        "title": "China monitored Philippine supply  mission to grounded warship at shoal",
        "link": "https://www.bworldonline.com/the-nation/2025/03/05/657534/china-monitored-philippine-supply-mission-to-grounded-warship-at-shoal/",
        "description": "THE Chinese Coast Guard on Wednesday said it monitored a Philippine civilian boat delivering supplies to an “illegally grounded” warship at the disputed Second Thomas Shoal in the South China Sea on Tuesday. China urges the Philippines to honor its commitments, stop hyping up incidents in the area and work with China to manage the [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657534"
    },
    {
        "title": "How PSEi member stocks performed — March 5, 2025",
        "link": "https://www.bworldonline.com/corporate/2025/03/06/657441/how-psei-member-stocks-performed-march-5-2025/",
        "description": "Here’s a quick glance at how PSEi stocks fared on Wednesday, March 5, 2025.",
        "guid": "https://www.bworldonline.com/?p=657441"
    },
    {
        "title": "Dining In/Out",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/06/657333/dining-in-out-2/",
        "description": "LongHorn Steakhouse opening at Shangri-La Plaza Mall INTERNATIONAL CHAIN LongHorn Steakhouse will be opening this month at Streetscape, Shangri-La Plaza Mall. The restaurant brings steak cravings to a fore with one-of-a-kind proprietary seasonings, and choice cuts like the bone-in Outlaw Ribeye, Flo’s Filet (center cut with signature seasoning), the New York Strip, and the Fire-Grilled [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657333"
    },
    {
        "title": "The comfort of routine",
        "link": "https://www.bworldonline.com/opinion/2025/03/06/657377/the-comfort-of-routine/",
        "description": "When a personal health crisis arises, requiring long hospitalization, it disrupts the flow of the day one is used to. A new set of activities take over, like having one’s blood extracted at 4 a.m. — Sorry to wake you up sir. Gone is the previ-ously predictable set of meetings and lunches, the old routine. [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657377"
    },
    {
        "title": "Qualcomm banks on Southeast Asia’s AI boom to drive PC chip deman",
        "link": "https://www.bworldonline.com/technology/2025/03/06/657321/qualcomm-banks-on-southeast-asias-ai-boom-to-drive-pc-chip-deman/",
        "description": "SINGAPORE — Qualcomm Technologies, Inc. expects the rapid adoption of artificial intelligence (AI) technologies in Southeast Asia to boost demand for laptops powered by its Snapdragon X Series chips. Qualcomm on Feb. 26 held its first-ever Snapdragon X Series Southeast Asia Media Summit here at Sentosa island to highlight their belief in the region’s potential [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657321"
    },
    {
        "title": "On Meralco rates and NGCP’s cost of capital",
        "link": "https://www.bworldonline.com/opinion/2025/03/06/657373/on-meralco-rates-and-ngcps-cost-of-capital/",
        "description": "former Energy Undersecretary and now “consumer advocate” recently attacked the Manila Electric Co. (Meralco) as being “unjust and unfair… charging households more than businesses,” referring to the lower rates for commercial and industrial customers compared to those of residential customers. Petronilo Ilagan alleged that residential customers are subsidizing businesses. He used old numbers to make [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657373"
    },
    {
        "title": "Kenneth Cobonpue goes into the restaurant biz with Fable",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/06/657350/kenneth-cobonpue-goes-into-the-restaurant-biz-with-fable/",
        "description": "KENNETH COBONPUE has an enviable client list, with celebrities both local and international, a sprinkling of businesspeople, and royalty. Now you can join that list, not with his furniture, but with a meal. On Feb. 19, Mr. Cobonpue opened his new space at the Grand Hyatt in BGC, Taguig, moving his showroom there from Greenbelt, [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657350"
    },
    {
        "title": "SLI says Sta. Monica Lake Residences to reflect Manaoag’s religious heritage",
        "link": "https://www.bworldonline.com/corporate/2025/03/06/657474/sli-says-sta-monica-lake-residences-to-reflect-manaoags-religious-heritage/",
        "description": "LISTED PROPERTY DEVELOPER Sta. Lucia Land, Inc. (SLI) said its Sta. Monica Lake Residences project in Pangasinan will have a Spanish-Mediterranean design reflecting Manaoag’s religious heritage. “Set to be the first lake community in Manaoag, Pangasinan, Sta. Monica Lake Residences is one of the latest flagship projects of Sta. Lucia Land in North Luzon,” SLI [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657474"
    },
    {
        "title": "Restaurant Review",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/06/657360/restaurant-review/",
        "description": "Bistrot Le Coucou: begrudgingly delicious By Joseph L. Garcia, Senior Reporter WE’RE NOT placed so high up in the world to immediately take expensive things at face value: we’re not too shy to dunk on an expensive restaurant now and then. We were very, very prepared to dunk on Bistrot Le Coucou, the latest offering [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657360"
    },
    {
        "title": "Mobile app users in PHL more vulnerable to malware",
        "link": "https://www.bworldonline.com/technology/2025/03/06/657323/mobile-app-users-in-phl-more-vulnerable-to-malware/",
        "description": "By Beatriz Marie D. Cruz, Reporter FILIPINO mobile application users experience malware attacks more often than the global average, with brands needing to work double time to increase their safeguards against fraud as attacks become more advanced, according to mobile app security company Appdome. The average infection rate of malware on Philippine mobile devices is [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657323"
    },
    {
        "title": "Controlling the narrative",
        "link": "https://www.bworldonline.com/opinion/2025/03/06/657375/controlling-the-narrative/",
        "description": "he Presidential Communications Office (PCO) has proposed the creation of a regulatory body to monitor fake news and identify troll farms. Meanwhile, in the House of Representatives, House Bill No. 1177 seeks to impose a 12-year jail term and a P2-million fine for operators of online troll farms. At the same time, a House committee [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657375"
    },
    {
        "title": "John Paul Ang named director of Ginebra San Miguel",
        "link": "https://www.bworldonline.com/corporate/2025/03/06/657484/john-paul-ang-named-director-of-ginebra-san-miguel/",
        "description": "LISTED LIQUOR MANUFACTURER Ginebra San Miguel, Inc. (GSMI) has appointed John Paul L. Ang as director. Mr. Ang, the eldest son of tycoon Ramon S. Ang, was elected to fill the vacancy left by Francisco S. Alejo III, whose resignation took effect on Jan. 31, GSMI said in a regulatory filing on Wednesday. Mr. Ang [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657484"
    },
    {
        "title": "Megawide Construction Corp. to conduct Special Stockholders’ Meeting via remote communication on March 27",
        "link": "https://www.bworldonline.com/spotlight/2025/03/06/657155/megawide-construction-corp-to-conduct-special-stockholders-meeting-via-remote-communication-on-march-27-2/",
        "description": "&#160; Spotlight is BusinessWorld’s sponsored section that allows advertisers to amplify their brand and connect with BusinessWorld’s audience by publishing their stories on the BusinessWorld Web site. For more information, send an email to online@bworldonline.com. Join us on Viber at https://bit.ly/3hv6bLA to get more updates and subscribe to BusinessWorld’s titles and get exclusive content through www.bworld-x.com.",
        "guid": "https://www.bworldonline.com/?p=657155"
    },
    {
        "title": "Taiwan is not just Taipei (though it is not a bad place to start a visit)",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/06/657369/taiwan-is-not-just-taipei-though-it-is-not-a-bad-place-to-start-a-visit-2/",
        "description": "For the record, there is more to Taiwan than Taipei. The Taiwan Tourism Administration (TTA) wants international visitors, including Filipinos, to explore cities beyond Taipei to experience the country’s culture, history, nature, and cuisine in a showcase of Taiwan’s charm. “We want to see more Filipino visitors to Taiwan in addition to a higher percentage [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657369"
    },
    {
        "title": "New ways: Easier said than done",
        "link": "https://www.bworldonline.com/opinion/2025/03/06/657376/new-ways-easier-said-than-done/",
        "description": "(Conclusion) Technologies like AI, theoretically, could make basic, repetitive jobs obsolete. But not in Philippine farms, forestry, and fisheries (AFF) — at least not yet — where workers have accounted for more than a fifth to about a fourth of the country’s jobs since 20171. Our youth (like their peers elsewhere) have been shunning farms [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657376"
    },
    {
        "title": "The Outlets at Lipa rebrands as The Outlets @LIMA Estate",
        "link": "https://www.bworldonline.com/corporate/2025/03/06/657489/the-outlets-at-lipa-rebrands-as-the-outlets-lima-estate/",
        "description": "ABOITIZ INFRACAPITAL, Inc. (AIC) has rebranded Batangas’ first and largest outdoor lifestyle mall, The Outlets at Lipa, as The Outlets @LIMA Estate. The rebranding of the mall, located within the 826-hectare (ha) LIMA Estate, aligns with the estate’s vision of becoming a fully integrated, future-ready destination, AIC said in a statement late Tuesday. “As LIMA [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657489"
    },
    {
        "title": "Wyn Power building 50-MW solar farm in Batangas",
        "link": "https://www.bworldonline.com/corporate/2025/03/06/657492/wyn-power-building-50-mw-solar-farm-in-batangas/",
        "description": "RENEWABLE ENERGY developer Wyn Power Corp. is set to begin construction on its 50-megawatt-peak (MWp) solar power project in Taysan, Batangas, valued at P1.5 billion. The company officially broke ground on the ground-mounted solar photovoltaic project, which will deliver electricity through Batangas Electric Cooperative II (BATELEC II), it said in a media release on Wednesday. [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657492"
    },
    {
        "title": "San Miguel Corp. to hold Special Meeting of Stockholders on March 27 via remote communication",
        "link": "https://www.bworldonline.com/spotlight/2025/03/06/657047/san-miguel-corp-to-hold-special-meeting-of-stockholders-on-march-27-via-remote-communication-2/",
        "description": "NOTICE OF SPECIAL MEETING OF THE STOCKHOLDERS March 27, 2025 The Special Meeting of the Stockholders of San Miguel Corporation will be held on Thursday, March 27, 2025 at 2:00 P.M. The Company will not hold a physical meeting and the meeting will be conducted via remote communication and livestreamed at the Company’s website. Stockholders [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657047"
    },
    {
        "title": "Globe’s Darius Delgado joins World Broadband Association board",
        "link": "https://www.bworldonline.com/corporate/2025/03/06/657497/globes-darius-delgado-joins-world-broadband-association-board/",
        "description": "GLOBE TELECOM, Inc. announced on Wednesday the appointment of its chief commercial officer as a board member of the World Broadband Association (WBBA). In a media release on Wednesday, Globe said Darius Jose R. Delgado, the company’s chief commercial officer, has joined the board of the Geneva-based WBBA. Established in 2021, WBBA is a multilateral, [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657497"
    },
    {
        "title": "Berde, Thai partner to roll out 300-MW projects in Thailand",
        "link": "https://www.bworldonline.com/corporate/2025/03/06/657500/berde-thai-partner-to-roll-out-300-mw-projects-in-thailand/",
        "description": "RENEWABLE ENERGY company Berde Renewables, Inc. has formed a joint venture with Thailand-based Power Systems and Solutions Co. Ltd. (PSS) to develop 300 megawatts (MW) of renewable energy projects in Thailand over the next three years. The joint venture aims to develop solar photovoltaic, battery storage, and hybrid energy projects to meet the growing demand [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657500"
    },
    {
        "title": "SMFB income up 7% to P40.9B in 2024",
        "link": "https://www.bworldonline.com/corporate/2025/03/06/657494/smfb-income-up-7-to-p40-9b-in-2024/",
        "description": "ANG-LED San Miguel Food and Beverage, Inc. (SMFB) posted a 7% increase in net income for 2024, reaching P40.9 billion from P38.1 billion in 2023, driven by higher volumes and market expansion efforts. Consolidated sales rose by 6% to P400.9 billion in 2024 from P379.8 billion in 2023, SMFB said in an e-mail statement on [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657494"
    },
    {
        "title": "Topline in talks with ‘strategic  investor’ ahead of P900-M IPO",
        "link": "https://www.bworldonline.com/corporate/2025/03/06/657503/topline-in-talks-with-strategic-investor-ahead-of-p900-m-ipo/",
        "description": "CEBU-BASED fuel retailer Top Line Business Development Corp. (Topline) said it is in talks with a “substantial strategic investor” as it prepares for its P900-million initial public offering (IPO). “Potentially, we’re looking at a substantial strategic investor coming in. It’s a strategic investor from a logistics standpoint. We’ve already spoken with them. They’ve shown a [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657503"
    },
    {
        "title": "ACEN to invest $13M in solar projects in Malaysia",
        "link": "https://www.bworldonline.com/corporate/2025/03/06/657505/acen-to-invest-13m-in-solar-projects-in-malaysia/",
        "description": "ACEN CORP. is expanding its global presence as its joint venture firm plans to invest $13 million (approximately P748 million) in the development of solar power projects in Malaysia with a total capacity of 80 mega-watts (MW). IBV ACEN Renewables Asia Pte. Ltd. is in the final stages of assessing and finalizing an investment in [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657505"
    },
    {
        "title": "SM Prime allots nearly P15B  for 5-year hospitality growth",
        "link": "https://www.bworldonline.com/corporate/2025/03/06/657507/sm-prime-allots-nearly-p15b-for-5-year-hospitality-growth/",
        "description": "SM PRIME Holdings, Inc. said its hotels and convention centers unit is investing nearly P15 billion to support a five-year expansion plan that will broaden its offerings. SM Prime’s SM Hotels and Convention Corp. (SMHCC) aims to develop eight new hotels and two convention centers across the country within the five-year period. The expansion will [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657507"
    },
    {
        "title": "Nickel Asia, DMCI Mining to partner on nickel processing plant in PHL",
        "link": "https://www.bworldonline.com/top-stories/2025/03/06/657537/nickel-asia-dmci-mining-to-partner-on-nickel-processing-plant-in-phl/",
        "description": "NICKEL ASIA Corp. (NAC) and DMCI Mining Corp. on Wednesday said they are studying the feasibility of developing a nickel processing plant in the country. This comes as the government is considering a ban on raw nickel ore exports to boost domestic processing. In a joint statement, NAC and DMCI Mining said they signed a [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657537"
    },
    {
        "title": "Philippine banks’ exposure to real estate sector rises at end-2024",
        "link": "https://www.bworldonline.com/top-stories/2025/03/06/657539/philippine-banks-exposure-to-real-estate-sector-rises-at-end-2024/",
        "description": "THE EXPOSURE of Philippine banks and trust entities to the property sector increased at the end of December amid a rise in residential and commercial real estate loans, data from the Bangko Sentral ng Pilipinas (BSP) showed. Banks’ real estate exposure ratio rose to 19.75% as of end-December from 19.55% at end-September. However, it was [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657539"
    },
    {
        "title": "Inflation rates in the Philippines",
        "link": "https://www.bworldonline.com/infographics/2025/03/06/657549/inflation-rates-in-the-philippines-17/",
        "description": "HEADLINE INFLATION sharply decelerated in February to its slowest print in five months, preliminary data from the Philippine Statistics Authority (PSA) showed.  Read the full story.",
        "guid": "https://www.bworldonline.com/?p=657549"
    },
    {
        "title": "Inflation eases sharply in February",
        "link": "https://www.bworldonline.com/top-stories/2025/03/06/657543/inflation-eases-sharply-in-february/",
        "description": "By Luisa Maria Jacinta C. Jocson, Reporter HEADLINE INFLATION sharply decelerated in February to its slowest print in five months, preliminary data from the Philippine Statistics Authority (PSA) showed. The consumer price index (CPI) eased to 2.1% in February from 2.9% in January and 3.4% a year ago. It was below the 2.2%-3% forecast from [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657543"
    },
    {
        "title": "How much did each commodity group contribute to February inflation?",
        "link": "https://www.bworldonline.com/infographics/2025/03/06/657547/how-much-did-each-commodity-group-contribute-to-february-inflation-3/",
        "description": "HEADLINE INFLATION sharply decelerated in February to its slowest print in five months, preliminary data from the Philippine Statistics Authority (PSA) showed.  Read the full story.",
        "guid": "https://www.bworldonline.com/?p=657547"
    },
    {
        "title": "Job Gains by Industry (January 2025 vs January 2024, in thousands)",
        "link": "https://www.bworldonline.com/infographics/2025/03/07/657718/job-gains-by-industry-january-2025-vs-january-2024-in-thousands/",
        "description": "THE PHILIPPINES’ unemployment rate in January rose to its highest level in six months, as hiring declined after the holiday season, the statistics agency said on Thursday. Read the full story.",
        "guid": "https://www.bworldonline.com/?p=657718"
    },
    {
        "title": "SMIC says $500-M bond recognized at Asset Triple A Awards 2025",
        "link": "https://www.bworldonline.com/corporate/2025/03/07/657740/smic-says-500-m-bond-recognized-at-asset-triple-a-awards-2025/",
        "description": "SM INVESTMENTS Corp. (SMIC) said it received recognition at The Asset Triple A Sustainable Finance Awards 2025 for its $500-million bond offering in 2024, which was named the Best Bond for Corporate in the Philippines under the Best Significant Deal category. “As we continue to diversify and expand across various sectors, this achievement further strengthens [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657740"
    },
    {
        "title": "Future-proofing Philippine businesses",
        "link": "https://www.bworldonline.com/opinion/2025/03/07/657634/future-proofing-philippine-businesses/",
        "description": "The Singapore Management University (SMU) is a partner of De La Salle University (DLSU), and I am deeply privileged, as a member of SMU’s International Advisory Council, to have participated in a two-day learning journey organized by SMU in Manila. I caught glimpses of future-proofing strategies of Philippine businesses through visits to four of the [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657634"
    },
    {
        "title": "Examples of low-cost motivational strategies",
        "link": "https://www.bworldonline.com/labor-and-management/2025/03/07/657702/examples-of-low-cost-motivational-strategies/",
        "description": "Last week, you wrote about the measurement system and general rules for motivating people without spending much money. Could you list specific examples? — Lone Ranger. The context of last week’s article was generally about the quality of one-on-one relationships with managers and their direct reports. It means the amount of trust, respect, and deep [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657702"
    },
    {
        "title": "Trade wars: friend or foe?",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/07/657679/trade-wars-friend-or-foe/",
        "description": "US President Donald J. Trump has decisively launched a trade war by imposing tariffs on the nation’s three most significant trading partners: China, Canada, and Mexico. In immediate retaliation, Canada and China have announced their tariffs on American goods. Mexico is expected to follow suit on Sunday. Trump has enforced a 25% tariff on imports [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657679"
    },
    {
        "title": "Job Losses by Industry (January 2025 vs December 2024, in thousands)",
        "link": "https://www.bworldonline.com/infographics/2025/03/07/657719/job-losses-by-industry-january-2025-vs-december-2024-in-thousands/",
        "description": "THE PHILIPPINES’ unemployment rate in January rose to its highest level in six months, as hiring declined after the holiday season, the statistics agency said on Thursday. Read the full story.",
        "guid": "https://www.bworldonline.com/?p=657719"
    },
    {
        "title": "Filinvest REIT, Filinvest Land sign deed of exchange for Festival Mall",
        "link": "https://www.bworldonline.com/corporate/2025/03/07/657741/filinvest-reit-filinvest-land-sign-deed-of-exchange-for-festival-mall/",
        "description": "FILINVEST REIT CORP. (FILRT) has executed a deed of exchange with its parent company and sponsor, Filinvest Land, Inc. (FLI), for the transfer of ownership of Festival Mall in Alabang, Muntinlupa City. The two companies executed the memorandum of agreement and the deed of exchange on March 5 as part of a P6.26-billion property-for-share swap [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657741"
    },
    {
        "title": "Managerial pay falls to P1,300 per day in January",
        "link": "https://www.bworldonline.com/labor-and-management/2025/03/07/657701/managerial-pay-falls-to-p1300-per-day-in-january/",
        "description": "MANAGERS averaged daily pay of P1,300 in January, down from P1,356 a year earlier, according to the Philippine Statistics Authority (PSA). Armed forces occupations were the second highest-paying jobs, with an average daily wage of P1,174 during the period, up from P1,095 a year earlier, according to the PSA’s Labor Force Survey released on Thursday. [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657701"
    },
    {
        "title": "Chinabank, Manulife Philippines renew bancassurance partnership for 15 years",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/07/657681/chinabank-manulife-philippines-renew-bancassurance-partnership-for-15-years/",
        "description": "CHINA BANKING Corp. (Chinabank) has renewed its bancassurance partnership with The Manufacturers Life Insurance Co. (Phils.), Inc. (Manulife Philippines) through Manulife Chinabank Life Assurance Corp. (MCBL). The Sy-led bank’s board of directors ratified the extension of the partnership in a regular meeting on Wednesday, it said in a disclosure to the stock exchange on Thursday. [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657681"
    },
    {
        "title": "Stuff to Do (03/07/25)",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/07/657657/stuff-to-do-03-07-25/",
        "description": "THE “Paint the Past” talk by Atelier de Legaspi will welcome mallgoers to drop by and learn about modern and contemporary art, particularly paintings.",
        "guid": "https://www.bworldonline.com/?p=657657"
    },
    {
        "title": "Post-event impressions: ‘An Imaginal Life’",
        "link": "https://www.bworldonline.com/opinion/2025/03/07/657636/post-event-impressions-an-imaginal-life/",
        "description": "The energy was high for the master class on “An Imaginal Life.” Soul friends and members of the Carl Jung Circle Center (CJCC) gathered to listen to Dr. Stephen Aizenstat, a psychotherapist, educator, and the founding president of the Pacifica Graduate Institute. He is the spiritual godfather to the Depth Institute of Asia, CJCC’s formal [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657636"
    },
    {
        "title": "Philippine Labor Force Situation",
        "link": "https://www.bworldonline.com/infographics/2025/03/07/657720/philippine-labor-force-situation-31/",
        "description": "THE PHILIPPINES’ unemployment rate in January rose to its highest level in six months, as hiring declined after the holiday season, the statistics agency said on Thursday. Read the full story.",
        "guid": "https://www.bworldonline.com/?p=657720"
    },
    {
        "title": "ATI deploys new cranes at Manila South Harbor",
        "link": "https://www.bworldonline.com/corporate/2025/03/07/657743/ati-deploys-new-cranes-at-manila-south-harbor/",
        "description": "ASIAN TERMINALS, Inc. (ATI) said it has commissioned two ship-to-shore (STS) cranes to increase handling capacity and operational efficiency at Manila South Harbor, its flagship international container terminal. “The deployment of these two new cranes significantly boosts Manila South Harbor’s capacity and efficiency, allowing us to handle larger vessels and more cargoes, which directly benefit [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657743"
    },
    {
        "title": "In the Lost Lands shows George R.R. Martin’s fantastical future",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/07/657658/in-the-lost-lands-shows-george-r-r-martins-fantastical-future/",
        "description": "LOS ANGELES — English director Paul W.S. Anderson believes that fans of writer George R.R. Martin’s Game of Thrones and House of the Dragon will have their hunger for more fantasy stories satisfied with the film In the Lost Lands. In the Lost Lands, which arrives in theaters on Friday and is distributed by Vertical, [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657658"
    },
    {
        "title": "Philippines still 2nd most impacted by terrorism in Asia-Pacific",
        "link": "https://www.bworldonline.com/infographics/2025/03/07/657727/philippines-still-2nd-most-impacted-by-terrorism-in-asia-pacific-2/",
        "description": "The Philippines continued to be the second-most impacted by terrorism in the Asia-Paciﬁc region after scoring 5.166 out of 10 (with 10 being the worst) in the 2025 edition of the Global Terrorism Index (GTI) by the Institute for Economics and Peace. The country’s rank improved by a notch to 20th out of 163 countries. [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657727"
    },
    {
        "title": "STT GDC Philippines goes fully renewable in data center operations",
        "link": "https://www.bworldonline.com/corporate/2025/03/07/657744/stt-gdc-philippines-goes-fully-renewable-in-data-center-operations/",
        "description": "ST TELEMEDIA Global Data Centres (STT GDC) Philippines, a data center solutions provider, said its data centers are now powered by renewable energy. “Operating on renewable energy is a significant step forward, showcasing our determination to lead the way in sustainability best practices within the data center industry,” STT GDC Philippines President and Chief Executive [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657744"
    },
    {
        "title": "Tonik Digital Bank’s cumulative loan disbursements breach 1M",
        "link": "https://www.bworldonline.com/banking-finance/2025/03/07/657683/tonik-digital-banks-cumulative-loan-disbursements-breach-1m/",
        "description": "TONIK Digital Bank, Inc. has breached one million in cumulative loan disbursements, it said on Thursday. “Reaching one million loans marks a major stride in our mission to deliver fast, accessible mass-market consumer credit across the Philippines. We’re scaling rapidly while turning an operational profit — a rare combo in fintech (financial technology) — and [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657683"
    },
    {
        "title": "Satirizing a bleak future in a wacky way",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/07/657659/satirizing-a-bleak-future-in-a-wacky-way/",
        "description": "THE WORLD can be described as cruel and uncaring, viewing people as expendable and the optics of power and influence as more important than empathy and compassion.",
        "guid": "https://www.bworldonline.com/?p=657659"
    },
    {
        "title": "NAC sees nickel prices rising on supply constraints",
        "link": "https://www.bworldonline.com/corporate/2025/03/07/657745/nac-sees-nickel-prices-rising-on-supply-constraints/",
        "description": "LISTED Nickel Asia Corp. (NAC) said it expects upward pressure on nickel prices due to potential supply constraints amid rising demand from the stainless steel and electric vehicle sectors. “Nickel supply visibility beyond 2027 is limited, considering the availability of ore supply, regulatory challenges, and execution risks of processing projects,” the company said in a [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657745"
    },
    {
        "title": "Pet lifestyle app launches dating, telemedicine services",
        "link": "https://www.bworldonline.com/arts-and-leisure/2025/03/07/657660/pet-lifestyle-app-launches-dating-telemedicine-services/",
        "description": "UNLEASH PH, a Filipino pet lifestyle app, has taken a step to revolutionize pet care. Since it launched in October, the app has served as an e-commerce platform through its Animall feature, as well as promoted its advocacy of adoption from shelters. On Feb. 28, Unleash PH unveiled more of its services. First is Meets, [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657660"
    },
    {
        "title": "Meralco eyes 35 MW for data centers this year",
        "link": "https://www.bworldonline.com/corporate/2025/03/07/657746/meralco-eyes-35-mw-for-data-centers-this-year/",
        "description": "POWER DISTRIBUTOR Manila Electric Co. (Meralco) is aiming to supply approximately 35 megawatts (MW) of power to data centers this year amid rising demand for digital infrastructure.",
        "guid": "https://www.bworldonline.com/?p=657746"
    },
    {
        "title": "ICTSI income up 66% in 2024, driven by operations in Asia",
        "link": "https://www.bworldonline.com/corporate/2025/03/07/657747/ictsi-income-up-66-in-2024-driven-by-operations-in-asia/",
        "description": "RAZON-LED International Container Terminal Services, Inc. (ICTSI) saw its 2024 attributable net income surge by 66.1% to $849.80 million from $511.53 million a year earlier, driven mainly by its operations in Asia. “The group has delivered another set of excellent results&#8230; giving us the financial strength and flexibility to pursue new opportunities and invest in [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657747"
    },
    {
        "title": "Megawide eyes April 14 listing for P6-B share offer",
        "link": "https://www.bworldonline.com/corporate/2025/03/07/657749/megawide-eyes-april-14-listing-for-p6-b-share-offer/",
        "description": "SAAVEDRA-LED Megawide Construction Corp. is eyeing an April 14 listing on the Philippine Stock Exchange (PSE) for its P5.95-billion preferred shares offering. The latest indicative terms as of March 5 show that the offer period will run from March 26 to April 4. The Philippine Stock Exchange approved the offer, according to a notice on [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657749"
    },
    {
        "title": "Ayala sells 40% of AC Logistics to Danish logistics giant",
        "link": "https://www.bworldonline.com/corporate/2025/03/07/657750/ayala-sells-40-of-ac-logistics-to-danish-logistics-giant/",
        "description": "DENMARK-BASED logistics giant A.P. Moller is acquiring up to 40% of Ayala Corp.’s logistics subsidiary AC Logistics Holdings Corp.",
        "guid": "https://www.bworldonline.com/?p=657750"
    },
    {
        "title": "DoTr studies ‘final termination’ of common station contract",
        "link": "https://www.bworldonline.com/corporate/2025/03/07/657748/dotr-studies-final-termination-of-common-station-contract/",
        "description": "THE Department of Transportation (DoTr) said it is evaluating the final termination of its contract with the contractors of the Unified Grand Central Station at North Avenue-EDSA, Quezon City, also known as the common station for the Metro Rail Transit (MRT) and Light Rail Transit (LRT) lines and the Metro Manila Subway. “Our legal team [&#8230;]",
        "guid": "https://www.bworldonline.com/?p=657748"
    },
    {
        "title": "Customs confident of hitting 2025 target despite tariff cuts",
        "link": "https://www.bworldonline.com/top-stories/2025/03/07/657770/customs-confident-of-hitting-2025-target-despite-tariff-cuts/",
        "description": "THE BUREAU of Customs (BoC) is confident it can meet its P1.06-trillion collection goal this year, despite lower tariffs on rice, electric vehicles (EV) and other commodities.",
        "guid": "https://www.bworldonline.com/?p=657770"
    },
    {
        "title": "More room for easing amid slow inflation — analysts",
        "link": "https://www.bworldonline.com/top-stories/2025/03/07/657771/more-room-for-easing-amid-slow-inflation-analysts/",
        "description": "THE BANGKO SENTRAL ng Pilipinas (BSP) has more room to further reduce interest rates due to an easing inflation outlook, though the need to be cautious remains amid uncertainties.",
        "guid": "https://www.bworldonline.com/?p=657771"
    },
    {
        "title": "Spiraling food prices muddle Philippine drive vs heart disease",
        "link": "https://www.bworldonline.com/top-stories/2025/03/07/657772/spiraling-food-prices-muddle-philippine-drive-vs-heart-disease/",
        "description": "LILY G. TERRENIO, 55, stocks up on instant noodles, powdered milk, canned sardines and other processed foods at the end of each month.",
        "guid": "https://www.bworldonline.com/?p=657772"
    },
    {
        "title": "PHL jobless rate hits 6-month high",
        "link": "https://www.bworldonline.com/top-stories/2025/03/07/657773/phl-jobless-rate-hits-6-month-high/",
        "description": "THE PHILIPPINES’ unemployment rate in January rose to its highest level in six months, as hiring declined after the holiday season, the statistics agency said on Thursday.",
        "guid": "https://www.bworldonline.com/?p=657773"
    }
]